#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x208 (0x2A8 - 0xA0)
// BlueprintGeneratedClass Comp_Audio_Pool_Manager.Comp_Audio_Pool_Manager_C
class UComp_Audio_Pool_Manager_C : public UAudioFoliageManagerComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xA0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                         ShowDebug;                                         // 0xA8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_24CF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Tick_Interval;                                     // 0xB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        WindPoolSize;                                      // 0xB8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        InsectPoolSize;                                    // 0xBC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        OneShotObjectPoolSize;                             // 0xC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        OneShotObjectsPerFoliage;                          // 0xC4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InitialStartDelayMin;                              // 0xC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InitialStartDelayMax;                              // 0xD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MinRetriggerTime;                                  // 0xD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MaxRetriggerTime;                                  // 0xE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class ABP_AudioPool_StaticLoop_C*>      StaticLoopAkObjects;                               // 0xE8(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TSet<class ABP_AudioPool_StaticLoop_C*>      AvailableStaticLoopObj;                            // 0x138(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TSet<class ABP_AudioPool_RandomLoop_C*>      RandomLoopAkObjects;                               // 0x188(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TSet<class ABP_AudioPool_OneShot_C*>         OneShotAkObjects;                                  // 0x1D8(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	class APawn*                                 PlayerCharacter;                                   // 0x228(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                               CachedListenerLocation;                            // 0x230(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class ABP_Env_Audio_Pool_Base_C*>       PoolObjectsInRange;                                // 0x248(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class ABP_Env_Audio_Pool_Base_C*>     ClosestPoolObjects;                                // 0x298(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Comp_Audio_Pool_Manager_C");
		return Clss;
	}

	void StaticLoopStopped(class ABP_AudioPool_StaticLoop_C* InPoolObject);
	void GetCritterValidFoliage(TArray<class ABP_Env_Audio_Pool_Base_C*>* InCritterValidFoliage, const TArray<class ABP_Env_Audio_Pool_Base_C*>& InLocalCritterValidFoliage, int32 InTemp_int_Array_Index_Variable, int32 InTemp_int_Loop_Counter_Variable, int32 InCallFunc_Add_IntInt_ReturnValue, TArray<class ABP_Env_Audio_Pool_Base_C*>& InCallFunc_Set_ToArray_Result, int32 InCallFunc_Array_Length_ReturnValue, class ABP_Env_Audio_Pool_Base_C* InCallFunc_Array_Get_Item, bool InCallFunc_Less_IntInt_ReturnValue, int32 InCallFunc_Array_Add_ReturnValue, bool InCallFunc_IsValid_ReturnValue, bool InCallFunc_IsValid_ReturnValue_1);
	void GetAvailableInsectEmitter(class ABP_AudioPool_RandomLoop_C** InEmitter, bool* InFound, TMap<struct FVector, class UObject*> InInsectLocations, bool InEmitterFound, class ABP_AudioPool_RandomLoop_C* InEmitterLocal, bool InTemp_bool_True_if_break_was_hit_Variable, int32 InTemp_int_Array_Index_Variable, bool InCallFunc_Not_PreBool_ReturnValue, int32 InTemp_int_Loop_Counter_Variable, int32 InCallFunc_Add_IntInt_ReturnValue, TArray<class ABP_AudioPool_RandomLoop_C*>& InCallFunc_Set_ToArray_Result, TArray<class ABP_AudioPool_RandomLoop_C*>& InCallFunc_Set_ToArray_Result_1, TArray<class AActor*>& InCallFunc_SortActorsByClosest_ReturnValue, class ABP_AudioPool_RandomLoop_C* InCallFunc_Array_Get_Item, int32 InCallFunc_Array_LastIndex_ReturnValue, class AActor* InCallFunc_Array_Get_Item_1, class ABP_AudioPool_RandomLoop_C* InK2Node_DynamicCast_AsBP_Audio_Pool_Random_Loop, bool InK2Node_DynamicCast_bSuccess, int32 InCallFunc_Array_Length_ReturnValue, bool InCallFunc_Less_IntInt_ReturnValue, bool InCallFunc_BooleanAND_ReturnValue);
	void GetAvailableStaticLoopEmitter(class ABP_AudioPool_StaticLoop_C** InOutput, bool* InAvailable, bool InBreak, class ABP_AudioPool_StaticLoop_C* InFoliageActor, double InLDistance, int32 InTemp_int_Array_Index_Variable, bool InCallFunc_Greater_DoubleDouble_ReturnValue, TArray<class ABP_AudioPool_StaticLoop_C*>& InCallFunc_Set_ToArray_Result, class ABP_AudioPool_StaticLoop_C* InCallFunc_Array_Get_Item, int32 InCallFunc_Set_Length_ReturnValue, const struct FVector& InCallFunc_GetValeriaAudioListenerPosition_OutLocation, const struct FVector& InCallFunc_GetValeriaAudioListenerPosition_OutFrontDir, const struct FVector& InCallFunc_GetValeriaAudioListenerPosition_OutRightDir, bool InCallFunc_Greater_IntInt_ReturnValue, int32 InTemp_int_Loop_Counter_Variable, int32 InCallFunc_Add_IntInt_ReturnValue, bool InCallFunc_IsValid_ReturnValue, TArray<class ABP_AudioPool_StaticLoop_C*>& InCallFunc_Set_ToArray_Result_1, int32 InCallFunc_Array_Length_ReturnValue, class ABP_AudioPool_StaticLoop_C* InCallFunc_Array_Get_Item_1, bool InCallFunc_Less_IntInt_ReturnValue, float InCallFunc_GetMaxAttenuationRadius_ReturnValue, const struct FVector& InCallFunc_K2_GetActorLocation_ReturnValue, double InCallFunc_Vector_Distance_ReturnValue, double InCallFunc_SafeDivide_ReturnValue, bool InCallFunc_Greater_DoubleDouble_ReturnValue_1, double InCallFunc_SafeDivide_B_ImplicitCast);
	void GetClosestInsectObjects(TArray<class ABP_Env_Audio_Pool_Base_C*>* InClosestInsectObjects, const TArray<class ABP_Env_Audio_Pool_Base_C*>& InLClosestInsectObjects, bool InTemp_bool_True_if_break_was_hit_Variable, int32 InTemp_int_Array_Index_Variable, bool InCallFunc_Not_PreBool_ReturnValue, int32 InTemp_int_Loop_Counter_Variable, int32 InCallFunc_Add_IntInt_ReturnValue, int32 InCallFunc_Array_Length_ReturnValue, class ABP_Env_Audio_Pool_Base_C* InCallFunc_Array_Get_Item, bool InCallFunc_Less_IntInt_ReturnValue, int32 InCallFunc_Array_Add_ReturnValue, bool InCallFunc_BooleanAND_ReturnValue, int32 InCallFunc_Add_IntInt_ReturnValue_1, bool InCallFunc_GreaterEqual_IntInt_ReturnValue);
	void GetClosestStaticLoopObjects(TArray<class ABP_Env_Audio_Pool_Base_C*>* InClosestStaticLoopObjects, const TArray<class ABP_Env_Audio_Pool_Base_C*>& InLClosestWindObjects, int32 InCallFunc_Array_Length_ReturnValue, int32 InTemp_int_Variable, class ABP_Env_Audio_Pool_Base_C* InCallFunc_Array_Get_Item, int32 InCallFunc_Add_IntInt_ReturnValue, int32 InCallFunc_Array_Add_ReturnValue, bool InCallFunc_Less_IntInt_ReturnValue, int32 InCallFunc_SelectInt_ReturnValue, int32 InCallFunc_Subtract_IntInt_ReturnValue, bool InCallFunc_LessEqual_IntInt_ReturnValue);
	void GetClosestObjects(TArray<class ABP_Env_Audio_Pool_Base_C*>* InClosestFoliage, const TArray<class ABP_Env_Audio_Pool_Base_C*>& InSortedObjectsNear, TSet<class ABP_Env_Audio_Pool_Base_C*> InLocalAllObjectsNear, const TArray<struct FVector>& InClosest, int32 InTemp_int_Array_Index_Variable, int32 InTemp_int_Loop_Counter_Variable, int32 InCallFunc_Add_IntInt_ReturnValue, TArray<class ABP_Env_Audio_Pool_Base_C*>& InCallFunc_Set_ToArray_Result, const struct FVector& InCallFunc_GetValeriaAudioListenerPosition_OutLocation, const struct FVector& InCallFunc_GetValeriaAudioListenerPosition_OutFrontDir, const struct FVector& InCallFunc_GetValeriaAudioListenerPosition_OutRightDir, TArray<class AActor*>& InCallFunc_SortActorsByClosest_ReturnValue, int32 InCallFunc_Array_Length_ReturnValue, class AActor* InCallFunc_Array_Get_Item, bool InCallFunc_Less_IntInt_ReturnValue, class ABP_Env_Audio_Pool_Base_C* InK2Node_DynamicCast_AsBP_Env_Audio_Pool_Base, bool InK2Node_DynamicCast_bSuccess, int32 InCallFunc_Array_Add_ReturnValue);
	void ReceiveBeginPlay();
	void ReceiveTick(float InDeltaSeconds);
	void DrawDebugText();
	void AudioDebugFoliage(bool InOn);
	void ExecuteUbergraph_Comp_Audio_Pool_Manager(int32 InEntryPoint, TArray<class AActor*>& InTemp_object_Variable, class ABP_AudioPool_StaticLoop_C* InCallFunc_GetAvailableStaticLoopEmitter_Output, bool InCallFunc_GetAvailableStaticLoopEmitter_Available, bool InCallFunc_Set_Remove_ReturnValue, TArray<class ABP_Env_Audio_Pool_Base_C*>& InCallFunc_GetClosestObjects_ClosestFoliage, int32 InTemp_int_Variable, int32 InCallFunc_Add_IntInt_ReturnValue, int32 InTemp_int_Loop_Counter_Variable, TArray<class ABP_Env_Audio_Pool_Base_C*>& InCallFunc_GetClosestStaticLoopObjects_ClosestStaticLoopObjects, int32 InCallFunc_Add_IntInt_ReturnValue_1, int32 InCallFunc_Array_Length_ReturnValue, bool InCallFunc_Less_IntInt_ReturnValue, const struct FTransform& InCallFunc_MakeTransform_ReturnValue, const struct FVector& InCallFunc_GetValeriaAudioListenerPosition_OutLocation, const struct FVector& InCallFunc_GetValeriaAudioListenerPosition_OutFrontDir, const struct FVector& InCallFunc_GetValeriaAudioListenerPosition_OutRightDir, TArray<enum class EObjectTypeQuery>& InK2Node_MakeArray_Array, TArray<class AActor*>& InCallFunc_SphereOverlapActors_OutActors, bool InCallFunc_SphereOverlapActors_ReturnValue, int32 InTemp_int_Array_Index_Variable, int32 InCallFunc_Array_Length_ReturnValue_1, class AActor* InCallFunc_Array_Get_Item, class ABP_Env_Audio_Pool_Base_C* InK2Node_DynamicCast_AsBP_Env_Audio_Pool_Base, bool InK2Node_DynamicCast_bSuccess, int32 InTemp_int_Loop_Counter_Variable_1, int32 InCallFunc_Add_IntInt_ReturnValue_2, int32 InTemp_int_Array_Index_Variable_1, int32 InTemp_int_Variable_1, int32 InCallFunc_Add_IntInt_ReturnValue_3, int32 InTemp_int_Loop_Counter_Variable_2, int32 InCallFunc_Add_IntInt_ReturnValue_4, int32 InTemp_int_Array_Index_Variable_2, float InK2Node_Event_DeltaSeconds, class AActor* InCallFunc_GetOwner_ReturnValue, class APawn* InK2Node_DynamicCast_AsPawn, bool InK2Node_DynamicCast_bSuccess_1, bool InCallFunc_IsLocallyControlled_ReturnValue, int32 InCallFunc_Subtract_IntInt_ReturnValue, class AActor* InCallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABP_AudioPool_OneShot_C* InCallFunc_FinishSpawningActor_ReturnValue, bool InCallFunc_IsServer_ReturnValue, bool InCallFunc_Not_PreBool_ReturnValue, bool InCallFunc_BooleanAND_ReturnValue, int32 InTemp_int_Variable_2, int32 InCallFunc_Multiply_IntInt_ReturnValue, bool InCallFunc_LessEqual_IntInt_ReturnValue, int32 InCallFunc_Add_IntInt_ReturnValue_5, bool InCallFunc_LessEqual_IntInt_ReturnValue_1, int32 InTemp_int_Loop_Counter_Variable_3, bool InCallFunc_Less_IntInt_ReturnValue_1, int32 InCallFunc_Add_IntInt_ReturnValue_6, bool InCallFunc_LessEqual_IntInt_ReturnValue_2, const struct FTransform& InCallFunc_MakeTransform_ReturnValue_1, int32 InTemp_int_Array_Index_Variable_3, class AActor* InCallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1, class ABP_Env_Audio_Pool_Base_C* InCallFunc_Array_Get_Item_1, bool InCallFunc_IsValid_ReturnValue, class ABP_AudioPool_RandomLoop_C* InCallFunc_FinishSpawningActor_ReturnValue_1, FDelegateProperty_ InK2Node_CreateDelegate_OutputDelegate, const class FString& InCallFunc_Conv_IntToString_ReturnValue, const struct FTransform& InCallFunc_MakeTransform_ReturnValue_2, class AActor* InCallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2, int32 InCallFunc_Set_Length_ReturnValue, const class FString& InCallFunc_Conv_IntToString_ReturnValue_1, class ABP_AudioPool_StaticLoop_C* InCallFunc_FinishSpawningActor_ReturnValue_2, TArray<class ABP_Env_Audio_Pool_Base_C*>& InCallFunc_Set_ToArray_Result, class ABP_Env_Audio_Pool_Base_C* InCallFunc_Array_Get_Item_2, int32 InCallFunc_Array_Length_ReturnValue_2, const struct FVector& InCallFunc_K2_GetActorLocation_ReturnValue, bool InCallFunc_Less_IntInt_ReturnValue_2, bool InCallFunc_IsValid_ReturnValue_1, int32 InCallFunc_Set_Length_ReturnValue_1, TArray<class ABP_AudioPool_RandomLoop_C*>& InCallFunc_Set_ToArray_Result_1, const class FString& InCallFunc_Conv_IntToString_ReturnValue_2, class ABP_AudioPool_RandomLoop_C* InCallFunc_Array_Get_Item_3, const class FString& InCallFunc_Concat_StrStr_ReturnValue, const struct FVector& InCallFunc_K2_GetActorLocation_ReturnValue_1, const class FString& InCallFunc_Concat_StrStr_ReturnValue_1, bool InCallFunc_IsValid_ReturnValue_2, const class FString& InCallFunc_Concat_StrStr_ReturnValue_2, const class FString& InCallFunc_Concat_StrStr_ReturnValue_3, int32 InCallFunc_Array_Length_ReturnValue_3, const class FString& InCallFunc_Concat_StrStr_ReturnValue_4, bool InCallFunc_Less_IntInt_ReturnValue_3, const class FString& InCallFunc_Concat_StrStr_ReturnValue_5, const class FString& InCallFunc_Concat_StrStr_ReturnValue_6, bool InK2Node_CustomEvent_On, double InCallFunc_SelectFloat_ReturnValue, const struct FTimerHandle& InCallFunc_K2_SetTimer_ReturnValue, const struct FVector& InCallFunc_K2_GetActorLocation_ReturnValue_2, float InCallFunc_SetComponentTickInterval_TickInterval_ImplicitCast, float InCallFunc_DrawDebugSphere_Duration_ImplicitCast, float InCallFunc_K2_SetTimer_Time_ImplicitCast, float InCallFunc_DrawDebugSphere_Duration_ImplicitCast_1);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
