#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x268 (0x290 - 0x28)
// Class Engine.Actor
class AActor : public UObject
{
public:
	struct FActorTickFunction                    PrimaryActorTick;                                  // 0x28(0x30)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                        bNetTemporary : 1;                                 // Mask: 0x1, PropSize: 0x10x58(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_15 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bOnlyRelevantToOwner : 1;                          // Mask: 0x4, PropSize: 0x10x58(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysRelevant : 1;                               // Mask: 0x8, PropSize: 0x10x58(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReplicateMovement : 1;                            // Mask: 0x10, PropSize: 0x10x58(0x1)(Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bCallPreReplication : 1;                           // Mask: 0x20, PropSize: 0x10x58(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bCallPreReplicationForReplay : 1;                  // Mask: 0x40, PropSize: 0x10x58(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bHidden : 1;                                       // Mask: 0x80, PropSize: 0x10x58(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bTearOff : 1;                                      // Mask: 0x1, PropSize: 0x10x59(0x1)(Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bForceNetAddressable : 1;                          // Mask: 0x2, PropSize: 0x10x59(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bExchangedRoles : 1;                               // Mask: 0x4, PropSize: 0x10x59(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNetLoadOnClient : 1;                              // Mask: 0x8, PropSize: 0x10x59(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNetUseOwnerRelevancy : 1;                         // Mask: 0x10, PropSize: 0x10x59(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRelevantForNetworkReplays : 1;                    // Mask: 0x20, PropSize: 0x10x59(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRelevantForLevelBounds : 1;                       // Mask: 0x40, PropSize: 0x10x59(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReplayRewindable : 1;                             // Mask: 0x80, PropSize: 0x10x59(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowTickBeforeBeginPlay : 1;                     // Mask: 0x1, PropSize: 0x10x5A(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAutoDestroyWhenFinished : 1;                      // Mask: 0x2, PropSize: 0x10x5A(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bCanBeDamaged : 1;                                 // Mask: 0x4, PropSize: 0x10x5A(0x1)(Edit, BlueprintVisible, Net, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bBlockInput : 1;                                   // Mask: 0x8, PropSize: 0x10x5A(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCollideWhenPlacing : 1;                           // Mask: 0x10, PropSize: 0x10x5A(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bFindCameraComponentWhenViewTarget : 1;            // Mask: 0x20, PropSize: 0x10x5A(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bGenerateOverlapEventsDuringLevelStreaming : 1;    // Mask: 0x40, PropSize: 0x10x5A(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoresOriginShifting : 1;                        // Mask: 0x80, PropSize: 0x10x5A(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableAutoLODGeneration : 1;                      // Mask: 0x1, PropSize: 0x10x5B(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsEditorOnlyActor : 1;                            // Mask: 0x2, PropSize: 0x10x5B(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bActorSeamlessTraveled : 1;                        // Mask: 0x4, PropSize: 0x10x5B(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReplicates : 1;                                   // Mask: 0x8, PropSize: 0x10x5B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCanBeInCluster : 1;                               // Mask: 0x10, PropSize: 0x10x5B(0x1)(Edit, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowReceiveTickEventOnDedicatedServer : 1;       // Mask: 0x20, PropSize: 0x10x5B(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_16 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x80, PropSize: 0x10x5B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_17 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bActorEnableCollision : 1;                         // Mask: 0x80, PropSize: 0x10x5C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bActorIsBeingDestroyed : 1;                        // Mask: 0x1, PropSize: 0x10x5D(0x1)(Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_18 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAsyncPhysicsTickEnabled : 1;                      // Mask: 0x20, PropSize: 0x10x5D(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_19 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class EActorUpdateOverlapsMethod        UpdateOverlapsMethodDuringLevelStreaming;          // 0x5E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EActorUpdateOverlapsMethod        DefaultUpdateOverlapsMethodDuringLevelStreaming;   // 0x5F(0x1)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        InitialLifeSpan;                                   // 0x60(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CustomTimeDilation;                                // 0x64(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENetRole                          RemoteRole;                                        // 0x68(0x1)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_24D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RayTracingGroupId;                                 // 0x6C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRepAttachment                        AttachmentReplication;                             // 0x70(0x60)(Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FRepMovement                          ReplicatedMovement;                                // 0xD0(0x70)(Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPrivate)
	class AActor*                                Owner;                                             // 0x140(0x8)(Net, ZeroConstructor, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  NetDriverName;                                     // 0x148(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ENetRole                          Role;                                              // 0x150(0x1)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ENetDormancy                      NetDormancy;                                       // 0x151(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod;                      // 0x152(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAutoReceiveInput                 AutoReceiveInput;                                  // 0x153(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InputPriority;                                     // 0x154(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_252[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UInputComponent*                       InputComponent;                                    // 0x160(0x8)(ExportObject, ZeroConstructor, InstancedReference, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NetCullDistanceSquared;                            // 0x168(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NetTag;                                            // 0x16C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NetUpdateFrequency;                                // 0x170(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinNetUpdateFrequency;                             // 0x174(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NetPriority;                                       // 0x178(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_258[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class APawn*                                 Instigator;                                        // 0x180(0x8)(BlueprintVisible, Net, ZeroConstructor, RepNotify, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                        Children;                                          // 0x188(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	class USceneComponent*                       RootComponent;                                     // 0x198(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          Layers;                                            // 0x1A8(0x10)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UChildActorComponent>   ParentComponent;                                   // 0x1B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                          Tags;                                              // 0x1C0(0x10)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnTakeAnyDamage;                                   // 0x1D0(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnTakePointDamage;                                 // 0x1D1(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnTakeRadialDamage;                                // 0x1D2(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnActorBeginOverlap;                               // 0x1D3(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnActorEndOverlap;                                 // 0x1D4(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x1D5(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x1D6(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x1D7(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x1D8(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x1D9(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x1DA(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x1DB(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x1DC(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnActorHit;                                        // 0x1DD(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnDestroyed;                                       // 0x1DE(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnEndPlay;                                         // 0x1DF(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_25F[0x80];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UActorComponent*>               InstanceComponents;                                // 0x260(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UActorComponent*>               BlueprintCreatedComponents;                        // 0x270(0x10)(ExportObject, ZeroConstructor, NonTransactional, ContainsInstancedReference, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_260[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Actor");
		return Clss;
	}

	bool WasRecentlyRendered(float InTolerance);
	void UserConstructionScript();
	void TearOff();
	void SetTickGroup(enum class ETickingGroup InNewTickGroup);
	void SetTickableWhenPaused(bool InbTickableWhenPaused);
	void SetReplicates(bool InbInReplicates);
	void SetReplicateMovement(bool InbInReplicateMovement);
	void SetRayTracingGroupId(int32 InInRaytracingGroupId);
	void SetOwner(class AActor* InNewOwner);
	void SetNetDormancy(enum class ENetDormancy InNewDormancy);
	void SetLifeSpan(float InInLifespan);
	void SetAutoDestroyWhenFinished(bool InbVal);
	void SetActorTickInterval(float InTickInterval);
	void SetActorTickEnabled(bool InbEnabled);
	void SetActorScale3D(const struct FVector& InNewScale3D);
	void SetActorRelativeScale3D(const struct FVector& InNewRelativeScale);
	void SetActorHiddenInGame(bool InbNewHidden);
	void SetActorEnableCollision(bool InbNewActorEnableCollision);
	void RemoveTickPrerequisiteComponent(class UActorComponent* InPrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor* InPrerequisiteActor);
	void ReceiveTick(float InDeltaSeconds);
	void ReceiveRadialDamage(float InDamageReceived, class UDamageType* InDamageType, const struct FVector& InOrigin, struct FHitResult& InHitInfo, class AController* InInstigatedBy, class AActor* InDamageCauser);
	void ReceivePointDamage(float InDamage, class UDamageType* InDamageType, const struct FVector& InHitLocation, const struct FVector& InHitNormal, class UPrimitiveComponent* InHitComponent, class FName InBoneName, const struct FVector& InShotFromDirection, class AController* InInstigatedBy, class AActor* InDamageCauser, struct FHitResult& InHitInfo);
	void ReceiveHit(class UPrimitiveComponent* InMyComp, class AActor* InOther, class UPrimitiveComponent* InOtherComp, bool InbSelfMoved, const struct FVector& InHitLocation, const struct FVector& InHitNormal, const struct FVector& InNormalImpulse, struct FHitResult& InHit);
	void ReceiveEndPlay(enum class EEndPlayReason InEndPlayReason);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void ReceiveAsyncPhysicsTick(float InDeltaSeconds, float InSimSeconds);
	void ReceiveAnyDamage(float InDamage, class UDamageType* InDamageType, class AController* InInstigatedBy, class AActor* InDamageCauser);
	void ReceiveActorOnReleased(const struct FKey& InButtonReleased);
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex InFingerIndex);
	void ReceiveActorOnInputTouchEnter(enum class ETouchIndex InFingerIndex);
	void ReceiveActorOnInputTouchEnd(enum class ETouchIndex InFingerIndex);
	void ReceiveActorOnInputTouchBegin(enum class ETouchIndex InFingerIndex);
	void ReceiveActorOnClicked(const struct FKey& InButtonPressed);
	void ReceiveActorEndOverlap(class AActor* InOtherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorBeginOverlap(class AActor* InOtherActor);
	void ReceiveActorBeginCursorOver();
	void PrestreamTextures(float InSeconds, bool InbEnableStreaming, int32 InCinematicTextureGroups);
	void OnRep_ReplicateMovement();
	void OnRep_ReplicatedMovement();
	void OnRep_Owner();
	void OnRep_Instigator();
	void OnRep_AttachmentReplication();
	void MakeNoise(float InLoudness, class APawn* InNoiseInstigator, const struct FVector& InNoiseLocation, float InMaxRange, class FName InTag);
	bool K2_TeleportTo(const struct FVector& InDestLocation, const struct FRotator& InDestRotation);
	bool K2_SetActorTransform(struct FTransform& InNewTransform, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	bool K2_SetActorRotation(const struct FRotator& InNewRotation, bool InbTeleportPhysics);
	void K2_SetActorRelativeTransform(struct FTransform& InNewRelativeTransform, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_SetActorRelativeRotation(const struct FRotator& InNewRelativeRotation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_SetActorRelativeLocation(const struct FVector& InNewRelativeLocation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	bool K2_SetActorLocationAndRotation(const struct FVector& InNewLocation, const struct FRotator& InNewRotation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	bool K2_SetActorLocation(const struct FVector& InNewLocation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_OnReset();
	void K2_OnEndViewTarget(class APlayerController* InPC);
	void K2_OnBecomeViewTarget(class APlayerController* InPC);
	class USceneComponent* K2_GetRootComponent();
	TArray<class UActorComponent*> K2_GetComponentsByClass(TSubclassOf<class UActorComponent> InComponentClass);
	struct FRotator K2_GetActorRotation();
	struct FVector K2_GetActorLocation();
	void K2_DetachFromActor(enum class EDetachmentRule InLocationRule, enum class EDetachmentRule InRotationRule, enum class EDetachmentRule InScaleRule);
	void K2_DestroyActor();
	void K2_AttachToComponent(class USceneComponent* InParent, class FName InSocketName, enum class EAttachmentRule InLocationRule, enum class EAttachmentRule InRotationRule, enum class EAttachmentRule InScaleRule, bool InbWeldSimulatedBodies);
	void K2_AttachToActor(class AActor* InParentActor, class FName InSocketName, enum class EAttachmentRule InLocationRule, enum class EAttachmentRule InRotationRule, enum class EAttachmentRule InScaleRule, bool InbWeldSimulatedBodies);
	void K2_AttachRootComponentToActor(class AActor* InInParentActor, class FName InInSocketName, enum class EAttachLocation InAttachLocationType, bool InbWeldSimulatedBodies);
	void K2_AttachRootComponentTo(class USceneComponent* InInParent, class FName InInSocketName, enum class EAttachLocation InAttachLocationType, bool InbWeldSimulatedBodies);
	void K2_AddActorWorldTransformKeepScale(struct FTransform& InDeltaTransform, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddActorWorldTransform(struct FTransform& InDeltaTransform, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddActorWorldRotation(const struct FRotator& InDeltaRotation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddActorWorldOffset(const struct FVector& InDeltaLocation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddActorLocalTransform(struct FTransform& InNewTransform, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddActorLocalRotation(const struct FRotator& InDeltaRotation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddActorLocalOffset(const struct FVector& InDeltaLocation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	bool IsOverlappingActor(class AActor* InOther);
	bool IsChildActor();
	bool IsActorTickEnabled();
	bool IsActorBeingDestroyed();
	bool HasAuthority();
	float GetVerticalDistanceTo(class AActor* InOtherActor);
	struct FVector GetVelocity();
	struct FTransform GetTransform();
	bool GetTickableWhenPaused();
	float GetSquaredHorizontalDistanceTo(class AActor* InOtherActor);
	float GetSquaredDistanceTo(class AActor* InOtherActor);
	enum class ENetRole GetRemoteRole();
	int32 GetRayTracingGroupId();
	class UChildActorComponent* GetParentComponent();
	class AActor* GetParentActor();
	class AActor* GetOwner();
	void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* InOverlappingComponents);
	void GetOverlappingActors(TArray<class AActor*>* InOverlappingActors, TSubclassOf<class AActor> InClassFilter);
	enum class ENetRole GetLocalRole();
	float GetLifeSpan();
	struct FTransform GetLevelTransform();
	class ULevel* GetLevel();
	class AController* GetInstigatorController();
	class APawn* GetInstigator();
	struct FVector GetInputVectorAxisValue(const struct FKey& InInputAxisKey);
	float GetInputAxisValue(class FName InInputAxisName);
	float GetInputAxisKeyValue(const struct FKey& InInputAxisKey);
	float GetHorizontalDotProductTo(class AActor* InOtherActor);
	float GetHorizontalDistanceTo(class AActor* InOtherActor);
	float GetGameTimeSinceCreation();
	float GetDotProductTo(class AActor* InOtherActor);
	float GetDistanceTo(class AActor* InOtherActor);
	TArray<class UActorComponent*> GetComponentsByTag(TSubclassOf<class UActorComponent> InComponentClass, class FName InTag);
	TArray<class UActorComponent*> GetComponentsByInterface(TSubclassOf<class IInterface> InInterface);
	class UActorComponent* GetComponentByClass(TSubclassOf<class UActorComponent> InComponentClass);
	class FName GetAttachParentSocketName();
	class AActor* GetAttachParentActor();
	void GetAttachedActors(TArray<class AActor*>* InOutActors, bool InbResetArray, bool InbRecursivelyIncludeAttachedActors);
	void GetAllChildActors(TArray<class AActor*>* InChildActors, bool InbIncludeDescendants);
	struct FVector GetActorUpVector();
	float GetActorTimeDilation();
	float GetActorTickInterval();
	struct FVector GetActorScale3D();
	struct FVector GetActorRightVector();
	struct FVector GetActorRelativeScale3D();
	struct FVector GetActorForwardVector();
	void GetActorEyesViewPoint(struct FVector* InOutLocation, struct FRotator* InOutRotation);
	bool GetActorEnableCollision();
	void GetActorBounds(bool InbOnlyCollidingComponents, struct FVector* InOrigin, struct FVector* InBoxExtent, bool InbIncludeFromChildActors);
	void ForceNetUpdate();
	void FlushNetDormancy();
	void FinishAddComponent(class UActorComponent* InComponent, bool InbManualAttachment, struct FTransform& InRelativeTransform);
	void EnableInput(class APlayerController* InPlayerController);
	void DisableInput(class APlayerController* InPlayerController);
	void DetachRootComponentFromParent(bool InbMaintainWorldPosition);
	void AddTickPrerequisiteComponent(class UActorComponent* InPrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor* InPrerequisiteActor);
	class UActorComponent* AddComponentByClass(TSubclassOf<class UActorComponent> InClass, bool InbManualAttachment, struct FTransform& InRelativeTransform, bool InbDeferredFinish);
	class UActorComponent* AddComponent(class FName InTemplateName, bool InbManualAttachment, struct FTransform& InRelativeTransform, class UObject* InComponentTemplateContext, bool InbDeferredFinish);
	bool ActorHasTag(class FName InTag);
};

// 0xF0 (0x380 - 0x290)
// Class Engine.HUD
class AHUD : public AActor
{
public:
	class APlayerController*                     PlayerOwner;                                       // 0x290(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLostFocusPaused : 1;                              // Mask: 0x1, PropSize: 0x10x298(0x1)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowHUD : 1;                                      // Mask: 0x2, PropSize: 0x10x298(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowDebugInfo : 1;                                // Mask: 0x4, PropSize: 0x10x298(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_1A : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_2D2[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CurrentTargetIndex;                                // 0x29C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowHitBoxDebugInfo : 1;                          // Mask: 0x1, PropSize: 0x10x2A0(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowOverlays : 1;                                 // Mask: 0x2, PropSize: 0x10x2A0(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableDebugTextShadow : 1;                        // Mask: 0x4, PropSize: 0x10x2A0(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_1B : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_2D3[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        PostRenderedActors;                                // 0x2A8(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_2D4[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          DebugDisplay;                                      // 0x2C0(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<class FName>                          ToggledDebugCategories;                            // 0x2D0(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	class UCanvas*                               Canvas;                                            // 0x2E0(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvas*                               DebugCanvas;                                       // 0x2E8(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDebugTextInfo>                DebugTextList;                                     // 0x2F0(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                    ShowDebugTargetDesiredClass;                       // 0x300(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                ShowDebugTargetActor;                              // 0x308(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2D5[0x70];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("HUD");
		return Clss;
	}

	void ShowHUD();
	void ShowDebugToggleSubCategory(class FName InCategory);
	void ShowDebugForReticleTargetToggle(TSubclassOf<class AActor> InDesiredClass);
	void ShowDebug(class FName InDebugType);
	void RemoveDebugText(class AActor* InSrcActor, bool InbLeaveDurationText);
	void RemoveAllDebugStrings();
	void ReceiveHitBoxRelease(class FName InBoxName);
	void ReceiveHitBoxEndCursorOver(class FName InBoxName);
	void ReceiveHitBoxClick(class FName InBoxName);
	void ReceiveHitBoxBeginCursorOver(class FName InBoxName);
	void ReceiveDrawHUD(int32 InSizeX, int32 InSizeY);
	struct FVector Project(const struct FVector& InLocation, bool InbClampToZeroPlane);
	void PreviousDebugTarget();
	void NextDebugTarget();
	void GetTextSize(const class FString& InText, float* InOutWidth, float* InOutHeight, class UFont* InFont, float InScale);
	class APlayerController* GetOwningPlayerController();
	class APawn* GetOwningPawn();
	void GetActorsInSelectionRectangle(TSubclassOf<class AActor> InClassFilter, struct FVector2D& InFirstPoint, struct FVector2D& InSecondPoint, TArray<class AActor*>* InOutActors, bool InbIncludeNonCollidingComponents, bool InbActorMustBeFullyEnclosed);
	void DrawTextureSimple(class UTexture* InTexture, float InScreenX, float InScreenY, float InScale, bool InbScalePosition);
	void DrawTexture(class UTexture* InTexture, float InScreenX, float InScreenY, float InScreenW, float InScreenH, float InTextureU, float InTextureV, float InTextureUWidth, float InTextureVHeight, const struct FLinearColor& InTintColor, enum class EBlendMode InBlendMode, float InScale, bool InbScalePosition, float InRotation, const struct FVector2D& InRotPivot);
	void DrawText(const class FString& InText, const struct FLinearColor& InTextColor, float InScreenX, float InScreenY, class UFont* InFont, float InScale, bool InbScalePosition);
	void DrawRect(const struct FLinearColor& InRectColor, float InScreenX, float InScreenY, float InScreenW, float InScreenH);
	void DrawMaterialTriangle(class UMaterialInterface* InMaterial, const struct FVector2D& InV0_Pos, const struct FVector2D& InV1_Pos, const struct FVector2D& InV2_Pos, const struct FVector2D& InV0_UV, const struct FVector2D& InV1_UV, const struct FVector2D& InV2_UV, const struct FLinearColor& InV0_Color, const struct FLinearColor& InV1_Color, const struct FLinearColor& InV2_Color);
	void DrawMaterialSimple(class UMaterialInterface* InMaterial, float InScreenX, float InScreenY, float InScreenW, float InScreenH, float InScale, bool InbScalePosition);
	void DrawMaterial(class UMaterialInterface* InMaterial, float InScreenX, float InScreenY, float InScreenW, float InScreenH, float InMaterialU, float InMaterialV, float InMaterialUWidth, float InMaterialVHeight, float InScale, bool InbScalePosition, float InRotation, const struct FVector2D& InRotPivot);
	void DrawLine(float InStartScreenX, float InStartScreenY, float InEndScreenX, float InEndScreenY, const struct FLinearColor& InLineColor, float InLineThickness);
	void Deproject(float InScreenX, float InScreenY, struct FVector* InWorldPosition, struct FVector* InWorldDirection);
	void AddHitBox(const struct FVector2D& InPosition, const struct FVector2D& InSize, class FName InInName, bool InbConsumesInput, int32 InPriority);
	void AddDebugText(const class FString& InDebugText, class AActor* InSrcActor, float InDuration, const struct FVector& InOffset, const struct FVector& InDesiredOffset, const struct FColor& InTextColor, bool InbSkipOverwriteCheck, bool InbAbsoluteLocation, bool InbKeepAttachedToActor, class UFont* InInFont, float InFontScale, bool InbDrawShadow);
};

// 0x8 (0x30 - 0x28)
// Class Engine.BlueprintAsyncActionBase
class UBlueprintAsyncActionBase : public UObject
{
public:
	uint8                                        Pad_2DB[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BlueprintAsyncActionBase");
		return Clss;
	}

	void Activate();
};

// 0x0 (0x30 - 0x30)
// Class Engine.CancellableAsyncAction
class UCancellableAsyncAction : public UBlueprintAsyncActionBase
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("CancellableAsyncAction");
		return Clss;
	}

	bool IsActive();
	void Cancel();
};

// 0x8 (0x30 - 0x28)
// Class Engine.DataAsset
class UDataAsset : public UObject
{
public:
	TSubclassOf<class UDataAsset>                NativeClass;                                       // 0x28(0x8)(ZeroConstructor, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("DataAsset");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.BlueprintFunctionLibrary
class UBlueprintFunctionLibrary : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BlueprintFunctionLibrary");
		return Clss;
	}

};

// 0x78 (0xA0 - 0x28)
// Class Engine.ActorComponent
class UActorComponent : public UObject
{
public:
	uint8                                        Pad_2F2[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FActorComponentTickFunction           PrimaryComponentTick;                              // 0x30(0x30)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FName>                          ComponentTags;                                     // 0x60(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x70(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_2F3[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        UCSSerializationIndex;                             // 0x84(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_1E : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bNetAddressable : 1;                               // Mask: 0x8, PropSize: 0x10x88(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x10, PropSize: 0x10x88(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bReplicates : 1;                                   // Mask: 0x20, PropSize: 0x10x88(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_1F : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_2F4[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        BitPad_20 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAutoActivate : 1;                                 // Mask: 0x2, PropSize: 0x10x8A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsActive : 1;                                     // Mask: 0x4, PropSize: 0x10x8A(0x1)(Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bEditableWhenInherited : 1;                        // Mask: 0x8, PropSize: 0x10x8A(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_21 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bCanEverAffectNavigation : 1;                      // Mask: 0x20, PropSize: 0x10x8A(0x1)(Edit, Config, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_22 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bIsEditorOnly : 1;                                 // Mask: 0x80, PropSize: 0x10x8A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F8[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EComponentCreationMethod          CreationMethod;                                    // 0x8D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentActivated;                              // 0x8E(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentDeactivated;                            // 0x8F(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F9[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ActorComponent");
		return Clss;
	}

	void ToggleActive();
	void SetTickGroup(enum class ETickingGroup InNewTickGroup);
	void SetTickableWhenPaused(bool InbTickableWhenPaused);
	void SetIsReplicated(bool InShouldReplicate);
	void SetComponentTickIntervalAndCooldown(float InTickInterval);
	void SetComponentTickInterval(float InTickInterval);
	void SetComponentTickEnabled(bool InbEnabled);
	void SetAutoActivate(bool InbNewAutoActivate);
	void SetActive(bool InbNewActive, bool InbReset);
	void RemoveTickPrerequisiteComponent(class UActorComponent* InPrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor* InPrerequisiteActor);
	void ReceiveTick(float InDeltaSeconds);
	void ReceiveEndPlay(enum class EEndPlayReason InEndPlayReason);
	void ReceiveBeginPlay();
	void ReceiveAsyncPhysicsTick(float InDeltaSeconds, float InSimSeconds);
	void OnRep_IsActive();
	void K2_DestroyComponent(class UObject* InObject);
	bool IsComponentTickEnabled();
	bool IsBeingDestroyed();
	bool IsActive();
	class AActor* GetOwner();
	float GetComponentTickInterval();
	void Deactivate();
	bool ComponentHasTag(class FName InTag);
	void AddTickPrerequisiteComponent(class UActorComponent* InPrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor* InPrerequisiteActor);
	void Activate(bool InbReset);
};

// 0x88 (0x318 - 0x290)
// Class Engine.Pawn
class APawn : public AActor
{
public:
	uint8                                        Pad_324[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bUseControllerRotationPitch : 1;                   // Mask: 0x1, PropSize: 0x10x298(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseControllerRotationYaw : 1;                     // Mask: 0x2, PropSize: 0x10x298(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseControllerRotationRoll : 1;                    // Mask: 0x4, PropSize: 0x10x298(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanAffectNavigationGeneration : 1;                // Mask: 0x8, PropSize: 0x10x298(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_28 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bIsLocalViewTarget : 1;                            // Mask: 0x40, PropSize: 0x10x298(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_29 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_325[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BaseEyeHeight;                                     // 0x29C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAutoReceiveInput                 AutoPossessPlayer;                                 // 0x2A0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAutoPossessAI                    AutoPossessAI;                                     // 0x2A1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        RemoteViewPitch;                                   // 0x2A2(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32A[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AController>               AIControllerClass;                                 // 0x2A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                          PlayerState;                                       // 0x2B0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_330[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           LastHitBy;                                         // 0x2C0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           Controller;                                        // 0x2C8(0x8)(Net, ZeroConstructor, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           PreviousController;                                // 0x2D0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_332[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastSparseDelegateProperty_            ReceiveControllerChangedDelegate;                  // 0x2DC(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            ReceiveRestartedDelegate;                          // 0x2DD(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_333[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ControlInputVector;                                // 0x2E0(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               LastControlInputVector;                            // 0x2F8(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UInputComponent>           OverrideInputComponentClass;                       // 0x310(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Pawn");
		return Clss;
	}

	void SpawnDefaultController();
	void SetCanAffectNavigationGeneration(bool InbNewValue, bool InbForceUpdate);
	void ReceiveUnpossessed(class AController* InOldController);
	void ReceiveRestarted();
	void ReceivePossessed(class AController* InNewController);
	void ReceiveControllerChanged(class AController* InOldController, class AController* InNewController);
	void PawnMakeNoise(float InLoudness, const struct FVector& InNoiseLocation, bool InbUseNoiseMakerLocation, class AActor* InNoiseMaker);
	void OnRep_PlayerState();
	void OnRep_Controller();
	bool IsPlayerControlled();
	bool IsPawnControlled();
	bool IsMoveInputIgnored();
	bool IsLocallyViewed();
	bool IsLocallyControlled();
	bool IsControlled();
	bool IsBotControlled();
	struct FVector GetPendingMovementInputVector();
	TSubclassOf<class UInputComponent> GetOverrideInputComponentClass();
	struct FVector GetNavAgentLocation();
	class UPawnMovementComponent* GetMovementComponent();
	class AActor* GetMovementBaseActor(class APawn* InPawn);
	class APlayerController* GetLocalViewingPlayerController();
	struct FVector GetLastMovementInputVector();
	struct FRotator GetControlRotation();
	class AController* GetController();
	struct FRotator GetBaseAimRotation();
	void DetachFromControllerPendingDestroy();
	struct FVector ConsumeMovementInputVector();
	void AddMovementInput(const struct FVector& InWorldDirection, float InScaleValue, bool InbForce);
	void AddControllerYawInput(float InVal);
	void AddControllerRollInput(float InVal);
	void AddControllerPitchInput(float InVal);
};

// 0x28 (0x340 - 0x318)
// Class Engine.DefaultPawn
class ADefaultPawn : public APawn
{
public:
	float                                        BaseTurnRate;                                      // 0x318(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BaseLookUpRate;                                    // 0x31C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPawnMovementComponent*                MovementComponent;                                 // 0x320(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USphereComponent*                      CollisionComponent;                                // 0x328(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  MeshComponent;                                     // 0x330(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bAddDefaultMovementBindings : 1;                   // Mask: 0x1, PropSize: 0x10x338(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_33E[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("DefaultPawn");
		return Clss;
	}

	void TurnAtRate(float InRate);
	void MoveUp_World(float InVal);
	void MoveRight(float InVal);
	void MoveForward(float InVal);
	void LookUpAtRate(float InRate);
};

// 0x10 (0x38 - 0x28)
// Class Engine.AnimNotify
class UAnimNotify : public UObject
{
public:
	uint8                                        Pad_341[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnimNotify");
		return Clss;
	}

	bool Received_Notify(class USkeletalMeshComponent* InMeshComp, class UAnimSequenceBase* InAnimation, struct FAnimNotifyEventReference& InEventReference);
	class FString GetNotifyName();
	float GetDefaultTriggerWeightThreshold();
};

// 0x8 (0x30 - 0x28)
// Class Engine.AnimNotifyState
class UAnimNotifyState : public UObject
{
public:
	uint8                                        Pad_34C[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AnimNotifyState");
		return Clss;
	}

	bool Received_NotifyTick(class USkeletalMeshComponent* InMeshComp, class UAnimSequenceBase* InAnimation, float InFrameDeltaTime, struct FAnimNotifyEventReference& InEventReference);
	bool Received_NotifyEnd(class USkeletalMeshComponent* InMeshComp, class UAnimSequenceBase* InAnimation, struct FAnimNotifyEventReference& InEventReference);
	bool Received_NotifyBegin(class USkeletalMeshComponent* InMeshComp, class UAnimSequenceBase* InAnimation, float InTotalDuration, struct FAnimNotifyEventReference& InEventReference);
	class FString GetNotifyName();
	float GetDefaultTriggerWeightThreshold();
};

// 0x28 (0x50 - 0x28)
// Class Engine.BlueprintCore
class UBlueprintCore : public UObject
{
public:
	TSubclassOf<class UObject>                   SkeletonGeneratedClass;                            // 0x28(0x8)(ZeroConstructor, Transient, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                   GeneratedClass;                                    // 0x30(0x8)(ZeroConstructor, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLegacyNeedToPurgeSkelRefs;                        // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_34D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 BlueprintGuid;                                     // 0x3C(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_34E[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BlueprintCore");
		return Clss;
	}

};

// 0x58 (0xA8 - 0x50)
// Class Engine.Blueprint
class UBlueprint : public UBlueprintCore
{
public:
	uint8                                        Pad_34F[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UObject>                   ParentClass;                                       // 0x58(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBlueprintType                    BlueprintType;                                     // 0x60(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRecompileOnLoad : 1;                              // Mask: 0x1, PropSize: 0x10x61(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasBeenRegenerated : 1;                           // Mask: 0x2, PropSize: 0x10x61(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsRegeneratingOnLoad : 1;                         // Mask: 0x4, PropSize: 0x10x61(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_2B : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_351[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        BlueprintSystemVersion;                            // 0x64(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USimpleConstructionScript*             SimpleConstructionScript;                          // 0x68(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>               ComponentTemplates;                                // 0x70(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UTimelineTemplate*>             Timelines;                                         // 0x80(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FBPComponentClassOverride>     ComponentClassOverrides;                           // 0x90(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UInheritableComponentHandler*          InheritableComponentHandler;                       // 0xA0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Blueprint");
		return Clss;
	}

};

// 0x200 (0x2A0 - 0xA0)
// Class Engine.SceneComponent
class USceneComponent : public UActorComponent
{
public:
	uint8                                        Pad_3D5[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class APhysicsVolume>         PhysicsVolume;                                     // 0xA8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                       AttachParent;                                      // 0xB0(0x8)(ExportObject, Net, ZeroConstructor, InstancedReference, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  AttachSocketName;                                  // 0xB8(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class USceneComponent*>               AttachChildren;                                    // 0xC0(0x10)(ExportObject, Net, ZeroConstructor, Transient, RepNotify, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class USceneComponent*>               ClientAttachedChildren;                            // 0xD0(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3D8[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RelativeLocation;                                  // 0x128(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator                              RelativeRotation;                                  // 0x140(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	struct FVector                               RelativeScale3D;                                   // 0x158(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               ComponentVelocity;                                 // 0x170(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bComponentToWorldUpdated : 1;                      // Mask: 0x1, PropSize: 0x10x188(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_31 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAbsoluteLocation : 1;                             // Mask: 0x4, PropSize: 0x10x188(0x1)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bAbsoluteRotation : 1;                             // Mask: 0x8, PropSize: 0x10x188(0x1)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bAbsoluteScale : 1;                                // Mask: 0x10, PropSize: 0x10x188(0x1)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bVisible : 1;                                      // Mask: 0x20, PropSize: 0x10x188(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bShouldBeAttached : 1;                             // Mask: 0x40, PropSize: 0x10x188(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bShouldSnapLocationWhenAttached : 1;               // Mask: 0x80, PropSize: 0x10x188(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bShouldSnapRotationWhenAttached : 1;               // Mask: 0x1, PropSize: 0x10x189(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bShouldSnapScaleWhenAttached : 1;                  // Mask: 0x2, PropSize: 0x10x189(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bShouldUpdatePhysicsVolume : 1;                    // Mask: 0x4, PropSize: 0x10x189(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bHiddenInGame : 1;                                 // Mask: 0x8, PropSize: 0x10x189(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBoundsChangeTriggersStreamingDataRebuild : 1;     // Mask: 0x10, PropSize: 0x10x189(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseAttachParentBound : 1;                         // Mask: 0x20, PropSize: 0x10x189(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bComputeFastLocalBounds : 1;                       // Mask: 0x40, PropSize: 0x10x189(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bComputeBoundsOnceForGame : 1;                     // Mask: 0x80, PropSize: 0x10x189(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bComputedBoundsOnceForGame : 1;                    // Mask: 0x1, PropSize: 0x10x18A(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsNotRenderAttachmentRoot : 1;                    // Mask: 0x2, PropSize: 0x10x18A(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_32 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class EComponentMobility                Mobility;                                          // 0x18B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDetailMode                       DetailMode;                                        // 0x18C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            PhysicsVolumeChangedDelegate;                      // 0x18D(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3DB[0x112];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SceneComponent");
		return Clss;
	}

	void ToggleVisibility(bool InbPropagateToChildren);
	void SetWorldScale3D(const struct FVector& InNewScale);
	void SetVisibility(bool InbNewVisibility, bool InbPropagateToChildren);
	void SetShouldUpdatePhysicsVolume(bool InbInShouldUpdatePhysicsVolume);
	void SetRelativeScale3D(const struct FVector& InNewScale3D);
	void SetMobility(enum class EComponentMobility InNewMobility);
	void SetHiddenInGame(bool InNewHidden, bool InbPropagateToChildren);
	void SetAbsolute(bool InbNewAbsoluteLocation, bool InbNewAbsoluteRotation, bool InbNewAbsoluteScale);
	void ResetRelativeTransform();
	void OnRep_Visibility(bool InOldValue);
	void OnRep_Transform();
	void OnRep_AttachSocketName();
	void OnRep_AttachParent();
	void OnRep_AttachChildren();
	void K2_SetWorldTransform(struct FTransform& InNewTransform, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_SetWorldRotation(const struct FRotator& InNewRotation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_SetWorldLocationAndRotation(const struct FVector& InNewLocation, const struct FRotator& InNewRotation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_SetWorldLocation(const struct FVector& InNewLocation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_SetRelativeTransform(struct FTransform& InNewTransform, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_SetRelativeRotation(const struct FRotator& InNewRotation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_SetRelativeLocationAndRotation(const struct FVector& InNewLocation, const struct FRotator& InNewRotation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_SetRelativeLocation(const struct FVector& InNewLocation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	struct FTransform K2_GetComponentToWorld();
	struct FVector K2_GetComponentScale();
	struct FRotator K2_GetComponentRotation();
	struct FVector K2_GetComponentLocation();
	void K2_DetachFromComponent(enum class EDetachmentRule InLocationRule, enum class EDetachmentRule InRotationRule, enum class EDetachmentRule InScaleRule, bool InbCallModify);
	bool K2_AttachToComponent(class USceneComponent* InParent, class FName InSocketName, enum class EAttachmentRule InLocationRule, enum class EAttachmentRule InRotationRule, enum class EAttachmentRule InScaleRule, bool InbWeldSimulatedBodies);
	bool K2_AttachTo(class USceneComponent* InInParent, class FName InInSocketName, enum class EAttachLocation InAttachType, bool InbWeldSimulatedBodies);
	void K2_AddWorldTransformKeepScale(struct FTransform& InDeltaTransform, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddWorldTransform(struct FTransform& InDeltaTransform, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddWorldRotation(const struct FRotator& InDeltaRotation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddWorldOffset(const struct FVector& InDeltaLocation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddRelativeRotation(const struct FRotator& InDeltaRotation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddRelativeLocation(const struct FVector& InDeltaLocation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddLocalTransform(struct FTransform& InDeltaTransform, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddLocalRotation(const struct FRotator& InDeltaRotation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	void K2_AddLocalOffset(const struct FVector& InDeltaLocation, bool InbSweep, struct FHitResult* InSweepHitResult, bool InbTeleport);
	bool IsVisible();
	bool IsSimulatingPhysics(class FName InBoneName);
	bool IsAnySimulatingPhysics();
	struct FVector GetUpVector();
	struct FTransform GetSocketTransform(class FName InInSocketName, enum class ERelativeTransformSpace InTransformSpace);
	struct FRotator GetSocketRotation(class FName InInSocketName);
	struct FQuat GetSocketQuaternion(class FName InInSocketName);
	struct FVector GetSocketLocation(class FName InInSocketName);
	bool GetShouldUpdatePhysicsVolume();
	struct FVector GetRightVector();
	struct FTransform GetRelativeTransform();
	class APhysicsVolume* GetPhysicsVolume();
	void GetParentComponents(TArray<class USceneComponent*>* InParents);
	int32 GetNumChildrenComponents();
	struct FVector GetForwardVector();
	struct FVector GetComponentVelocity();
	void GetChildrenComponents(bool InbIncludeAllDescendants, TArray<class USceneComponent*>* InChildren);
	class USceneComponent* GetChildComponent(int32 InChildIndex);
	class FName GetAttachSocketName();
	class USceneComponent* GetAttachParent();
	TArray<class FName> GetAllSocketNames();
	bool DoesSocketExist(class FName InInSocketName);
	void DetachFromParent(bool InbMaintainWorldPosition, bool InbCallModify);
};

// 0x298 (0x538 - 0x2A0)
// Class Engine.PrimitiveComponent
class UPrimitiveComponent : public USceneComponent
{
public:
	uint8                                        Pad_53D[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinDrawDistance;                                   // 0x2B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LDMaxDrawDistance;                                 // 0x2B4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CachedMaxDrawDistance;                             // 0x2B8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESceneDepthPriorityGroup          DepthPriorityGroup;                                // 0x2BC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESceneDepthPriorityGroup          ViewOwnerDepthPriorityGroup;                       // 0x2BD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EIndirectLightingCacheQuality     IndirectLightingCacheQuality;                      // 0x2BE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ELightmapType                     LightmapType;                                      // 0x2BF(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsValidTextureStreamingBuiltData : 1;             // Mask: 0x1, PropSize: 0x10x2C0(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNeverDistanceCull : 1;                            // Mask: 0x2, PropSize: 0x10x2C0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_4D : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAlwaysCreatePhysicsState : 1;                     // Mask: 0x80, PropSize: 0x10x2C0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bGenerateOverlapEvents : 1;                        // Mask: 0x1, PropSize: 0x10x2C1(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bMultiBodyOverlap : 1;                             // Mask: 0x2, PropSize: 0x10x2C1(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTraceComplexOnMove : 1;                           // Mask: 0x4, PropSize: 0x10x2C1(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReturnMaterialOnMove : 1;                         // Mask: 0x8, PropSize: 0x10x2C1(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseViewOwnerDepthPriorityGroup : 1;               // Mask: 0x10, PropSize: 0x10x2C1(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowCullDistanceVolume : 1;                      // Mask: 0x20, PropSize: 0x10x2C1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bVisibleInReflectionCaptures : 1;                  // Mask: 0x40, PropSize: 0x10x2C1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bVisibleInRealTimeSkyCaptures : 1;                 // Mask: 0x80, PropSize: 0x10x2C1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bVisibleInRayTracing : 1;                          // Mask: 0x1, PropSize: 0x10x2C2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRenderInMainPass : 1;                             // Mask: 0x2, PropSize: 0x10x2C2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRenderInDepthPass : 1;                            // Mask: 0x4, PropSize: 0x10x2C2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReceivesDecals : 1;                               // Mask: 0x8, PropSize: 0x10x2C2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOwnerNoSee : 1;                                   // Mask: 0x10, PropSize: 0x10x2C2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOnlyOwnerSee : 1;                                 // Mask: 0x20, PropSize: 0x10x2C2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTreatAsBackgroundForOcclusion : 1;                // Mask: 0x40, PropSize: 0x10x2C2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseAsOccluder : 1;                                // Mask: 0x80, PropSize: 0x10x2C2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSelectable : 1;                                   // Mask: 0x1, PropSize: 0x10x2C3(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceMipStreaming : 1;                            // Mask: 0x2, PropSize: 0x10x2C3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasPerInstanceHitProxies : 1;                     // Mask: 0x4, PropSize: 0x10x2C3(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CastShadow : 1;                                    // Mask: 0x8, PropSize: 0x10x2C3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEmissiveLightSource : 1;                          // Mask: 0x10, PropSize: 0x10x2C3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAffectDynamicIndirectLighting : 1;                // Mask: 0x20, PropSize: 0x10x2C3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAffectIndirectLightingWhileHidden : 1;            // Mask: 0x40, PropSize: 0x10x2C3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAffectDistanceFieldLighting : 1;                  // Mask: 0x80, PropSize: 0x10x2C3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastDynamicShadow : 1;                            // Mask: 0x1, PropSize: 0x10x2C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastStaticShadow : 1;                             // Mask: 0x2, PropSize: 0x10x2C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastVolumetricTranslucentShadow : 1;              // Mask: 0x4, PropSize: 0x10x2C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastContactShadow : 1;                            // Mask: 0x8, PropSize: 0x10x2C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSelfShadowOnly : 1;                               // Mask: 0x10, PropSize: 0x10x2C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastFarShadow : 1;                                // Mask: 0x20, PropSize: 0x10x2C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastInsetShadow : 1;                              // Mask: 0x40, PropSize: 0x10x2C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastCinematicShadow : 1;                          // Mask: 0x80, PropSize: 0x10x2C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastHiddenShadow : 1;                             // Mask: 0x1, PropSize: 0x10x2C5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastShadowAsTwoSided : 1;                         // Mask: 0x2, PropSize: 0x10x2C5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLightAsIfStatic : 1;                              // Mask: 0x4, PropSize: 0x10x2C5(0x1)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLightAttachmentsAsGroup : 1;                      // Mask: 0x8, PropSize: 0x10x2C5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bExcludeFromLightAttachmentGroup : 1;              // Mask: 0x10, PropSize: 0x10x2C5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReceiveMobileCSMShadows : 1;                      // Mask: 0x20, PropSize: 0x10x2C5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSingleSampleShadowFromStationaryLights : 1;       // Mask: 0x40, PropSize: 0x10x2C5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreRadialImpulse : 1;                          // Mask: 0x80, PropSize: 0x10x2C5(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreRadialForce : 1;                            // Mask: 0x1, PropSize: 0x10x2C6(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bApplyImpulseOnDamage : 1;                         // Mask: 0x2, PropSize: 0x10x2C6(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReplicatePhysicsToAutonomousProxy : 1;            // Mask: 0x4, PropSize: 0x10x2C6(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bFillCollisionUnderneathForNavmesh : 1;            // Mask: 0x8, PropSize: 0x10x2C6(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        AlwaysLoadOnClient : 1;                            // Mask: 0x10, PropSize: 0x10x2C6(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        AlwaysLoadOnServer : 1;                            // Mask: 0x20, PropSize: 0x10x2C6(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseEditorCompositing : 1;                         // Mask: 0x40, PropSize: 0x10x2C6(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsBeingMovedByEditor : 1;                         // Mask: 0x80, PropSize: 0x10x2C6(0x1)(Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRenderCustomDepth : 1;                            // Mask: 0x1, PropSize: 0x10x2C7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bVisibleInSceneCaptureOnly : 1;                    // Mask: 0x2, PropSize: 0x10x2C7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHiddenInSceneCapture : 1;                         // Mask: 0x4, PropSize: 0x10x2C7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRayTracingFarField : 1;                           // Mask: 0x8, PropSize: 0x10x2C7(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_4E : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bHasNoStreamableTextures : 1;                      // Mask: 0x20, PropSize: 0x10x2C7(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_4F : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class EHasCustomNavigableGeometry       bHasCustomNavigableGeometry;                       // 0x2C8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_55D[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ECanBeCharacterBase               CanCharacterStepUpOn;                              // 0x2CA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLightingChannels                     LightingChannels;                                  // 0x2CB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                        RayTracingGroupId;                                 // 0x2CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VisibilityId;                                      // 0x2D0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CustomDepthStencilValue;                           // 0x2D4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCustomPrimitiveData                  CustomPrimitiveData;                               // 0x2D8(0x10)(Edit, NativeAccessSpecifierPrivate)
	struct FCustomPrimitiveData                  CustomPrimitiveDataInternal;                       // 0x2E8(0x10)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_55F[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TranslucencySortPriority;                          // 0x300(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TranslucencySortDistanceOffset;                    // 0x304(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class URuntimeVirtualTexture*>        RuntimeVirtualTextures;                            // 0x308(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	int8                                         VirtualTextureLodBias;                             // 0x318(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                         VirtualTextureCullMips;                            // 0x319(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                         VirtualTextureMinCoverage;                         // 0x31A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType;                      // 0x31B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_560[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BoundsScale;                                       // 0x32C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_561[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        MoveIgnoreActors;                                  // 0x340(0x10)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UPrimitiveComponent*>           MoveIgnoreComponents;                              // 0x350(0x10)(ExportObject, ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_562[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBodyInstance                         BodyInstance;                                      // 0x370(0x190)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentHit;                                    // 0x500(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentBeginOverlap;                           // 0x501(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentEndOverlap;                             // 0x502(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentWake;                                   // 0x503(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnComponentSleep;                                  // 0x504(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_564[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastSparseDelegateProperty_            OnComponentPhysicsStateChanged;                    // 0x506(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x507(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x508(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x509(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x50A(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x50B(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x50C(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x50D(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x50E(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	enum class ERayTracingGroupCullingPriority   RayTracingGroupCullingPriority;                    // 0x50F(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERendererStencilMask              CustomDepthStencilWriteMask;                       // 0x510(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_565[0x1F];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPrimitiveComponent*                   LODParentPrimitive;                                // 0x530(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("PrimitiveComponent");
		return Clss;
	}

	bool WasRecentlyRendered(float InTolerance);
	void WakeRigidBody(class FName InBoneName);
	void WakeAllRigidBodies();
	void SetWalkableSlopeOverride(struct FWalkableSlopeOverride& InNewOverride);
	void SetVisibleInSceneCaptureOnly(bool InbValue);
	void SetVisibleInRayTracing(bool InbNewVisibleInRayTracing);
	void SetVectorParameterForDefaultCustomPrimitiveData(class FName InParameterName, const struct FVector4& InValue);
	void SetVectorParameterForCustomPrimitiveData(class FName InParameterName, const struct FVector4& InValue);
	void SetUseCCD(bool InInUseCCD, class FName InBoneName);
	void SetTranslucentSortPriority(int32 InNewTranslucentSortPriority);
	void SetTranslucencySortDistanceOffset(float InNewTranslucencySortDistanceOffset);
	void SetSingleSampleShadowFromStationaryLights(bool InbNewSingleSampleShadowFromStationaryLights);
	void SetSimulatePhysics(bool InbSimulate);
	void SetScalarParameterForDefaultCustomPrimitiveData(class FName InParameterName, float InValue);
	void SetScalarParameterForCustomPrimitiveData(class FName InParameterName, float InValue);
	void SetRenderInMainPass(bool InbValue);
	void SetRenderInDepthPass(bool InbValue);
	void SetRenderCustomDepth(bool InbValue);
	void SetReceivesDecals(bool InbNewReceivesDecals);
	void SetPhysMaterialOverride(class UPhysicalMaterial* InNewPhysMaterial);
	void SetPhysicsMaxAngularVelocityInRadians(float InNewMaxAngVel, bool InbAddToCurrent, class FName InBoneName);
	void SetPhysicsMaxAngularVelocityInDegrees(float InNewMaxAngVel, bool InbAddToCurrent, class FName InBoneName);
	void SetPhysicsLinearVelocity(const struct FVector& InNewVel, bool InbAddToCurrent, class FName InBoneName);
	void SetPhysicsAngularVelocityInRadians(const struct FVector& InNewAngVel, bool InbAddToCurrent, class FName InBoneName);
	void SetPhysicsAngularVelocityInDegrees(const struct FVector& InNewAngVel, bool InbAddToCurrent, class FName InBoneName);
	void SetOwnerNoSee(bool InbNewOwnerNoSee);
	void SetOnlyOwnerSee(bool InbNewOnlyOwnerSee);
	void SetNotifyRigidBodyCollision(bool InbNewNotifyRigidBodyCollision);
	void SetMaterialByName(class FName InMaterialSlotName, class UMaterialInterface* InMaterial);
	void SetMaterial(int32 InElementIndex, class UMaterialInterface* InMaterial);
	void SetMassScale(class FName InBoneName, float InInMassScale);
	void SetMassOverrideInKg(class FName InBoneName, float InMassInKg, bool InbOverrideMass);
	void SetLinearDamping(float InInDamping);
	void SetLightingChannels(bool InbChannel0, bool InbChannel1, bool InbChannel2);
	void SetLightAttachmentsAsGroup(bool InbInLightAttachmentsAsGroup);
	void SetHiddenInSceneCapture(bool InbValue);
	void SetGenerateOverlapEvents(bool InbInGenerateOverlapEvents);
	void SetExcludeFromLightAttachmentGroup(bool InbInExcludeFromLightAttachmentGroup);
	void SetEnableGravity(bool InbGravityEnabled);
	void SetEmissiveLightSource(bool InNewEmissiveLightSource);
	void SetDefaultCustomPrimitiveDataVector4(int32 InDataIndex, const struct FVector4& InValue);
	void SetDefaultCustomPrimitiveDataVector3(int32 InDataIndex, const struct FVector& InValue);
	void SetDefaultCustomPrimitiveDataVector2(int32 InDataIndex, const struct FVector2D& InValue);
	void SetDefaultCustomPrimitiveDataFloat(int32 InDataIndex, float InValue);
	void SetCustomPrimitiveDataVector4(int32 InDataIndex, const struct FVector4& InValue);
	void SetCustomPrimitiveDataVector3(int32 InDataIndex, const struct FVector& InValue);
	void SetCustomPrimitiveDataVector2(int32 InDataIndex, const struct FVector2D& InValue);
	void SetCustomPrimitiveDataFloat(int32 InDataIndex, float InValue);
	void SetCustomDepthStencilWriteMask(enum class ERendererStencilMask InWriteMaskBit);
	void SetCustomDepthStencilValue(int32 InValue);
	void SetCullDistance(float InNewCullDistance);
	void SetConstraintMode(enum class EDOFMode InConstraintMode);
	void SetCollisionResponseToChannel(enum class ECollisionChannel InChannel, enum class ECollisionResponse InNewResponse);
	void SetCollisionResponseToAllChannels(enum class ECollisionResponse InNewResponse);
	void SetCollisionProfileName(class FName InInCollisionProfileName, bool InbUpdateOverlaps);
	void SetCollisionObjectType(enum class ECollisionChannel InChannel);
	void SetCollisionEnabled(enum class ECollisionEnabled InNewType);
	void SetCenterOfMass(const struct FVector& InCenterOfMassOffset, class FName InBoneName);
	void SetCastShadow(bool InNewCastShadow);
	void SetCastInsetShadow(bool InbInCastInsetShadow);
	void SetCastHiddenShadow(bool InNewCastHiddenShadow);
	void SetCastContactShadow(bool InbInCastContactShadow);
	void SetBoundsScale(float InNewBoundsScale);
	void SetAngularDamping(float InInDamping);
	void SetAllUseCCD(bool InInUseCCD);
	void SetAllPhysicsLinearVelocity(const struct FVector& InNewVel, bool InbAddToCurrent);
	void SetAllPhysicsAngularVelocityInRadians(struct FVector& InNewAngVel, bool InbAddToCurrent);
	void SetAllPhysicsAngularVelocityInDegrees(struct FVector& InNewAngVel, bool InbAddToCurrent);
	void SetAllMassScale(float InInMassScale);
	struct FVector ScaleByMomentOfInertia(const struct FVector& InInputVector, class FName InBoneName);
	void PutRigidBodyToSleep(class FName InBoneName);
	bool K2_SphereTraceComponent(const struct FVector& InTraceStart, const struct FVector& InTraceEnd, float InSphereRadius, bool InbTraceComplex, bool InbShowTrace, bool InbPersistentShowTrace, struct FVector* InHitLocation, struct FVector* InHitNormal, class FName* InBoneName, struct FHitResult* InOutHit);
	bool K2_SphereOverlapComponent(const struct FVector& InInSphereCentre, float InInSphereRadius, bool InbTraceComplex, bool InbShowTrace, bool InbPersistentShowTrace, struct FVector* InHitLocation, struct FVector* InHitNormal, class FName* InBoneName, struct FHitResult* InOutHit);
	bool K2_LineTraceComponent(const struct FVector& InTraceStart, const struct FVector& InTraceEnd, bool InbTraceComplex, bool InbShowTrace, bool InbPersistentShowTrace, struct FVector* InHitLocation, struct FVector* InHitNormal, class FName* InBoneName, struct FHitResult* InOutHit);
	bool K2_IsQueryCollisionEnabled();
	bool K2_IsPhysicsCollisionEnabled();
	bool K2_IsCollisionEnabled();
	bool K2_BoxOverlapComponent(const struct FVector& InInBoxCentre, const struct FBox& InInbox, bool InbTraceComplex, bool InbShowTrace, bool InbPersistentShowTrace, struct FVector* InHitLocation, struct FVector* InHitNormal, class FName* InBoneName, struct FHitResult* InOutHit);
	bool IsOverlappingComponent(class UPrimitiveComponent* InOtherComp);
	bool IsOverlappingActor(class AActor* InOther);
	bool IsGravityEnabled();
	bool IsAnyRigidBodyAwake();
	void InvalidateLumenSurfaceCache();
	void IgnoreComponentWhenMoving(class UPrimitiveComponent* InComponent, bool InbShouldIgnore);
	void IgnoreActorWhenMoving(class AActor* InActor, bool InbShouldIgnore);
	struct FWalkableSlopeOverride GetWalkableSlopeOverride();
	struct FVector GetPhysicsLinearVelocityAtPoint(const struct FVector& InPoint, class FName InBoneName);
	struct FVector GetPhysicsLinearVelocity(class FName InBoneName);
	struct FVector GetPhysicsAngularVelocityInRadians(class FName InBoneName);
	struct FVector GetPhysicsAngularVelocityInDegrees(class FName InBoneName);
	void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* InOutOverlappingComponents);
	void GetOverlappingActors(TArray<class AActor*>* InOverlappingActors, TSubclassOf<class AActor> InClassFilter);
	int32 GetNumMaterials();
	class UMaterialInterface* GetMaterialFromCollisionFaceIndex(int32 InFaceIndex, int32* InSectionIndex);
	class UMaterialInterface* GetMaterial(int32 InElementIndex);
	float GetMassScale(class FName InBoneName);
	float GetMass();
	float GetLinearDamping();
	struct FVector GetInertiaTensor(class FName InBoneName);
	bool GetGenerateOverlapEvents();
	int32 GetCustomPrimitiveDataIndexForVectorParameter(class FName InParameterName);
	int32 GetCustomPrimitiveDataIndexForScalarParameter(class FName InParameterName);
	enum class ECollisionResponse GetCollisionResponseToChannel(enum class ECollisionChannel InChannel);
	class FName GetCollisionProfileName();
	enum class ECollisionChannel GetCollisionObjectType();
	enum class ECollisionEnabled GetCollisionEnabled();
	float GetClosestPointOnCollision(struct FVector& InPoint, struct FVector* InOutPointOnBody, class FName InBoneName);
	struct FVector GetCenterOfMass(class FName InBoneName);
	struct FBodyInstanceAsyncPhysicsTickHandle GetBodyInstanceAsyncPhysicsTickHandle(class FName InBoneName, bool InbGetWelded, int32 InIndex);
	float GetAngularDamping();
	class UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32 InElementIndex, class UMaterialInterface* InSourceMaterial, class FName InOptionalName);
	class UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32 InElementIndex, class UMaterialInterface* InParent);
	class UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32 InElementIndex);
	TArray<class UPrimitiveComponent*> CopyArrayOfMoveIgnoreComponents();
	TArray<class AActor*> CopyArrayOfMoveIgnoreActors();
	void ClearMoveIgnoreComponents();
	void ClearMoveIgnoreActors();
	bool CanCharacterStepUp(class APawn* InPawn);
	void AddVelocityChangeImpulseAtLocation(const struct FVector& InImpulse, const struct FVector& InLocation, class FName InBoneName);
	void AddTorqueInRadians(const struct FVector& InTorque, class FName InBoneName, bool InbAccelChange);
	void AddTorqueInDegrees(const struct FVector& InTorque, class FName InBoneName, bool InbAccelChange);
	void AddRadialImpulse(const struct FVector& InOrigin, float InRadius, float InStrength, enum class ERadialImpulseFalloff InFalloff, bool InbVelChange);
	void AddRadialForce(const struct FVector& InOrigin, float InRadius, float InStrength, enum class ERadialImpulseFalloff InFalloff, bool InbAccelChange);
	void AddImpulseAtLocation(const struct FVector& InImpulse, const struct FVector& InLocation, class FName InBoneName);
	void AddImpulse(const struct FVector& InImpulse, class FName InBoneName, bool InbVelChange);
	void AddForceAtLocationLocal(const struct FVector& InForce, const struct FVector& InLocation, class FName InBoneName);
	void AddForceAtLocation(const struct FVector& InForce, const struct FVector& InLocation, class FName InBoneName);
	void AddForce(const struct FVector& InForce, class FName InBoneName, bool InbAccelChange);
	void AddAngularImpulseInRadians(const struct FVector& InImpulse, class FName InBoneName, bool InbVelChange);
	void AddAngularImpulseInDegrees(const struct FVector& InImpulse, class FName InBoneName, bool InbVelChange);
};

// 0x0 (0x538 - 0x538)
// Class Engine.FXSystemComponent
class UFXSystemComponent : public UPrimitiveComponent
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FXSystemComponent");
		return Clss;
	}

	void SetVectorParameter(class FName InParameterName, const struct FVector& InParam);
	void SetUseAutoManageAttachment(bool InbAutoManage);
	void SetIntParameter(class FName InParameterName, int32 InParam);
	void SetFloatParameter(class FName InParameterName, float InParam);
	void SetEmitterEnable(class FName InEmitterName, bool InbNewEnableState);
	void SetColorParameter(class FName InParameterName, const struct FLinearColor& InParam);
	void SetBoolParameter(class FName InParameterName, bool InParam);
	void SetAutoAttachmentParameters(class USceneComponent* InParent, class FName InSocketName, enum class EAttachmentRule InLocationRule, enum class EAttachmentRule InRotationRule, enum class EAttachmentRule InScaleRule);
	void SetActorParameter(class FName InParameterName, class AActor* InParam);
	void ReleaseToPool();
	class UFXSystemAsset* GetFXSystemAsset();
};

// 0x8 (0x30 - 0x28)
// Class Engine.FXSystemAsset
class UFXSystemAsset : public UObject
{
public:
	uint32                                       MaxPoolSize;                                       // 0x28(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       PoolPrimeSize;                                     // 0x2C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FXSystemAsset");
		return Clss;
	}

};

// 0x38 (0x2C8 - 0x290)
// Class Engine.Brush
class ABrush : public AActor
{
public:
	enum class EBrushType                        BrushType;                                         // 0x290(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_57E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                BrushColor;                                        // 0x294(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PolyFlags;                                         // 0x298(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bColored : 1;                                      // Mask: 0x1, PropSize: 0x10x29C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSolidWhenSelected : 1;                            // Mask: 0x2, PropSize: 0x10x29C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPlaceableFromClassBrowser : 1;                    // Mask: 0x4, PropSize: 0x10x29C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNotForClientOrServer : 1;                         // Mask: 0x8, PropSize: 0x10x29C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_50 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_580[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UModel*                                Brush;                                             // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBrushComponent*                       BrushComponent;                                    // 0x2A8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bInManipulation : 1;                               // Mask: 0x1, PropSize: 0x10x2B0(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_51 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_581[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGeomSelection>                SavedSelections;                                   // 0x2B8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Brush");
		return Clss;
	}

};

// 0x0 (0x2C8 - 0x2C8)
// Class Engine.Volume
class AVolume : public ABrush
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Volume");
		return Clss;
	}

};

// 0x870 (0x898 - 0x28)
// Class Engine.World
class UWorld : public UObject
{
public:
	uint8                                        Pad_585[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ULevel*                                PersistentLevel;                                   // 0x30(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNetDriver*                            NetDriver;                                         // 0x38(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULineBatchComponent*                   LineBatcher;                                       // 0x40(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULineBatchComponent*                   PersistentLineBatcher;                             // 0x48(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULineBatchComponent*                   ForegroundLineBatcher;                             // 0x50(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGameNetworkManager*                   NetworkManager;                                    // 0x58(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsCollisionHandler*              PhysicsCollisionHandler;                           // 0x60(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                       ExtraReferencedObjects;                            // 0x68(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UObject*>                       PerModuleDataObjects;                              // 0x78(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class ULevelStreaming*>               StreamingLevels;                                   // 0x88(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FStreamingLevelsToConsider            StreamingLevelsToConsider;                         // 0x98(0x28)(Transient, DuplicateTransient, NativeAccessSpecifierPrivate)
	class AServerStreamingLevelsVisibility*      ServerStreamingLevelsVisibility;                   // 0xC0(0x8)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                StreamingLevelsPrefix;                             // 0xC8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_588[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ULevel*                                CurrentLevelPendingVisibility;                     // 0xE0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULevel*                                CurrentLevelPendingInvisibility;                   // 0xE8(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDemoNetDriver*                        DemoNetDriver;                                     // 0xF0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AParticleEventManager*                 MyParticleEventManager;                            // 0xF8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APhysicsVolume*                        DefaultPhysicsVolume;                              // 0x100(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_58A[0x36];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        BitPad_52 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAreConstraintsDirty : 1;                          // Mask: 0x4, PropSize: 0x10x13E(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_53 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_58D[0x9];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UNavigationSystemBase*                 NavigationSystem;                                  // 0x148(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGameModeBase*                         AuthorityGameMode;                                 // 0x150(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGameStateBase*                        GameState;                                         // 0x158(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAISystemBase*                         AISystem;                                          // 0x160(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAvoidanceManager*                     AvoidanceManager;                                  // 0x168(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ULevel*>                        Levels;                                            // 0x170(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FLevelCollection>              LevelCollections;                                  // 0x180(0x10)(ZeroConstructor, Transient, NonTransactional, NativeAccessSpecifierPrivate)
	uint8                                        Pad_591[0x28];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGameInstance*                         OwningGameInstance;                                // 0x1B8(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMaterialParameterCollectionInstance*> ParameterCollectionInstances;                      // 0x1C0(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UCanvas*                               CanvasForRenderingToTarget;                        // 0x1D0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCanvas*                               CanvasForDrawMaterialToRenderTarget;               // 0x1D8(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_594[0x70];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPhysicsFieldComponent*                PhysicsField;                                      // 0x250(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       LWILastAssignedUID;                                // 0x258(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_595[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSet<class UActorComponent*>                 ComponentsThatNeedPreEndOfFrameSync;               // 0x260(0x50)(ExportObject, Transient, NonTransactional, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UActorComponent*>               ComponentsThatNeedEndOfFrameUpdate;                // 0x2B0(0x10)(ExportObject, ZeroConstructor, Transient, NonTransactional, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UActorComponent*>               ComponentsThatNeedEndOfFrameUpdate_OnGameThread;   // 0x2C0(0x10)(ExportObject, ZeroConstructor, Transient, NonTransactional, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_599[0x3F8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UWorldComposition*                     WorldComposition;                                  // 0x6C8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UContentBundleManager*                 ContentBundleManager;                              // 0x6D0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_59B[0xA8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWorldPSCPool                         PSCPool;                                           // 0x780(0x58)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_59C[0xC0];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("World");
		return Clss;
	}

	class AWorldSettings* K2_GetWorldSettings();
	void HandleTimelineScrubbed();
};

// 0x8 (0x30 - 0x28)
// Class Engine.Subsystem
class USubsystem : public UObject
{
public:
	uint8                                        Pad_59F[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Subsystem");
		return Clss;
	}

};

// 0x0 (0x30 - 0x30)
// Class Engine.DynamicSubsystem
class UDynamicSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("DynamicSubsystem");
		return Clss;
	}

};

// 0x0 (0x30 - 0x30)
// Class Engine.EngineSubsystem
class UEngineSubsystem : public UDynamicSubsystem
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("EngineSubsystem");
		return Clss;
	}

};

// 0x198 (0x1C0 - 0x28)
// Class Engine.GameInstance
class UGameInstance : public UObject
{
public:
	uint8                                        Pad_5AB[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ULocalPlayer*>                  LocalPlayers;                                      // 0x38(0x10)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UOnlineSession*                        OnlineSession;                                     // 0x48(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UObject*>                       ReferencedObjects;                                 // 0x50(0x10)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_5AD[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnPawnControllerChangedDelegates;                  // 0x78(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_5AE[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnInputDeviceConnectionChange;                     // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnUserInputDevicePairingChange;                    // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_5AF[0x100];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GameInstance");
		return Clss;
	}

	void ReceiveShutdown();
	void ReceiveInit();
	void HandleTravelError(enum class ETravelFailure InFailureType);
	void HandleNetworkError(enum class ENetworkFailure InFailureType, bool InbIsServer);
	void DebugRemovePlayer(int32 InControllerId);
	void DebugCreatePlayer(int32 InControllerId);
};

// 0x0 (0x30 - 0x30)
// Class Engine.GameInstanceSubsystem
class UGameInstanceSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GameInstanceSubsystem");
		return Clss;
	}

};

// 0x0 (0x30 - 0x30)
// Class Engine.OnlineBlueprintCallProxyBase
class UOnlineBlueprintCallProxyBase : public UBlueprintAsyncActionBase
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("OnlineBlueprintCallProxyBase");
		return Clss;
	}

};

// 0x20 (0x48 - 0x28)
// Class Engine.Player
class UPlayer : public UObject
{
public:
	uint8                                        Pad_5B0[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class APlayerController*                     PlayerController;                                  // 0x30(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentNetSpeed;                                   // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConfiguredInternetSpeed;                           // 0x3C(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConfiguredLanSpeed;                                // 0x40(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5B1[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Player");
		return Clss;
	}

};

// 0x32C0 (0x3308 - 0x48)
// Class Engine.NetConnection
class UNetConnection : public UPlayer
{
public:
	TArray<class UChildConnection*>              Children;                                          // 0x48(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	class UNetDriver*                            Driver;                                            // 0x58(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UPackageMap>               PackageMapClass;                                   // 0x60(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPackageMap*                           PackageMap;                                        // 0x68(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UChannel*>                      OpenChannels;                                      // 0x70(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        SentTemporaries;                                   // 0x80(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AActor*                                ViewTarget;                                        // 0x90(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OwningActor;                                       // 0x98(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxPacket;                                         // 0xA0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        InternalAck : 1;                                   // Mask: 0x1, PropSize: 0x10xA4(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_54 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_5B2[0xBB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FUniqueNetIdRepl                      PlayerId;                                          // 0x160(0x30)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5B3[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       LastReceiveTime;                                   // 0x1D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5B4[0x11E0];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DefaultMaxChannelSize;                             // 0x13C0(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5B5[0x284];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UChannel*>                      ChannelsToTick;                                    // 0x1648(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_5B6[0x1CB0];                                   // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("NetConnection");
		return Clss;
	}

};

// 0x768 (0x790 - 0x28)
// Class Engine.NetDriver
class UNetDriver : public UObject
{
public:
	uint8                                        Pad_5B9[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                NetConnectionClassName;                            // 0x30(0x10)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ReplicationDriverClassName;                        // 0x40(0x10)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ReplicationBridgeClassName;                        // 0x50(0x10)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxDownloadSize;                                   // 0x60(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClampListenServerTickRate : 1;                    // Mask: 0x1, PropSize: 0x10x64(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_55 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_5BA[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NetServerMaxTickRate;                              // 0x68(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxNetTickRate;                                    // 0x6C(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxInternetClientRate;                             // 0x70(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxClientRate;                                     // 0x74(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ServerTravelPause;                                 // 0x78(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SpawnPrioritySeconds;                              // 0x7C(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RelevantTimeout;                                   // 0x80(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        KeepAliveTime;                                     // 0x84(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InitialConnectTimeout;                             // 0x88(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ConnectionTimeout;                                 // 0x8C(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeoutMultiplierForUnoptimizedBuilds;             // 0x90(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5BB[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UNetConnection*                        ServerConnection;                                  // 0x98(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNetConnection*>                ClientConnections;                                 // 0xA0(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_5BC[0x60];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RecentlyDisconnectedTrackingTime;                  // 0x110(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5BD[0x3C];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWorld*                                World;                                             // 0x150(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPackage*                              WorldPackage;                                      // 0x158(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5BE[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UObject>                   NetConnectionClass;                                // 0x180(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                   ReplicationDriverClass;                            // 0x188(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                   ReplicationBridgeClass;                            // 0x190(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5BF[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  NetDriverName;                                     // 0x1A8(0x8)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChannelDefinition>            ChannelDefinitions;                                // 0x1B0(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TMap<class FName, struct FChannelDefinition> ChannelDefinitionMap;                              // 0x1C0(0x50)(NativeAccessSpecifierPublic)
	TArray<class UChannel*>                      ActorChannelPool;                                  // 0x210(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_5C0[0x21];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        BitPad_56 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bNoTimeouts : 1;                                   // Mask: 0x40, PropSize: 0x10x241(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNeverApplyNetworkEmulationSettings : 1;           // Mask: 0x80, PropSize: 0x10x241(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5C1[0x4DE];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UReplicationDriver*                    ReplicationDriver;                                 // 0x720(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_5C2[0x68];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("NetDriver");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.OnlineEngineInterface
class UOnlineEngineInterface : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("OnlineEngineInterface");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.OnlineSession
class UOnlineSession : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("OnlineSession");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.ReplicationDriver
class UReplicationDriver : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ReplicationDriver");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.ReplicationConnectionDriver
class UReplicationConnectionDriver : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ReplicationConnectionDriver");
		return Clss;
	}

};

// 0x20 (0x558 - 0x538)
// Class Engine.ShapeComponent
class UShapeComponent : public UPrimitiveComponent
{
public:
	class UBodySetup*                            ShapeBodySetup;                                    // 0x538(0x8)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                ShapeColor;                                        // 0x540(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDrawOnlyIfSelected : 1;                           // Mask: 0x1, PropSize: 0x10x544(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShouldCollideWhenPlacing : 1;                     // Mask: 0x2, PropSize: 0x10x544(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDynamicObstacle : 1;                              // Mask: 0x4, PropSize: 0x10x544(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_57 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_5C3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UNavAreaBase>              AreaClassOverride;                                 // 0x548(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseSystemDefaultObstacleAreaClass : 1;            // Mask: 0x1, PropSize: 0x10x550(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_5C4[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ShapeComponent");
		return Clss;
	}

};

// 0x28 (0x580 - 0x558)
// Class Engine.BoxComponent
class UBoxComponent : public UShapeComponent
{
public:
	struct FVector                               BoxExtent;                                         // 0x558(0x18)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LineThickness;                                     // 0x570(0x4)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_5C7[0xC];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BoxComponent");
		return Clss;
	}

	void SetLineThickness(float InThickness);
	void SetBoxExtent(const struct FVector& InInBoxExtent, bool InbUpdateOverlaps);
	struct FVector GetUnscaledBoxExtent();
	struct FVector GetScaledBoxExtent();
};

// 0x10 (0x2D8 - 0x2C8)
// Class Engine.PhysicsVolume
class APhysicsVolume : public AVolume
{
public:
	float                                        TerminalVelocity;                                  // 0x2C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Priority;                                          // 0x2CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FluidFriction;                                     // 0x2D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bWaterVolume : 1;                                  // Mask: 0x1, PropSize: 0x10x2D4(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPhysicsOnContact : 1;                             // Mask: 0x2, PropSize: 0x10x2D4(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5C9[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("PhysicsVolume");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.HLODBuilder
class UHLODBuilder : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("HLODBuilder");
		return Clss;
	}

};

// 0x38 (0x570 - 0x538)
// Class Engine.MeshComponent
class UMeshComponent : public UPrimitiveComponent
{
public:
	TArray<class UMaterialInterface*>            OverrideMaterials;                                 // 0x538(0x10)(Edit, ZeroConstructor, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	class UMaterialInterface*                    OverlayMaterial;                                   // 0x548(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OverlayMaterialMaxDrawDistance;                    // 0x550(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5CF[0x14];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bEnableMaterialParameterCaching : 1;               // Mask: 0x1, PropSize: 0x10x568(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_5D0[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("MeshComponent");
		return Clss;
	}

	void SetVectorParameterValueOnMaterials(class FName InParameterName, const struct FVector& InParameterValue);
	void SetScalarParameterValueOnMaterials(class FName InParameterName, float InParameterValue);
	void SetOverlayMaterialMaxDrawDistance(float InInMaxDrawDistance);
	void SetOverlayMaterial(class UMaterialInterface* InNewOverlayMaterial);
	void PrestreamTextures(float InSeconds, bool InbPrioritizeCharacterTextures, int32 InCinematicTextureGroups);
	bool IsMaterialSlotNameValid(class FName InMaterialSlotName);
	class UMaterialInterface* GetOverlayMaterial();
	TArray<class FName> GetMaterialSlotNames();
	TArray<class UMaterialInterface*> GetMaterials();
	int32 GetMaterialIndex(class FName InMaterialSlotName);
};

// 0x100 (0x638 - 0x538)
// Class Engine.SplineComponent
class USplineComponent : public UPrimitiveComponent
{
public:
	struct FSplineCurves                         SplineCurves;                                      // 0x538(0x70)(Edit, NativeAccessSpecifierPublic)
	struct FInterpCurveVector                    SplineInfo;                                        // 0x5A8(0x18)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveQuat                      SplineRotInfo;                                     // 0x5C0(0x18)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveVector                    SplineScaleInfo;                                   // 0x5D8(0x18)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                     SplineReparamTable;                                // 0x5F0(0x18)(ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowSplineEditingPerInstance;                    // 0x608(0x1)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_98F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReparamStepsPerSegment;                            // 0x60C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Duration;                                          // 0x610(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStationaryEndpoints;                              // 0x614(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSplineHasBeenEdited;                              // 0x615(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bModifiedByConstructionScript;                     // 0x616(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInputSplinePointsToConstructionScript;            // 0x617(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDrawDebug;                                        // 0x618(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bClosedLoop;                                       // 0x619(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bLoopPositionOverride;                             // 0x61A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_99C[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LoopPosition;                                      // 0x61C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               DefaultUpVector;                                   // 0x620(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SplineComponent");
		return Clss;
	}

	void UpdateSpline();
	void SetWorldLocationAtSplinePoint(int32 InPointIndex, struct FVector& InInLocation);
	void SetUpVectorAtSplinePoint(int32 InPointIndex, struct FVector& InInUpVector, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUpdateSpline);
	void SetUnselectedSplineSegmentColor(struct FLinearColor& InSegmentColor);
	void SetTangentsAtSplinePoint(int32 InPointIndex, struct FVector& InInArriveTangent, struct FVector& InInLeaveTangent, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUpdateSpline);
	void SetTangentColor(struct FLinearColor& InTangentColor);
	void SetTangentAtSplinePoint(int32 InPointIndex, struct FVector& InInTangent, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUpdateSpline);
	void SetSplineWorldPoints(TArray<struct FVector>& InPoints);
	void SetSplinePointType(int32 InPointIndex, enum class ESplinePointType InType, bool InbUpdateSpline);
	void SetSplinePoints(TArray<struct FVector>& InPoints, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUpdateSpline);
	void SetSplineLocalPoints(TArray<struct FVector>& InPoints);
	void SetSelectedSplineSegmentColor(struct FLinearColor& InSegmentColor);
	void SetScaleAtSplinePoint(int32 InPointIndex, struct FVector& InInScaleVector, bool InbUpdateSpline);
	void SetRotationAtSplinePoint(int32 InPointIndex, struct FRotator& InInRotation, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUpdateSpline);
	void SetLocationAtSplinePoint(int32 InPointIndex, struct FVector& InInLocation, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUpdateSpline);
	void SetDrawDebug(bool InbShow);
	void SetDefaultUpVector(struct FVector& InUpVector, enum class ESplineCoordinateSpace InCoordinateSpace);
	void SetClosedLoopAtPosition(bool InbInClosedLoop, float InKey, bool InbUpdateSpline);
	void SetClosedLoop(bool InbInClosedLoop, bool InbUpdateSpline);
	void RemoveSplinePoint(int32 InIndex, bool InbUpdateSpline);
	bool IsClosedLoop();
	struct FVector GetWorldTangentAtDistanceAlongSpline(float InDistance);
	struct FRotator GetWorldRotationAtTime(float InTime, bool InbUseConstantVelocity);
	struct FRotator GetWorldRotationAtDistanceAlongSpline(float InDistance);
	struct FVector GetWorldLocationAtTime(float InTime, bool InbUseConstantVelocity);
	struct FVector GetWorldLocationAtSplinePoint(int32 InPointIndex);
	struct FVector GetWorldLocationAtDistanceAlongSpline(float InDistance);
	struct FVector GetWorldDirectionAtTime(float InTime, bool InbUseConstantVelocity);
	struct FVector GetWorldDirectionAtDistanceAlongSpline(float InDistance);
	struct FVector GetVectorPropertyAtSplinePoint(int32 InIndex, class FName InPropertyName);
	struct FVector GetVectorPropertyAtSplineInputKey(float InInKey, class FName InPropertyName);
	struct FVector GetUpVectorAtTime(float InTime, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseConstantVelocity);
	struct FVector GetUpVectorAtSplinePoint(int32 InPointIndex, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetUpVectorAtSplineInputKey(float InInKey, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetUpVectorAtDistanceAlongSpline(float InDistance, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FTransform GetTransformAtTime(float InTime, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseConstantVelocity, bool InbUseScale);
	struct FTransform GetTransformAtSplinePoint(int32 InPointIndex, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseScale);
	struct FTransform GetTransformAtSplineInputKey(float InInKey, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseScale);
	struct FTransform GetTransformAtDistanceAlongSpline(float InDistance, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseScale);
	float GetTimeAtDistanceAlongSpline(float InDistance);
	struct FVector GetTangentAtTime(float InTime, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseConstantVelocity);
	struct FVector GetTangentAtSplinePoint(int32 InPointIndex, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetTangentAtSplineInputKey(float InInKey, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetTangentAtDistanceAlongSpline(float InDistance, enum class ESplineCoordinateSpace InCoordinateSpace);
	enum class ESplinePointType GetSplinePointType(int32 InPointIndex);
	float GetSplineLength();
	struct FVector GetScaleAtTime(float InTime, bool InbUseConstantVelocity);
	struct FVector GetScaleAtSplinePoint(int32 InPointIndex);
	struct FVector GetScaleAtSplineInputKey(float InInKey);
	struct FVector GetScaleAtDistanceAlongSpline(float InDistance);
	struct FRotator GetRotationAtTime(float InTime, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseConstantVelocity);
	struct FRotator GetRotationAtSplinePoint(int32 InPointIndex, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FRotator GetRotationAtSplineInputKey(float InInKey, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FRotator GetRotationAtDistanceAlongSpline(float InDistance, enum class ESplineCoordinateSpace InCoordinateSpace);
	float GetRollAtTime(float InTime, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseConstantVelocity);
	float GetRollAtSplinePoint(int32 InPointIndex, enum class ESplineCoordinateSpace InCoordinateSpace);
	float GetRollAtSplineInputKey(float InInKey, enum class ESplineCoordinateSpace InCoordinateSpace);
	float GetRollAtDistanceAlongSpline(float InDistance, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetRightVectorAtTime(float InTime, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseConstantVelocity);
	struct FVector GetRightVectorAtSplinePoint(int32 InPointIndex, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetRightVectorAtSplineInputKey(float InInKey, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetRightVectorAtDistanceAlongSpline(float InDistance, enum class ESplineCoordinateSpace InCoordinateSpace);
	int32 GetNumberOfSplineSegments();
	int32 GetNumberOfSplinePoints();
	struct FVector GetLocationAtTime(float InTime, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseConstantVelocity);
	struct FVector GetLocationAtSplinePoint(int32 InPointIndex, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetLocationAtSplineInputKey(float InInKey, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetLocationAtDistanceAlongSpline(float InDistance, enum class ESplineCoordinateSpace InCoordinateSpace);
	void GetLocationAndTangentAtSplinePoint(int32 InPointIndex, struct FVector* InLocation, struct FVector* InTangent, enum class ESplineCoordinateSpace InCoordinateSpace);
	void GetLocalLocationAndTangentAtSplinePoint(int32 InPointIndex, struct FVector* InLocalLocation, struct FVector* InLocalTangent);
	struct FVector GetLeaveTangentAtSplinePoint(int32 InPointIndex, enum class ESplineCoordinateSpace InCoordinateSpace);
	float GetInputKeyValueAtDistanceAlongSpline(float InDistance);
	float GetInputKeyAtDistanceAlongSpline(float InDistance);
	float GetFloatPropertyAtSplinePoint(int32 InIndex, class FName InPropertyName);
	float GetFloatPropertyAtSplineInputKey(float InInKey, class FName InPropertyName);
	float GetDistanceAlongSplineAtSplinePoint(int32 InPointIndex);
	float GetDistanceAlongSplineAtSplineInputKey(float InInKey);
	struct FVector GetDirectionAtTime(float InTime, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseConstantVelocity);
	struct FVector GetDirectionAtSplinePoint(int32 InPointIndex, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetDirectionAtSplineInputKey(float InInKey, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetDirectionAtDistanceAlongSpline(float InDistance, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetDefaultUpVector(enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector GetArriveTangentAtSplinePoint(int32 InPointIndex, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector FindUpVectorClosestToWorldLocation(struct FVector& InWorldLocation, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FTransform FindTransformClosestToWorldLocation(struct FVector& InWorldLocation, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUseScale);
	struct FVector FindTangentClosestToWorldLocation(struct FVector& InWorldLocation, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector FindScaleClosestToWorldLocation(struct FVector& InWorldLocation);
	struct FRotator FindRotationClosestToWorldLocation(struct FVector& InWorldLocation, enum class ESplineCoordinateSpace InCoordinateSpace);
	float FindRollClosestToWorldLocation(struct FVector& InWorldLocation, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector FindRightVectorClosestToWorldLocation(struct FVector& InWorldLocation, enum class ESplineCoordinateSpace InCoordinateSpace);
	struct FVector FindLocationClosestToWorldLocation(struct FVector& InWorldLocation, enum class ESplineCoordinateSpace InCoordinateSpace);
	float FindInputKeyClosestToWorldLocation(struct FVector& InWorldLocation);
	struct FVector FindDirectionClosestToWorldLocation(struct FVector& InWorldLocation, enum class ESplineCoordinateSpace InCoordinateSpace);
	bool DivideSplineIntoPolylineRecursiveWithDistances(float InStartDistanceAlongSpline, float InEndDistanceAlongSpline, enum class ESplineCoordinateSpace InCoordinateSpace, float InMaxSquareDistanceFromSpline, TArray<struct FVector>* InOutPoints, TArray<double>* InOutDistancesAlongSpline);
	bool DivideSplineIntoPolylineRecursive(float InStartDistanceAlongSpline, float InEndDistanceAlongSpline, enum class ESplineCoordinateSpace InCoordinateSpace, float InMaxSquareDistanceFromSpline, TArray<struct FVector>* InOutPoints);
	bool ConvertSplineToPolyLine(enum class ESplineCoordinateSpace InCoordinateSpace, float InMaxSquareDistanceFromSpline, TArray<struct FVector>* InOutPoints);
	bool ConvertSplineSegmentToPolyLine(int32 InSplinePointStartIndex, enum class ESplineCoordinateSpace InCoordinateSpace, float InMaxSquareDistanceFromSpline, TArray<struct FVector>* InOutPoints);
	void ClearSplinePoints(bool InbUpdateSpline);
	void AddSplineWorldPoint(struct FVector& InPosition);
	void AddSplinePointAtIndex(struct FVector& InPosition, int32 InIndex, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUpdateSpline);
	void AddSplinePoint(struct FVector& InPosition, enum class ESplineCoordinateSpace InCoordinateSpace, bool InbUpdateSpline);
	void AddSplineLocalPoint(struct FVector& InPosition);
	void AddPoints(TArray<struct FSplinePoint>& InPoints, bool InbUpdateSpline);
	void AddPoint(struct FSplinePoint& InPoint, bool InbUpdateSpline);
};

// 0x0 (0x28 - 0x28)
// Class Engine.SplineMetadata
class USplineMetadata : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SplineMetadata");
		return Clss;
	}

};

// 0x0 (0x30 - 0x30)
// Class Engine.WorldSubsystem
class UWorldSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("WorldSubsystem");
		return Clss;
	}

};

// 0x10 (0x40 - 0x30)
// Class Engine.TickableWorldSubsystem
class UTickableWorldSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_9DB[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("TickableWorldSubsystem");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.DynamicBlueprintBinding
class UDynamicBlueprintBinding : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("DynamicBlueprintBinding");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.InputDelegateBinding
class UInputDelegateBinding : public UDynamicBlueprintBinding
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("InputDelegateBinding");
		return Clss;
	}

};

// 0x88 (0x128 - 0xA0)
// Class Engine.InputComponent
class UInputComponent : public UActorComponent
{
public:
	uint8                                        Pad_A1B[0x70];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedKeyToActionInfo>        CachedKeyToActionInfo;                             // 0x110(0x10)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A1C[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("InputComponent");
		return Clss;
	}

	bool WasControllerKeyJustReleased(const struct FKey& InKey);
	bool WasControllerKeyJustPressed(const struct FKey& InKey);
	void OnInputOwnerEndPlayed(class AActor* InInOwner, enum class EEndPlayReason InEndPlayReason);
	bool IsControllerKeyDown(const struct FKey& InKey);
	void GetTouchState(int32 InFingerIndex, float* InLocationX, float* InLocationY, bool* InbIsCurrentlyPressed);
	struct FVector GetControllerVectorKeyState(const struct FKey& InKey);
	void GetControllerMouseDelta(float* InDeltaX, float* InDeltaY);
	float GetControllerKeyTimeDown(const struct FKey& InKey);
	void GetControllerAnalogStickState(enum class EControllerAnalogStick InWhichStick, float* InStickX, float* InStickY);
	float GetControllerAnalogKeyState(const struct FKey& InKey);
};

// 0x1028 (0x1050 - 0x28)
// Class Engine.Engine
class UEngine : public UObject
{
public:
	uint8                                        Pad_A26[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFont*                                 TinyFont;                                          // 0x30(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                       TinyFontName;                                      // 0x38(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFont*                                 SmallFont;                                         // 0x58(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                       SmallFontName;                                     // 0x60(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFont*                                 MediumFont;                                        // 0x80(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                       MediumFontName;                                    // 0x88(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFont*                                 LargeFont;                                         // 0xA8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                       LargeFontName;                                     // 0xB0(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFont*                                 SubtitleFont;                                      // 0xD0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                       SubtitleFontName;                                  // 0xD8(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFont*>                         AdditionalFonts;                                   // 0xF8(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class FString>                        AdditionalFontNames;                               // 0x108(0x10)(Edit, ZeroConstructor, Config, GlobalConfig, AdvancedDisplay, NativeAccessSpecifierPublic)
	TSubclassOf<class UConsole>                  ConsoleClass;                                      // 0x118(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        ConsoleClassName;                                  // 0x120(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameViewportClient>       GameViewportClientClass;                           // 0x140(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        GameViewportClientClassName;                       // 0x148(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULocalPlayer>              LocalPlayerClass;                                  // 0x168(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        LocalPlayerClassName;                              // 0x170(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AWorldSettings>            WorldSettingsClass;                                // 0x190(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        WorldSettingsClassName;                            // 0x198(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        NavigationSystemClassName;                         // 0x1B8(0x20)(ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationSystemBase>     NavigationSystemClass;                             // 0x1D8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        NavigationSystemConfigClassName;                   // 0x1E0(0x20)(ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationSystemConfig>   NavigationSystemConfigClass;                       // 0x200(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        AvoidanceManagerClassName;                         // 0x208(0x20)(ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAvoidanceManager>         AvoidanceManagerClass;                             // 0x228(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        AIControllerClassName;                             // 0x230(0x20)(ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UPhysicsCollisionHandler>  PhysicsCollisionHandlerClass;                      // 0x250(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        PhysicsCollisionHandlerClassName;                  // 0x258(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, NoClear, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        GameUserSettingsClassName;                         // 0x278(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, NoClear, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameUserSettings>         GameUserSettingsClass;                             // 0x298(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameUserSettings*                     GameUserSettings;                                  // 0x2A0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ALevelScriptActor>         LevelScriptActorClass;                             // 0x2A8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        LevelScriptActorClassName;                         // 0x2B0(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        DefaultBlueprintBaseClassName;                     // 0x2D0(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, NoClear, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        GameSingletonClassName;                            // 0x2F0(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, NoClear, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               GameSingleton;                                     // 0x310(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                        AssetManagerClassName;                             // 0x318(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, NoClear, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAssetManager*                         AssetManager;                                      // 0x338(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            DefaultTexture;                                    // 0x340(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       DefaultTextureName;                                // 0x348(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                              DefaultDiffuseTexture;                             // 0x368(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       DefaultDiffuseTextureName;                         // 0x370(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            DefaultBSPVertexTexture;                           // 0x390(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       DefaultBSPVertexTextureName;                       // 0x398(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            HighFrequencyNoiseTexture;                         // 0x3B8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       HighFrequencyNoiseTextureName;                     // 0x3C0(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            DefaultBokehTexture;                               // 0x3E0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       DefaultBokehTextureName;                           // 0x3E8(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            DefaultBloomKernelTexture;                         // 0x408(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       DefaultBloomKernelTextureName;                     // 0x410(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            DefaultFilmGrainTexture;                           // 0x430(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       DefaultFilmGrainTextureName;                       // 0x438(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             WireframeMaterial;                                 // 0x458(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                WireframeMaterialName;                             // 0x460(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             DebugMeshMaterial;                                 // 0x470(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       DebugMeshMaterialName;                             // 0x478(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             EmissiveMeshMaterial;                              // 0x498(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       EmissiveMeshMaterialName;                          // 0x4A0(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             LevelColorationLitMaterial;                        // 0x4C0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                LevelColorationLitMaterialName;                    // 0x4C8(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             LevelColorationUnlitMaterial;                      // 0x4D8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                LevelColorationUnlitMaterialName;                  // 0x4E0(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             LightingTexelDensityMaterial;                      // 0x4F0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                LightingTexelDensityName;                          // 0x4F8(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             ShadedLevelColorationLitMaterial;                  // 0x508(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ShadedLevelColorationLitMaterialName;              // 0x510(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             ShadedLevelColorationUnlitMaterial;                // 0x520(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ShadedLevelColorationUnlitMaterialName;            // 0x528(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             RemoveSurfaceMaterial;                             // 0x538(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       RemoveSurfaceMaterialName;                         // 0x540(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             VertexColorMaterial;                               // 0x560(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                VertexColorMaterialName;                           // 0x568(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             VertexColorViewModeMaterial_ColorOnly;             // 0x578(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                VertexColorViewModeMaterialName_ColorOnly;         // 0x580(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             VertexColorViewModeMaterial_AlphaAsColor;          // 0x590(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                VertexColorViewModeMaterialName_AlphaAsColor;      // 0x598(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             VertexColorViewModeMaterial_RedOnly;               // 0x5A8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                VertexColorViewModeMaterialName_RedOnly;           // 0x5B0(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             VertexColorViewModeMaterial_GreenOnly;             // 0x5C0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                VertexColorViewModeMaterialName_GreenOnly;         // 0x5C8(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             VertexColorViewModeMaterial_BlueOnly;              // 0x5D8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                VertexColorViewModeMaterialName_BlueOnly;          // 0x5E0(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       DebugEditorMaterialName;                           // 0x5F0(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             ConstraintLimitMaterial;                           // 0x610(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialX;                          // 0x618(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialXAxis;                      // 0x620(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialY;                          // 0x628(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialYAxis;                      // 0x630(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialZ;                          // 0x638(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialZAxis;                      // 0x640(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialPrismatic;                  // 0x648(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             InvalidLightmapSettingsMaterial;                   // 0x650(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       InvalidLightmapSettingsMaterialName;               // 0x658(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             PreviewShadowsIndicatorMaterial;                   // 0x678(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       PreviewShadowsIndicatorMaterialName;               // 0x680(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             ArrowMaterial;                                     // 0x6A0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              ArrowMaterialYellow;                               // 0x6A8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       ArrowMaterialName;                                 // 0x6B0(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          LightingOnlyBrightness;                            // 0x6D0(0x10)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                  ShaderComplexityColors;                            // 0x6E0(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                  QuadComplexityColors;                              // 0x6F0(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                  LightComplexityColors;                             // 0x700(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                  StationaryLightOverlapColors;                      // 0x710(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                  LODColorationColors;                               // 0x720(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                  HLODColorationColors;                              // 0x730(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                  StreamingAccuracyColors;                           // 0x740(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	struct FLinearColor                          GPUSkinCacheVisualizationExcludedColor;            // 0x750(0x10)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          GPUSkinCacheVisualizationIncludedColor;            // 0x760(0x10)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          GPUSkinCacheVisualizationRecomputeTangentsColor;   // 0x770(0x10)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GPUSkinCacheVisualizationLowMemoryThresholdInMB;   // 0x780(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GPUSkinCacheVisualizationHighMemoryThresholdInMB;  // 0x784(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          GPUSkinCacheVisualizationLowMemoryColor;           // 0x788(0x10)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          GPUSkinCacheVisualizationMidMemoryColor;           // 0x798(0x10)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          GPUSkinCacheVisualizationHighMemoryColor;          // 0x7A8(0x10)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                  GPUSkinCacheVisualizationRayTracingLODOffsetColors; // 0x7B8(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	float                                        MaxPixelShaderAdditiveComplexityCount;             // 0x7C8(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxES3PixelShaderAdditiveComplexityCount;          // 0x7CC(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinLightMapDensity;                                // 0x7D0(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IdealLightMapDensity;                              // 0x7D4(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxLightMapDensity;                                // 0x7D8(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRenderLightMapDensityGrayscale : 1;               // Mask: 0x1, PropSize: 0x10x7DC(0x1)(Config, GlobalConfig, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_77 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A57[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RenderLightMapDensityGrayscaleScale;               // 0x7E0(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RenderLightMapDensityColorScale;                   // 0x7E4(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          LightMapDensityVertexMappedColor;                  // 0x7E8(0x10)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          LightMapDensitySelectedColor;                      // 0x7F8(0x10)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStatColorMapping>             StatColorMappings;                                 // 0x808(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                     DefaultPhysMaterial;                               // 0x818(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       DefaultPhysMaterialName;                           // 0x820(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                     DefaultDestructiblePhysMaterial;                   // 0x840(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       DefaultDestructiblePhysMaterialName;               // 0x848(0x20)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameNameRedirect>             ActiveGameNameRedirects;                           // 0x868(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FClassRedirect>                ActiveClassRedirects;                              // 0x878(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FPluginRedirect>               ActivePluginRedirects;                             // 0x888(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FStructRedirect>               ActiveStructRedirects;                             // 0x898(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class UTexture2D*                            PreIntegratedSkinBRDFTexture;                      // 0x8A8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       PreIntegratedSkinBRDFTextureName;                  // 0x8B0(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            BlueNoiseScalarTexture;                            // 0x8D0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            BlueNoiseVec2Texture;                              // 0x8D8(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       BlueNoiseScalarTextureName;                        // 0x8E0(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       BlueNoiseVec2TextureName;                          // 0x900(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            MiniFontTexture;                                   // 0x920(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       MiniFontTextureName;                               // 0x928(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                              WeightMapPlaceholderTexture;                       // 0x948(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       WeightMapPlaceholderTextureName;                   // 0x950(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            LightMapDensityTexture;                            // 0x970(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       LightMapDensityTextureName;                        // 0x978(0x20)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A65[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGameViewportClient*                   GameViewport;                                      // 0x9A0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                        DeferredCommands;                                  // 0x9A8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        NearClipPlane;                                     // 0x9B8(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSubtitlesEnabled : 1;                             // Mask: 0x1, PropSize: 0x10x9BC(0x1)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSubtitlesForcedOff : 1;                           // Mask: 0x2, PropSize: 0x10x9BC(0x1)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_78 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A69[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaximumLoopIterationCount;                         // 0x9C0(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanBlueprintsTickByDefault : 1;                   // Mask: 0x1, PropSize: 0x10x9C4(0x1)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOptimizeAnimBlueprintMemberVariableAccess : 1;    // Mask: 0x2, PropSize: 0x10x9C4(0x1)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowMultiThreadedAnimationUpdate : 1;            // Mask: 0x4, PropSize: 0x10x9C4(0x1)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableEditorPSysRealtimeLOD : 1;                  // Mask: 0x8, PropSize: 0x10x9C4(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_79 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bSmoothFrameRate : 1;                              // Mask: 0x20, PropSize: 0x10x9C4(0x1)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseFixedFrameRate : 1;                            // Mask: 0x40, PropSize: 0x10x9C4(0x1)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_7A : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A6E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FixedFrameRate;                                    // 0x9C8(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                           SmoothedFrameRateRange;                            // 0x9CC(0x10)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A6F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UEngineCustomTimeStep*                 CustomTimeStep;                                    // 0x9E0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A71[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSoftClassPath                        CustomTimeStepClassName;                           // 0xA08(0x20)(Edit, ZeroConstructor, Config, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTimecodeProvider*                     TimecodeProvider;                                  // 0xA28(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A72[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSoftClassPath                        TimecodeProviderClassName;                         // 0xA50(0x20)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGenerateDefaultTimecode;                          // 0xA70(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A74[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFrameRate                            GenerateDefaultTimecodeFrameRate;                  // 0xA74(0x8)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GenerateDefaultTimecodeFrameDelay;                 // 0xA7C(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCheckForMultiplePawnsSpawnedInAFrame : 1;         // Mask: 0x1, PropSize: 0x10xA80(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_7B : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A76[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumPawnsAllowedToBeSpawnedInAFrame;                // 0xA84(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShouldGenerateLowQualityLightmaps : 1;            // Mask: 0x1, PropSize: 0x10xA88(0x1)(Config, GlobalConfig, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_7C : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A79[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                C_WorldBox;                                        // 0xA8C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_BrushWire;                                       // 0xA90(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_AddWire;                                         // 0xA94(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_SubtractWire;                                    // 0xA98(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_SemiSolidWire;                                   // 0xA9C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_NonSolidWire;                                    // 0xAA0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_WireBackground;                                  // 0xAA4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_ScaleBoxHi;                                      // 0xAA8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_VolumeCollision;                                 // 0xAAC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_BSPCollision;                                    // 0xAB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_OrthoBackground;                                 // 0xAB4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_Volume;                                          // 0xAB8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                C_BrushShape;                                      // 0xABC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StreamingDistanceFactor;                           // 0xAC0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A7E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDirectoryPath                        GameScreenshotSaveDirectory;                       // 0xAC8(0x10)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseStaticMeshMinLODPerQualityLevels;               // 0xAD8(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseSkeletalMeshMinLODPerQualityLevels;             // 0xAD9(0x1)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETransitionType                   TransitionType;                                    // 0xADA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A81[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                TransitionDescription;                             // 0xAE0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                TransitionGameMode;                                // 0xAF0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowMatureLanguage : 1;                          // Mask: 0x1, PropSize: 0x10xB00(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_7D : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A84[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CameraRotationThreshold;                           // 0xB04(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraTranslationThreshold;                        // 0xB08(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PrimitiveProbablyVisibleTime;                      // 0xB0C(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxOcclusionPixelsFraction;                        // 0xB10(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPauseOnLossOfFocus : 1;                           // Mask: 0x1, PropSize: 0x10xB14(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_7E : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A8A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxParticleResize;                                 // 0xB18(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxParticleResizeWarn;                             // 0xB1C(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDropNoteInfo>                 PendingDroppedNotes;                               // 0xB20(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	float                                        NetClientTicksPerSecond;                           // 0xB30(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DisplayGamma;                                      // 0xB34(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinDesiredFrameRate;                               // 0xB38(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          DefaultSelectedMaterialColor;                      // 0xB3C(0x10)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                          SelectedMaterialColor;                             // 0xB4C(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                          SelectionOutlineColor;                             // 0xB5C(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                          SubduedSelectionOutlineColor;                      // 0xB6C(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                          SelectedMaterialColorOverride;                     // 0xB7C(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsOverridingSelectedColor;                        // 0xB8C(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A90[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bEnableOnScreenDebugMessages : 1;                  // Mask: 0x1, PropSize: 0x10xB90(0x1)(Config, GlobalConfig, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableOnScreenDebugMessagesDisplay : 1;           // Mask: 0x2, PropSize: 0x10xB90(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSuppressMapWarnings : 1;                          // Mask: 0x4, PropSize: 0x10xB90(0x1)(Config, GlobalConfig, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisableAILogging : 1;                             // Mask: 0x8, PropSize: 0x10xB90(0x1)(Config, GlobalConfig, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_7F : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A94[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       bEnableVisualLogRecordingOnStart;                  // 0xB94(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ScreenSaverInhibitorSemaphore;                     // 0xB98(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bLockReadOnlyLevels : 1;                           // Mask: 0x1, PropSize: 0x10xB9C(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_80 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A96[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ParticleEventManagerClassPath;                     // 0xBA0(0x10)(ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SelectionHighlightIntensity;                       // 0xBB0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BSPSelectionHighlightIntensity;                    // 0xBB4(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SelectionHighlightIntensityBillboards;             // 0xBB8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A98[0x294];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       GlobalNetTravelCount;                              // 0xE50(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A99[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FNetDriverDefinition>          NetDriverDefinitions;                              // 0xE58(0x10)(ZeroConstructor, Transient, Config, NativeAccessSpecifierPublic)
	TArray<struct FIrisNetDriverConfig>          IrisNetDriverConfigs;                              // 0xE68(0x10)(ZeroConstructor, Transient, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                        ServerActors;                                      // 0xE78(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                        RuntimeServerActors;                               // 0xE88(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        NetErrorLogInterval;                               // 0xE98(0x4)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStartedLoadMapMovie : 1;                          // Mask: 0x1, PropSize: 0x10xE9C(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_82 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A9E[0x1B];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NextWorldContextHandle;                            // 0xEB8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A9F[0x194];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Engine");
		return Clss;
	}

};

// 0x250 (0x298 - 0x48)
// Class Engine.LocalPlayer
class ULocalPlayer : public UPlayer
{
public:
	uint8                                        Pad_AA6[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGameViewportClient*                   ViewportClient;                                    // 0x78(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AA7[0x38];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAspectRatioAxisConstraint        AspectRatioAxisConstraint;                         // 0xB8(0x1)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AA8[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class APlayerController>         PendingLevelPlayerControllerClass;                 // 0xC0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSentSplitJoin : 1;                                // Mask: 0x1, PropSize: 0x10xC8(0x1)(Edit, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_84 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_AA9[0x17];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ControllerId;                                      // 0xE0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_AAB[0x1B4];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("LocalPlayer");
		return Clss;
	}

};

// 0x0 (0x30 - 0x30)
// Class Engine.LocalPlayerSubsystem
class ULocalPlayerSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("LocalPlayerSubsystem");
		return Clss;
	}

};

// 0x470 (0x498 - 0x28)
// Class Engine.PlayerInput
class UPlayerInput : public UObject
{
public:
	uint8                                        Pad_AC7[0x178];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FKeyBind>                      DebugExecBindings;                                 // 0x1A0(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                        Pad_AC9[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          InvertedAxis;                                      // 0x1E0(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                        Pad_ACA[0x2A8];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("PlayerInput");
		return Clss;
	}

	void SetMouseSensitivity(float InSensitivity);
	void SetBind(class FName InBindName, const class FString& InCommand);
	void InvertAxisKey(const struct FKey& InAxisKey);
	void InvertAxis(class FName InAxisName);
	class APlayerController* GetOuterAPlayerController();
	void ClearSmoothing();
};

// 0x0 (0x30 - 0x30)
// Class Engine.PrimaryDataAsset
class UPrimaryDataAsset : public UDataAsset
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("PrimaryDataAsset");
		return Clss;
	}

};

// 0x0 (0x28 - 0x28)
// Class Engine.SaveGame
class USaveGame : public UObject
{
public:

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SaveGame");
		return Clss;
	}

};

// 0x10 (0x38 - 0x28)
// Class Engine.ScriptViewportClient
class UScriptViewportClient : public UObject
{
public:
	uint8                                        Pad_AD0[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ScriptViewportClient");
		return Clss;
	}

};

// 0x368 (0x3A0 - 0x38)
// Class Engine.GameViewportClient
class UGameViewportClient : public UScriptViewportClient
{
public:
	uint8                                        Pad_AD7[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UConsole*                              ViewportConsole;                                   // 0x40(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDebugDisplayProperty>         DebugProperties;                                   // 0x48(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_AD8[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxSplitscreenPlayers;                             // 0x68(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AD9[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UWorld*                                World;                                             // 0x78(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameInstance*                         GameInstance;                                      // 0x80(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_ADA[0x318];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GameViewportClient");
		return Clss;
	}

	void SSSwapControllers();
	void ShowTitleSafeArea();
	void SetConsoleTarget(int32 InPlayerIndex);
};

// 0x150 (0x380 - 0x230)
// Class Engine.BlueprintGeneratedClass
class UBlueprintGeneratedClass : public UClass
{
public:
	uint8                                        Pad_ADC[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumReplicatedProperties;                           // 0x238(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasNativizedParent : 1;                           // Mask: 0x1, PropSize: 0x10x23C(0x1)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasCookedComponentInstancingData : 1;             // Mask: 0x2, PropSize: 0x10x23C(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_8C : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_AE0[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UDynamicBlueprintBinding*>      DynamicBindingObjects;                             // 0x240(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>               ComponentTemplates;                                // 0x250(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UTimelineTemplate*>             Timelines;                                         // 0x260(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FBPComponentClassOverride>     ComponentClassOverrides;                           // 0x270(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	class USimpleConstructionScript*             SimpleConstructionScript;                          // 0x280(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInheritableComponentHandler*          InheritableComponentHandler;                       // 0x288(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStructProperty*                       UberGraphFramePointerProperty;                     // 0x290(0x8)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AE5[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFunction*                             UberGraphFunction;                                 // 0x2A0(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              CookedPropertyGuids;                               // 0x2A8(0x50)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData;                     // 0x2F8(0x50)(NativeAccessSpecifierPublic)
	uint8                                        Pad_AEA[0x38];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("BlueprintGeneratedClass");
		return Clss;
	}

};

// 0x88 (0xB0 - 0x28)
// Class Engine.DataTable
class UDataTable : public UObject
{
public:
	class UScriptStruct*                         RowStruct;                                         // 0x28(0x8)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AED[0x50];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bStripFromClientBuilds : 1;                        // Mask: 0x1, PropSize: 0x10x80(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreExtraFields : 1;                            // Mask: 0x2, PropSize: 0x10x80(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreMissingFields : 1;                          // Mask: 0x4, PropSize: 0x10x80(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_8D : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_AEE[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ImportKeyField;                                    // 0x88(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AEF[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("DataTable");
		return Clss;
	}

};

// 0xA8 (0xD0 - 0x28)
// Class Engine.StreamableRenderAsset
class UStreamableRenderAsset : public UObject
{
public:
	uint8                                        Pad_AF5[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       ForceMipLevelsToBeResidentTimestamp;               // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        NumCinematicMipLevels;                             // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AF7[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPerQualityLevelInt                   NoRefStreamingLODBias;                             // 0x50(0x68)(Protected, NativeAccessSpecifierProtected)
	int32                                        StreamingIndex;                                    // 0xB8(0x4)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CachedCombinedLODBias;                             // 0xBC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        NeverStream : 1;                                   // Mask: 0x1, PropSize: 0x10xC0(0x1)(Edit, BlueprintVisible, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bGlobalForceMipLevelsToBeResident : 1;             // Mask: 0x2, PropSize: 0x10xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasStreamingUpdatePending : 1;                    // Mask: 0x4, PropSize: 0x10xC0(0x1)(Transient, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceMiplevelsToBeResident : 1;                   // Mask: 0x8, PropSize: 0x10xC0(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreStreamingMipBias : 1;                       // Mask: 0x10, PropSize: 0x10xC0(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseCinematicMipLevels : 1;                        // Mask: 0x20, PropSize: 0x10xC0(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_AFA[0xF];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("StreamableRenderAsset");
		return Clss;
	}

	void SetForceMipLevelsToBeResident(float InSeconds, int32 InCinematicLODGroupMask);
};

// 0x120 (0x1F0 - 0xD0)
// Class Engine.Texture
class UTexture : public UStreamableRenderAsset
{
public:
	uint8                                        Pad_AFF[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 LightingGuid;                                      // 0xE0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        LevelIndex;                                        // 0xF0(0x4)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LODBias;                                           // 0xF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETextureCompressionSettings       CompressionSettings;                               // 0xF8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETextureFilter                    Filter;                                            // 0xF9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETextureMipLoadOptions            MipLoadOptions;                                    // 0xFA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETextureGroup                     LODGroup;                                          // 0xFB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerPlatformFloat                     Downscale;                                         // 0xFC(0x4)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	enum class ETextureDownscaleOptions          DownscaleOptions;                                  // 0x100(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SRGB : 1;                                          // Mask: 0x1, PropSize: 0x10x101(0x1)(Edit, BlueprintVisible, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoTiling : 1;                                     // Mask: 0x2, PropSize: 0x10x101(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        VirtualTextureStreaming : 1;                       // Mask: 0x4, PropSize: 0x10x101(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CompressionYCoCg : 1;                              // Mask: 0x8, PropSize: 0x10x101(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNotOfflineProcessed : 1;                          // Mask: 0x10, PropSize: 0x10x101(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAsyncResourceReleaseHasBeenStarted : 1;           // Mask: 0x20, PropSize: 0x10x101(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_8E : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_B07[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x108(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_B08[0xD8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Texture");
		return Clss;
	}

	int64 Blueprint_GetMemorySize();
};

// 0x330 (0x8A0 - 0x570)
// Class Engine.SkinnedMeshComponent
class USkinnedMeshComponent : public UMeshComponent
{
public:
	uint8                                        Pad_C0A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMesh*                         SkeletalMesh;                                      // 0x578(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkinnedAsset*                         SkinnedAsset;                                      // 0x580(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class USkinnedMeshComponent>  LeaderPoseComponent;                               // 0x588(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<enum class ESkinCacheUsage>           SkinCacheUsage;                                    // 0x590(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bSetMeshDeformer;                                  // 0x5A0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C17[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UMeshDeformer*                         MeshDeformer;                                      // 0x5A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshDeformerInstanceSettings*         MeshDeformerInstanceSettings;                      // 0x5B0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshDeformerInstance*                 MeshDeformerInstance;                              // 0x5B8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C1A[0x168];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UPhysicsAsset*                         PhysicsAssetOverride;                              // 0x728(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ForcedLodModel;                                    // 0x730(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinLodModel;                                       // 0x734(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C1C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StreamingDistanceMultiplier;                       // 0x740(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C1F[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSkelMeshComponentLODInfo>     LODInfo;                                           // 0x750(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_C20[0x24];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EVisibilityBasedAnimTickOption    VisibilityBasedAnimTickOption;                     // 0x784(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C21[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        BitPad_8F : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bOverrideMinLod : 1;                               // Mask: 0x8, PropSize: 0x10x786(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseBoundsFromLeaderPoseComponent : 1;             // Mask: 0x10, PropSize: 0x10x786(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceWireframe : 1;                               // Mask: 0x20, PropSize: 0x10x786(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisplayBones : 1;                                 // Mask: 0x40, PropSize: 0x10x786(0x1)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisableMorphTarget : 1;                           // Mask: 0x80, PropSize: 0x10x786(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHideSkin : 1;                                     // Mask: 0x1, PropSize: 0x10x787(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPerBoneMotionBlur : 1;                            // Mask: 0x2, PropSize: 0x10x787(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bComponentUseFixedSkelBounds : 1;                  // Mask: 0x4, PropSize: 0x10x787(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bConsiderAllBodiesForBounds : 1;                   // Mask: 0x8, PropSize: 0x10x787(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSyncAttachParentLOD : 1;                          // Mask: 0x10, PropSize: 0x10x787(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanHighlightSelectedSections : 1;                 // Mask: 0x20, PropSize: 0x10x787(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRecentlyRendered : 1;                             // Mask: 0x40, PropSize: 0x10x787(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastCapsuleDirectShadow : 1;                      // Mask: 0x80, PropSize: 0x10x787(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCastCapsuleIndirectShadow : 1;                    // Mask: 0x1, PropSize: 0x10x788(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCPUSkinning : 1;                                  // Mask: 0x2, PropSize: 0x10x788(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableUpdateRateOptimizations : 1;                // Mask: 0x4, PropSize: 0x10x788(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisplayDebugUpdateRateOptimizations : 1;          // Mask: 0x8, PropSize: 0x10x788(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRenderStatic : 1;                                 // Mask: 0x10, PropSize: 0x10x788(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreLeaderPoseComponentLOD : 1;                 // Mask: 0x20, PropSize: 0x10x788(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_90 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bCachedLocalBoundsUpToDate : 1;                    // Mask: 0x1, PropSize: 0x10x789(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCachedWorldSpaceBoundsUpToDate : 1;               // Mask: 0x2, PropSize: 0x10x789(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_91 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bForceMeshObjectUpdate : 1;                        // Mask: 0x10, PropSize: 0x10x789(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_92 : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        BitPad_93 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bFollowerShouldTickPose : 1;                       // Mask: 0x4, PropSize: 0x10x78A(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_94 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C28[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CapsuleIndirectShadowMinVisibility;                // 0x78C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C29[0x38];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBoxSphereBounds                      CachedWorldOrLocalSpaceBounds;                     // 0x7C8(0x38)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FMatrix                               CachedWorldToLocalTransform;                       // 0x800(0x80)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_C2B[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SkinnedMeshComponent");
		return Clss;
	}

	void UnloadSkinWeightProfile(class FName InInProfileName);
	void UnHideBoneByName(class FName InBoneName);
	void TransformToBoneSpace(class FName InBoneName, const struct FVector& InInPosition, const struct FRotator& InInRotation, struct FVector* InOutPosition, struct FRotator* InOutRotation);
	void TransformFromBoneSpace(class FName InBoneName, const struct FVector& InInPosition, const struct FRotator& InInRotation, struct FVector* InOutPosition, struct FRotator* InOutRotation);
	void ShowMaterialSection(int32 InMaterialID, int32 InSectionIndex, bool InbShow, int32 InLODIndex);
	void ShowAllMaterialSections(int32 InLODIndex);
	void SetVertexOffsetUsage(int32 InLODIndex, int32 InUsage);
	void SetVertexColorOverride_LinearColor(int32 InLODIndex, TArray<struct FLinearColor>& InVertexColors);
	bool SetSkinWeightProfile(class FName InInProfileName);
	void SetSkinWeightOverride(int32 InLODIndex, TArray<struct FSkelMeshSkinWeightInfo>& InSkinWeights);
	void SetSkinnedAssetAndUpdate(class USkinnedAsset* InNewMesh, bool InbReinitPose);
	void SetRenderStatic(bool InbNewValue);
	void SetPreSkinningOffsets(int32 InLODIndex, const TArray<struct FVector>& InOffsets);
	void SetPostSkinningOffsets(int32 InLODIndex, const TArray<struct FVector>& InOffsets);
	void SetPhysicsAsset(class UPhysicsAsset* InNewPhysicsAsset, bool InbForceReInit);
	void SetMinLOD(int32 InInNewMinLOD);
	void SetMeshDeformer(class UMeshDeformer* InInMeshDeformer);
	void SetLeaderPoseComponent(class USkinnedMeshComponent* InNewLeaderBoneComponent, bool InbForceUpdate, bool InbInFollowerShouldTickPose);
	void SetForcedLOD(int32 InInNewForcedLOD);
	void SetCastCapsuleIndirectShadow(bool InbNewValue);
	void SetCastCapsuleDirectShadow(bool InbNewValue);
	void SetCapsuleIndirectShadowMinVisibility(float InNewValue);
	bool IsUsingSkinWeightProfile();
	bool IsMaterialSectionShown(int32 InMaterialID, int32 InLODIndex);
	bool IsBoneHiddenByName(class FName InBoneName);
	void HideBoneByName(class FName InBoneName, enum class EPhysBodyOp InPhysBodyOption);
	int32 GetVertexOffsetUsage(int32 InLODIndex);
	bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(class FName InBoneName, float* InOutTwistAngle, float* InOutSwingAngle);
	class FName GetSocketBoneName(class FName InInSocketName);
	class USkinnedAsset* GetSkinnedAsset();
	class USkeletalMesh* GetSkeletalMesh_DEPRECATED();
	struct FTransform GetRefPoseTransform(int32 InBoneIndex);
	struct FVector GetRefPosePosition(int32 InBoneIndex);
	int32 GetPredictedLODLevel();
	class FName GetParentBone(class FName InBoneName);
	int32 GetNumLODs();
	int32 GetNumBones();
	int32 GetForcedLOD();
	struct FTransform GetDeltaTransformFromRefPose(class FName InBoneName, class FName InBaseName);
	class FName GetCurrentSkinWeightProfileName();
	class FName GetBoneName(int32 InBoneIndex);
	int32 GetBoneIndex(class FName InBoneName);
	class FName FindClosestBone_K2(const struct FVector& InTestLocation, struct FVector* InBoneLocation, float InIgnoreScale, bool InbRequirePhysicsAsset);
	void ClearVertexColorOverride(int32 InLODIndex);
	void ClearSkinWeightProfile();
	void ClearSkinWeightOverride(int32 InLODIndex);
	bool BoneIsChildOf(class FName InBoneName, class FName InParentBoneName);
};

// 0x6E0 (0xF80 - 0x8A0)
// Class Engine.SkeletalMeshComponent
class USkeletalMeshComponent : public USkinnedMeshComponent
{
public:
	TSubclassOf<class UObject>                   AnimBlueprintGeneratedClass;                       // 0x8A0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimInstance>             AnimClass;                                         // 0x8A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimInstance*                         AnimScriptInstance;                                // 0x8B0(0x8)(ZeroConstructor, Transient, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimInstance*                         PostProcessAnimInstance;                           // 0x8B8(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSingleAnimationPlayData              AnimationData;                                     // 0x8C0(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_D79[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RootBoneTranslation;                               // 0x8E8(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LineCheckBoundsScale;                              // 0x900(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D7A[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAnimInstance*>                 LinkedInstances;                                   // 0x948(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FTransform>                    CachedBoneSpaceTransforms;                         // 0x958(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FTransform>                    CachedComponentSpaceTransforms;                    // 0x968(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D7B[0xB0];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GlobalAnimRateScale;                               // 0xA28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EKinematicBonesUpdateToPhysics    KinematicBonesUpdateType;                          // 0xA2C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPhysicsTransformUpdateMode       PhysicsTransformUpdateMode;                        // 0xA2D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D7C[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAnimationMode                    AnimationMode;                                     // 0xA2F(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D7E[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bDisablePostProcessBlueprint : 1;                  // Mask: 0x1, PropSize: 0x10xA31(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_99 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bUpdateOverlapsOnAnimationFinalize : 1;            // Mask: 0x4, PropSize: 0x10xA31(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_9A : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bHasValidBodies : 1;                               // Mask: 0x10, PropSize: 0x10xA31(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlendPhysics : 1;                                 // Mask: 0x20, PropSize: 0x10xA31(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnablePhysicsOnDedicatedServer : 1;               // Mask: 0x40, PropSize: 0x10xA31(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUpdateMeshWhenKinematic : 1;                      // Mask: 0x80, PropSize: 0x10xA31(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUpdateJointsFromAnimation : 1;                    // Mask: 0x1, PropSize: 0x10xA32(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowClothActors : 1;                             // Mask: 0x2, PropSize: 0x10xA32(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisableClothSimulation : 1;                       // Mask: 0x4, PropSize: 0x10xA32(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_9B : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_D80[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bDisableRigidBodyAnimNode : 1;                     // Mask: 0x1, PropSize: 0x10xA38(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bAllowAnimCurveEvaluation : 1;                     // Mask: 0x2, PropSize: 0x10xA38(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bDisableAnimCurves : 1;                            // Mask: 0x4, PropSize: 0x10xA38(0x1)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_9C : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bCollideWithEnvironment : 1;                       // Mask: 0x40, PropSize: 0x10xA38(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCollideWithAttachedChildren : 1;                  // Mask: 0x80, PropSize: 0x10xA38(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceCollisionUpdate : 1;                         // Mask: 0x1, PropSize: 0x10xA39(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLocalSpaceSimulation : 1;                         // Mask: 0x2, PropSize: 0x10xA39(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bResetAfterTeleport : 1;                           // Mask: 0x4, PropSize: 0x10xA39(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_9D : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bDeferKinematicBoneUpdate : 1;                     // Mask: 0x10, PropSize: 0x10xA39(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoSkeletonUpdate : 1;                             // Mask: 0x20, PropSize: 0x10xA39(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPauseAnims : 1;                                   // Mask: 0x40, PropSize: 0x10xA39(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseRefPoseOnInitAnim : 1;                         // Mask: 0x80, PropSize: 0x10xA39(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnablePerPolyCollision : 1;                       // Mask: 0x1, PropSize: 0x10xA3A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceRefpose : 1;                                 // Mask: 0x2, PropSize: 0x10xA3A(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOnlyAllowAutonomousTickPose : 1;                  // Mask: 0x4, PropSize: 0x10xA3A(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsAutonomousTickPose : 1;                         // Mask: 0x8, PropSize: 0x10xA3A(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOldForceRefPose : 1;                              // Mask: 0x10, PropSize: 0x10xA3A(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowPrePhysBones : 1;                             // Mask: 0x20, PropSize: 0x10xA3A(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRequiredBonesUpToDate : 1;                        // Mask: 0x40, PropSize: 0x10xA3A(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAnimTreeInitialised : 1;                          // Mask: 0x80, PropSize: 0x10xA3A(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIncludeComponentLocationIntoBounds : 1;           // Mask: 0x1, PropSize: 0x10xA3B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableLineCheckWithBounds : 1;                    // Mask: 0x2, PropSize: 0x10xA3B(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPropagateCurvesToFollowers : 1;                   // Mask: 0x4, PropSize: 0x10xA3B(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSkipKinematicUpdateWhenInterpolating : 1;         // Mask: 0x8, PropSize: 0x10xA3B(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSkipBoundsUpdateWhenInterpolating : 1;            // Mask: 0x10, PropSize: 0x10xA3B(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_9E : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bNeedsQueuedAnimEventsDispatched : 1;              // Mask: 0x80, PropSize: 0x10xA3B(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D8F[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint16                                       CachedAnimCurveUidVersion;                         // 0xA3E(0x2)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ClothBlendWeight;                                  // 0xA40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWaitForParallelClothTask;                         // 0xA44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D95[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          DisallowedAnimCurves;                              // 0xA48(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UBodySetup*                            BodySetup;                                         // 0xA58(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D99[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ClothMaxDistanceScale;                             // 0xA64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnConstraintBroken;                                // 0xA68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPlasticDeformation;                              // 0xA78(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UClothingSimulationFactory> ClothingSimulationFactory;                         // 0xA88(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D9E[0xF8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TeleportDistanceThreshold;                         // 0xB88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TeleportRotationThreshold;                         // 0xB8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D9F[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       LastPoseTickFrame;                                 // 0xB98(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_DA1[0x94];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClothingSimulationInteractor*         ClothingInteractor;                                // 0xC30(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_DA3[0xC8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnAnimInitialized;                                 // 0xD00(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_DA4[0x270];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("SkeletalMeshComponent");
		return Clss;
	}

	void UnlinkAnimClassLayers(TSubclassOf<class UAnimInstance> InInClass);
	void UnbindClothFromLeaderPoseComponent(bool InbRestoreSimulationSpace);
	void ToggleDisablePostProcessBlueprint();
	void TermBodiesBelow(class FName InParentBoneName);
	void SuspendClothingSimulation();
	void Stop();
	void SnapshotPose(struct FPoseSnapshot& InSnapshot);
	void SetUpdateClothInEditor(bool InNewUpdateState);
	void SetUpdateAnimationInEditor(bool InNewUpdateState);
	void SetTeleportRotationThreshold(float InThreshold);
	void SetTeleportDistanceThreshold(float InThreshold);
	void SetSkeletalMeshAsset(class USkeletalMesh* InNewMesh);
	void SetPosition(float InInPos, bool InbFireNotifies);
	void SetPlayRate(float InRate);
	void SetPhysicsBlendWeight(float InPhysicsBlendWeight);
	void SetNotifyRigidBodyCollisionBelow(bool InbNewNotifyRigidBodyCollision, class FName InBoneName, bool InbIncludeSelf);
	void SetMorphTarget(class FName InMorphTargetName, float InValue, bool InbRemoveZeroWeight);
	void SetEnablePhysicsBlending(bool InbNewBlendPhysics);
	void SetEnableGravityOnAllBodiesBelow(bool InbEnableGravity, class FName InBoneName, bool InbIncludeSelf);
	void SetEnableBodyGravity(bool InbEnableGravity, class FName InBoneName);
	void SetDisablePostProcessBlueprint(bool InbInDisablePostProcess);
	void SetDisableAnimCurves(bool InbInDisableAnimCurves);
	void SetConstraintProfileForAll(class FName InProfileName, bool InbDefaultIfNotFound);
	void SetConstraintProfile(class FName InJointName, class FName InProfileName, bool InbDefaultIfNotFound);
	void SetClothMaxDistanceScale(float InScale);
	void SetBodyNotifyRigidBodyCollision(bool InbNewNotifyRigidBodyCollision, class FName InBoneName);
	void SetAnimClass(class UClass* InNewClass);
	void SetAnimationMode(enum class EAnimationMode InInAnimationMode);
	void SetAnimation(class UAnimationAsset* InNewAnimToPlay);
	void SetAngularLimits(class FName InInBoneName, float InSwing1LimitAngle, float InTwistLimitAngle, float InSwing2LimitAngle);
	void SetAllowRigidBodyAnimNode(bool InbInAllow, bool InbReinitAnim);
	void SetAllowedAnimCurvesEvaluation(TArray<class FName>& InList, bool InbAllow);
	void SetAllowClothActors(bool InbInAllow);
	void SetAllowAnimCurveEvaluation(bool InbInAllow);
	void SetAllMotorsAngularVelocityDrive(bool InbEnableSwingDrive, bool InbEnableTwistDrive, bool InbSkipCustomPhysicsType);
	void SetAllMotorsAngularPositionDrive(bool InbEnableSwingDrive, bool InbEnableTwistDrive, bool InbSkipCustomPhysicsType);
	void SetAllMotorsAngularDriveParams(float InInSpring, float InInDamping, float InInForceLimit, bool InbSkipCustomPhysicsType);
	void SetAllBodiesSimulatePhysics(bool InbNewSimulate);
	void SetAllBodiesPhysicsBlendWeight(float InPhysicsBlendWeight, bool InbSkipCustomPhysicsType);
	void SetAllBodiesBelowSimulatePhysics(class FName& InInBoneName, bool InbNewSimulate, bool InbIncludeSelf);
	void SetAllBodiesBelowPhysicsDisabled(class FName& InInBoneName, bool InbDisabled, bool InbIncludeSelf);
	void SetAllBodiesBelowPhysicsBlendWeight(class FName& InInBoneName, float InPhysicsBlendWeight, bool InbSkipCustomPhysicsType, bool InbIncludeSelf);
	void SetAllBodiesBelowLinearVelocity(class FName& InInBoneName, struct FVector& InLinearVelocity, bool InbIncludeSelf);
	void ResumeClothingSimulation();
	void ResetClothTeleportMode();
	void ResetAnimInstanceDynamics(enum class ETeleportType InInTeleportType);
	void ResetAllowedAnimCurveEvaluation();
	void ResetAllBodiesSimulatePhysics();
	void PlayAnimation(class UAnimationAsset* InNewAnimToPlay, bool InbLooping);
	void Play(bool InbLooping);
	void OverrideAnimationData(class UAnimationAsset* InInAnimToPlay, bool InbIsLooping, bool InbIsPlaying, float InPosition, float InPlayRate);
	void LinkAnimGraphByTag(class FName InInTag, TSubclassOf<class UAnimInstance> InInClass);
	void LinkAnimClassLayers(TSubclassOf<class UAnimInstance> InInClass);
	bool K2_GetClosestPointOnPhysicsAsset(struct FVector& InWorldPosition, struct FVector* InClosestWorldPosition, struct FVector* InNormal, class FName* InBoneName, float* InDistance);
	bool IsPlaying();
	bool IsClothingSimulationSuspended();
	bool IsBodyGravityEnabled(class FName InBoneName);
	bool HasValidAnimationInstance();
	bool GetTransformAttribute_Ref(class FName& InBoneName, class FName& InAttributeName, struct FTransform& InOutValue, enum class ECustomBoneAttributeLookup InLookupType);
	bool GetTransformAttribute(class FName& InBoneName, class FName& InAttributeName, const struct FTransform& InDefaultValue, struct FTransform* InOutValue, enum class ECustomBoneAttributeLookup InLookupType);
	float GetTeleportRotationThreshold();
	float GetTeleportDistanceThreshold();
	bool GetStringAttribute_Ref(class FName& InBoneName, class FName& InAttributeName, class FString& InOutValue, enum class ECustomBoneAttributeLookup InLookupType);
	bool GetStringAttribute(class FName& InBoneName, class FName& InAttributeName, const class FString& InDefaultValue, class FString* InOutValue, enum class ECustomBoneAttributeLookup InLookupType);
	class USkeletalMesh* GetSkeletalMeshAsset();
	struct FVector GetSkeletalCenterOfMass();
	class UAnimInstance* GetPostProcessInstance();
	float GetPosition();
	float GetPlayRate();
	float GetMorphTarget(class FName InMorphTargetName);
	class UAnimInstance* GetLinkedAnimLayerInstanceByGroup(class FName InInGroup);
	class UAnimInstance* GetLinkedAnimLayerInstanceByClass(TSubclassOf<class UAnimInstance> InInClass);
	void GetLinkedAnimGraphInstancesByTag(class FName InInTag, TArray<class UAnimInstance*>* InOutLinkedInstances);
	class UAnimInstance* GetLinkedAnimGraphInstanceByTag(class FName InInTag);
	bool GetIntegerAttribute_Ref(class FName& InBoneName, class FName& InAttributeName, int32& InOutValue, enum class ECustomBoneAttributeLookup InLookupType);
	bool GetIntegerAttribute(class FName& InBoneName, class FName& InAttributeName, int32 InDefaultValue, int32* InOutValue, enum class ECustomBoneAttributeLookup InLookupType);
	bool GetFloatAttribute_Ref(class FName& InBoneName, class FName& InAttributeName, float& InOutValue, enum class ECustomBoneAttributeLookup InLookupType);
	bool GetFloatAttribute(class FName& InBoneName, class FName& InAttributeName, float InDefaultValue, float* InOutValue, enum class ECustomBoneAttributeLookup InLookupType);
	bool GetDisablePostProcessBlueprint();
	bool GetDisableAnimCurves();
	void GetCurrentJointAngles(class FName InInBoneName, float* InSwing1Angle, float* InTwistAngle, float* InSwing2Angle);
	void GetConstraintsFromBody(class FName InBodyName, bool InbParentConstraints, bool InbChildConstraints, bool InbIncludesTerminated, TArray<struct FConstraintInstanceAccessor>* InOutConstraints);
	void GetConstraints(bool InbIncludesTerminated, TArray<struct FConstraintInstanceAccessor>* InOutConstraints);
	struct FConstraintInstanceAccessor GetConstraintByName(class FName InConstraintName, bool InbIncludesTerminated);
	float GetClothMaxDistanceScale();
	class UClothingSimulationInteractor* GetClothingSimulationInteractor();
	float GetBoneMass(class FName InBoneName, bool InbScaleMass);
	struct FVector GetBoneLinearVelocity(class FName& InInBoneName);
	class UAnimInstance* GetAnimInstance();
	class UClass* GetAnimClass();
	enum class EAnimationMode GetAnimationMode();
	bool GetAllowRigidBodyAnimNode();
	bool GetAllowedAnimCurveEvaluate();
	bool GetAllowClothActors();
	void ForceClothNextUpdateTeleportAndReset();
	void ForceClothNextUpdateTeleport();
	class FName FindConstraintBoneName(int32 InConstraintIndex);
	void ClearMorphTargets();
	void BreakConstraint(const struct FVector& InImpulse, const struct FVector& InHitLocation, class FName InInBoneName);
	void BindClothToLeaderPoseComponent();
	void AllowAnimCurveEvaluation(class FName InNameOfCurve, bool InbAllow);
	void AddImpulseToAllBodiesBelow(const struct FVector& InImpulse, class FName InBoneName, bool InbVelChange, bool InbIncludeSelf);
	void AddForceToAllBodiesBelow(const struct FVector& InForce, class FName InBoneName, bool InbAccelChange, bool InbIncludeSelf);
	void AccumulateAllBodiesBelowPhysicsBlendWeight(class FName& InInBoneName, float InAddPhysicsBlendWeight, bool InbSkipCustomPhysicsType);
};

// 0x308 (0x620 - 0x318)
// Class Engine.Character
class ACharacter : public APawn
{
public:
	class USkeletalMeshComponent*                Mesh;                                              // 0x318(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCharacterMovementComponent*           CharacterMovement;                                 // 0x320(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCapsuleComponent*                     CapsuleComponent;                                  // 0x328(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBasedMovementInfo                    BasedMovement;                                     // 0x330(0x48)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FBasedMovementInfo                    ReplicatedBasedMovement;                           // 0x378(0x48)(Net, RepNotify, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	float                                        AnimRootMotionTranslationScale;                    // 0x3C0(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E62[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               BaseTranslationOffset;                             // 0x3C8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FQuat                                 BaseRotationOffset;                                // 0x3E0(0x20)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ReplicatedServerLastTransformUpdateTimeStamp;      // 0x400(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ReplayLastTransformUpdateTimeStamp;                // 0x404(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        ReplicatedMovementMode;                            // 0x408(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInBaseReplication;                                // 0x409(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E64[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CrouchedEyeHeight;                                 // 0x40C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsCrouched : 1;                                   // Mask: 0x1, PropSize: 0x10x410(0x1)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bProxyIsJumpForceApplied : 1;                      // Mask: 0x2, PropSize: 0x10x410(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPressedJump : 1;                                  // Mask: 0x4, PropSize: 0x10x410(0x1)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClientUpdating : 1;                               // Mask: 0x8, PropSize: 0x10x410(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClientWasFalling : 1;                             // Mask: 0x10, PropSize: 0x10x410(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClientResimulateRootMotion : 1;                   // Mask: 0x20, PropSize: 0x10x410(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClientResimulateRootMotionSources : 1;            // Mask: 0x40, PropSize: 0x10x410(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSimGravityDisabled : 1;                           // Mask: 0x80, PropSize: 0x10x410(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClientCheckEncroachmentOnNetUpdate : 1;           // Mask: 0x1, PropSize: 0x10x411(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bServerMoveIgnoreRootMotion : 1;                   // Mask: 0x2, PropSize: 0x10x411(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bWasJumping : 1;                                   // Mask: 0x4, PropSize: 0x10x411(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_A0 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_E65[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        JumpKeyHoldTime;                                   // 0x414(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JumpForceTimeRemaining;                            // 0x418(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProxyJumpForceStartedTime;                         // 0x41C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JumpMaxHoldTime;                                   // 0x420(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        JumpMaxCount;                                      // 0x424(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        JumpCurrentCount;                                  // 0x428(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        JumpCurrentCountPreJump;                           // 0x42C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E66[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnReachedJumpApex;                                 // 0x438(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            LandedDelegate;                                    // 0x448(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            MovementModeChangedDelegate;                       // 0x458(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCharacterMovementUpdated;                        // 0x468(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FRootMotionSourceGroup                SavedRootMotion;                                   // 0x478(0x48)(Transient, NativeAccessSpecifierPublic)
	struct FRootMotionMovementParams             ClientRootMotionParams;                            // 0x4C0(0x70)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FSimulatedRootMotionReplicatedMove> RootMotionRepMoves;                                // 0x530(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRepRootMotionMontage                 RepRootMotion;                                     // 0x540(0xD8)(Net, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_E68[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Character");
		return Clss;
	}

	void UnCrouch(bool InbClientSimulation);
	void StopJumping();
	void StopAnimMontage(class UAnimMontage* InAnimMontage);
	void ServerMovePacked(struct FCharacterServerMovePackedBits& InPackedBits);
	void ServerMoveOld(float InOldTimeStamp, const struct FVector_NetQuantize10& InOldAccel, uint8 InOldMoveFlags);
	void ServerMoveNoBase(float InTimestamp, const struct FVector_NetQuantize10& InInAccel, const struct FVector_NetQuantize100& InClientLoc, uint8 InCompressedMoveFlags, uint8 InClientRoll, uint32 InView, uint8 InClientMovementMode);
	void ServerMoveDualNoBase(float InTimeStamp0, const struct FVector_NetQuantize10& InInAccel0, uint8 InPendingFlags, uint32 InView0, float InTimestamp, const struct FVector_NetQuantize10& InInAccel, const struct FVector_NetQuantize100& InClientLoc, uint8 InNewFlags, uint8 InClientRoll, uint32 InView, uint8 InClientMovementMode);
	void ServerMoveDualHybridRootMotion(float InTimeStamp0, const struct FVector_NetQuantize10& InInAccel0, uint8 InPendingFlags, uint32 InView0, float InTimestamp, const struct FVector_NetQuantize10& InInAccel, const struct FVector_NetQuantize100& InClientLoc, uint8 InNewFlags, uint8 InClientRoll, uint32 InView, class UPrimitiveComponent* InClientMovementBase, class FName InClientBaseBoneName, uint8 InClientMovementMode);
	void ServerMoveDual(float InTimeStamp0, const struct FVector_NetQuantize10& InInAccel0, uint8 InPendingFlags, uint32 InView0, float InTimestamp, const struct FVector_NetQuantize10& InInAccel, const struct FVector_NetQuantize100& InClientLoc, uint8 InNewFlags, uint8 InClientRoll, uint32 InView, class UPrimitiveComponent* InClientMovementBase, class FName InClientBaseBoneName, uint8 InClientMovementMode);
	void ServerMove(float InTimestamp, const struct FVector_NetQuantize10& InInAccel, const struct FVector_NetQuantize100& InClientLoc, uint8 InCompressedMoveFlags, uint8 InClientRoll, uint32 InView, class UPrimitiveComponent* InClientMovementBase, class FName InClientBaseBoneName, uint8 InClientMovementMode);
	void RootMotionDebugClientPrintOnScreen(const class FString& InInString);
	float PlayAnimMontage(class UAnimMontage* InAnimMontage, float InInPlayRate, class FName InStartSectionName);
	void OnWalkingOffLedge(struct FVector& InPreviousFloorImpactNormal, struct FVector& InPreviousFloorContactNormal, struct FVector& InPreviousLocation, float InTimeDelta);
	void OnRep_RootMotion();
	void OnRep_ReplicatedBasedMovement();
	void OnRep_ReplayLastTransformUpdateTimeStamp();
	void OnRep_IsCrouched();
	void OnLaunched(const struct FVector& InLaunchVelocity, bool InbXYOverride, bool InbZOverride);
	void OnLanded(struct FHitResult& InHit);
	void OnJumped();
	void LaunchCharacter(const struct FVector& InLaunchVelocity, bool InbXYOverride, bool InbZOverride);
	void K2_UpdateCustomMovement(float InDeltaTime);
	void K2_OnStartCrouch(float InHalfHeightAdjust, float InScaledHalfHeightAdjust);
	void K2_OnMovementModeChanged(enum class EMovementMode InPrevMovementMode, enum class EMovementMode InNewMovementMode, uint8 InPrevCustomMode, uint8 InNewCustomMode);
	void K2_OnEndCrouch(float InHalfHeightAdjust, float InScaledHalfHeightAdjust);
	void Jump();
	bool IsPlayingRootMotion();
	bool IsPlayingNetworkedRootMotionMontage();
	bool IsJumpProvidingForce();
	bool HasAnyRootMotion();
	class UAnimMontage* GetCurrentMontage();
	struct FVector GetBaseTranslationOffset();
	struct FRotator GetBaseRotationOffsetRotator();
	float GetAnimRootMotionTranslationScale();
	void Crouch(bool InbClientSimulation);
	void ClientVeryShortAdjustPosition(float InTimestamp, const struct FVector& InNewLoc, class UPrimitiveComponent* InNewBase, class FName InNewBaseBoneName, bool InbHasBase, bool InbBaseRelativePosition, uint8 InServerMovementMode);
	void ClientMoveResponsePacked(struct FCharacterMoveResponsePackedBits& InPackedBits);
	void ClientCheatWalk();
	void ClientCheatGhost();
	void ClientCheatFly();
	void ClientAdjustRootMotionSourcePosition(float InTimestamp, const struct FRootMotionSourceGroup& InServerRootMotion, bool InbHasAnimRootMotion, float InServerMontageTrackPosition, const struct FVector& InServerLoc, const struct FVector_NetQuantizeNormal& InServerRotation, float InServerVelZ, class UPrimitiveComponent* InServerBase, class FName InServerBoneName, bool InbHasBase, bool InbBaseRelativePosition, uint8 InServerMovementMode);
	void ClientAdjustRootMotionPosition(float InTimestamp, float InServerMontageTrackPosition, const struct FVector& InServerLoc, const struct FVector_NetQuantizeNormal& InServerRotation, float InServerVelZ, class UPrimitiveComponent* InServerBase, class FName InServerBoneName, bool InbHasBase, bool InbBaseRelativePosition, uint8 InServerMovementMode);
	void ClientAdjustPosition(float InTimestamp, const struct FVector& InNewLoc, const struct FVector& InNewVel, class UPrimitiveComponent* InNewBase, class FName InNewBaseBoneName, bool InbHasBase, bool InbBaseRelativePosition, uint8 InServerMovementMode);
	void ClientAckGoodMove(float InTimestamp);
	bool CanJumpInternal();
	bool CanJump();
	bool CanCrouch();
	void CacheInitialMeshOffset(const struct FVector& InMeshRelativeLocation, const struct FRotator& InMeshRelativeRotation);
};

// 0x88 (0xB0 - 0x28)
// Class Engine.MaterialExpression
class UMaterialExpression : public UObject
{
public:
	int32                                        MaterialExpressionEditorX;                         // 0x28(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaterialExpressionEditorY;                         // 0x2C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEdGraphNode*                          GraphNode;                                         // 0x30(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialExpression*                   SubgraphExpression;                                // 0x38(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E78[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 MaterialExpressionGuid;                            // 0x50(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                             Material;                                          // 0x60(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialFunction*                     Function;                                          // 0x68(0x8)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Desc;                                              // 0x70(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E79[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bRealtimePreview : 1;                              // Mask: 0x1, PropSize: 0x10x84(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNeedToUpdatePreview : 1;                          // Mask: 0x2, PropSize: 0x10x84(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_A1 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_E7A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bIsParameterExpression : 1;                        // Mask: 0x1, PropSize: 0x10x88(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_A2 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_E7B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
