#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x98 (0x98 - 0x0)
// UserDefinedStruct F_GenericErrorModalPayload.F_GenericErrorModalPayload
struct FF_GenericErrorModalPayload
{
public:
	class FText                                  ErrorText_5_4DB69AFC41EF7F6A096A5EB822ADD327;      // 0x0(0x18)(Edit, BlueprintVisible)
	class FText                                  TitleText_7_A8D1914549F9A577FDC9F598ADAD311F;      // 0x18(0x18)(Edit, BlueprintVisible)
	class FText                                  ButtonText_4_43F56B32485931BA0D1F6490639C7C74;     // 0x30(0x18)(Edit, BlueprintVisible)
	class FText                                  SubErrorText_20_43F3123141843E5759CD35B9C95A76F2;  // 0x48(0x18)(Edit, BlueprintVisible)
	struct FMargin                               ErrorContainerPadding_10_0895A96B48FC01C459682C8FFA488AF9; // 0x60(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                               ErrorTextPadding_13_53731E1340E83025468B73AFD7E23B6B; // 0x70(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                               TitleTextPadding_14_1D16239B45F278DD3F3FDCA22E8C20A2; // 0x80(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                       ButtonMinimumDesiredWidth_17_C02813D54CA5DE9590DA26983BFE0A3E; // 0x90(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


