#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1D8 (0x278 - 0xA0)
// Class Palia.AbilityAnimationComponent
class UAbilityAnimationComponent : public UActorComponent
{
public:
	class UDataTable*                            AnimationMappings;                                 // 0xA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UDataTable*>         ExtraAnimationMappings;                            // 0xA8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                  LastUsedAnimMappingName;                           // 0xF8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLastUsedAnimWasBlendSpace;                        // 0x100(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F57[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, class UDataTable*>         AudioAnimNotifyMappings;                           // 0x108(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnMontageNotify;                                   // 0x158(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnNotifyStateBegin;                                // 0x168(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnNotifyStateEnd;                                  // 0x178(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnChanged;                                         // 0x188(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnLocomotionTagChanged;                            // 0x198(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCombatTagChanged;                                // 0x1A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class FName>                          ActiveMontageNotifyStates;                         // 0x1B8(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UAICombatStateComponent*               AiCombatState;                                     // 0x1C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEquipmentComponent*                   EquipmentComponent;                                // 0x1D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAnimState                            AnimState;                                         // 0x1D8(0x18)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          LocomotionTag;                                     // 0x1F0(0x8)(Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          CombatTag;                                         // 0x1F8(0x8)(Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayAbilityRepAnimMontage        RepAnimMontageInfo;                                // 0x200(0x38)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGameplayAbilityLocalAnimMontage      LocalAnimMontageInfo;                              // 0x238(0x30)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1F60[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityAnimationComponent* GetDefaultObj();

	void TryChangeState(struct FAnimState& Context, enum class ERpcAction RpcAction);
	bool StopMontage(class UAnimMontage* AnimMontage);
	void StopAnimation(struct FGameplayTag& AnimTag);
	void StopAll(float BlendOut);
	void RpcServer_TryChangeState(struct FAnimState& Context, enum class ERpcAction RpcAction);
	void RpcServer_MontageAction(struct FMontageActionContext& Context);
	void RpcMontageAction(struct FMontageActionContext& Context);
	void RpcClient_TryChangeState(struct FAnimState& Context, enum class ERpcAction RpcAction);
	bool PlayMontage(const struct FMontageInfo& MontageInfo);
	void PlayAnimation(struct FGameplayTag& AnimTag);
	void OnRep_ReplicatedAnimMontage();
	void OnRep_LocomotionTag(struct FGameplayTag& OldTag);
	void OnRep_CombatTag(struct FGameplayTag& OldTag);
	void OnAbilityStarted(class UGameplayAbility* ActivatedAbility);
	void OnAbilityEnded(class UGameplayAbility* EndedAbility);
	void MontageActionFromContext(struct FMontageActionContext& Context);
	void MontageAction(enum class ERpcMontageAction Event, class UAnimMontage* Montage);
	bool IsNotifyStateActive(class FName& NotifyStateName);
	void HandleStateChanged(class UCharacterStateMachineComponent* Csm, const struct FCharacterStateChangeParams& Params);
	void HandleOnAnimInitialized();
	void HandleEquipmentVisibilityChanged(class UEquipmentComponent* InEquipmentComponent, bool bHidden);
	void HandleEquipmentChanged(class UEquipmentComponent* InEquipmentComponent, const struct FEquipmentItem& Item);
	void HandleAnimNotifyStateEnd(class FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
	void HandleAnimNotifyStateBegin(class FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
	struct FGameplayTag GetTagAssociatedWithRowName(class FName Name);
	class UAnimSequence* GetSequenceByName(class FName& Name, class FName& MappingQualifier);
	class UAnimSequence* GetSequence(const struct FGameplayTag& Tag, class FName& MappingQualifier);
	class FName GetRowNameAssociatedWithTag(const struct FGameplayTag& Tag);
	class UAnimMontage* GetMontageByName(class FName& Name, class FName& MappingQualifier);
	class UAnimMontage* GetMontage(const struct FGameplayTag& Tag, class FName& MappingQualifier);
	class FName GetMappingNameByTag(const struct FGameplayTag& Tag, class FName& MappingQualifier);
	struct FGameplayTag GetLocomotionTag();
	struct FGameplayTag GetCombatTag();
	class UBlendSpace* GetBlendSpaceByName(class FName& Name, class FName& MappingQualifier);
	class UBlendSpace* GetBlendSpace(const struct FGameplayTag& Tag, class FName& MappingQualifier);
	void Client_OnAnimStateChange(struct FAnimState& OldAnimState);
};

// 0x88 (0xB8 - 0x30)
// Class Palia.ValeriaAccomplishmentsManager
class UValeriaAccomplishmentsManager : public UGameInstanceSubsystem
{
public:
	FMulticastInlineDelegateProperty_            OnBatchAccomplishmentStatsUpdated;                 // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBatchAccomplishmentsUpdated;                     // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnStatUpdated;                                     // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAccomplishmentUnlocked;                          // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAccomplishmentRedeemed;                          // 0x70(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FE3[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UValeriaAccomplishmentsManager* GetDefaultObj();

	void UpdateIntegerStatForPlayer(class APlayerController* Player, const class FString& StatName, enum class EValeriaStatModificationType ModificationType, int32 Value);
	void UpdateFloatStatForPlayer(class APlayerController* Player, const class FString& StatName, enum class EValeriaStatModificationType ModificationType, float Value);
	void UpdateDoubleStatForPlayer(class APlayerController* Player, const class FString& StatName, enum class EValeriaStatModificationType ModificationType, double Value);
	void SetBooleanStatForPlayer(class APlayerController* Player, const class FString& StatName, bool NewValue);
	void IncrementCollectionStatForPlayer(class APlayerController* Player, const class FString& StatName, int32 PersistId, int32 Value);
	bool HasSetCollectionStatForPlayer(class APlayerController* Player, const class FString& StatName, int32 PersistId, bool* Value);
	bool HasRedeemedAchievementRewards(class APlayerController* Player, const class FString& AchievementID);
	bool HasAchievementUnlocked(class APlayerController* Player, const class FString& AchievementID);
	TArray<struct FAchievementUnlockRule> GetUnlockRulesForAchievement(const class FString& AchievementID);
	bool GetStatValueForPlayerAsString(class APlayerController* Player, const class FString& StatName, class FString* Value);
	TArray<struct FAchievementRewards> GetRewardsForAchievement(const class FString& AchievementID);
	bool GetIntegerStatForPlayer(class APlayerController* Player, const class FString& StatName, int32* Value);
	bool GetFloatStatForPlayer(class APlayerController* Player, const class FString& StatName, float* Value);
	int32 GetCurrentTierOfAchievementGroup(class APlayerController* Player, const class FString& GroupID);
	bool GetCollectionStatForPlayer(class APlayerController* Player, const class FString& StatName, int32 PersistId, int32* Value);
	bool GetBooleanStatForPlayer(class APlayerController* Player, const class FString& StatName, bool* Value);
	void GetAllStatsForPlayer(class APlayerController* Player, TMap<class FString, class FString>* OutStatNameValueTable);
	TArray<struct FValeriaOnlineAchievement> GetAchievementsForPlayer(class APlayerController* Player);
	TArray<struct FValeriaOnlineAchievement> GetAchievementsForNetId(struct FUniqueNetIdRepl& AccountId);
	class FString GetAchievementInGroupByTier(int32 Tier, const class FString& GroupID);
	TArray<class FString> GetAchievementGroup(const class FString& AccomplishmentId, const class FString& GroupID);
	TArray<struct FValeriaOnlineAchievementDefinition> GetAchievementDefinitions();
	struct FValeriaOnlineAchievementDefinition GetAchievementDefinition(const class FString& AchievementID);
	bool CanPlayerRedeemAchievement(class APlayerController* Player, const class FString& AchievementID);
};

// 0xA0 (0xD0 - 0x30)
// Class Palia.ActorSpawnPointsManager
class UActorSpawnPointsManager : public UGameInstanceSubsystem
{
public:
	TMap<class UClass*, struct FActorSpawnPointList> ActorSpawnPointsAvailable;                         // 0x30(0x50)(Transient, NativeAccessSpecifierPrivate)
	TMap<class AActor*, class AActor*>           ActorSpawnPointsUsed;                              // 0x80(0x50)(Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UActorSpawnPointsManager* GetDefaultObj();

	void RemoveSpawnPoint(class AActor* SpawnPointActor);
	void OnSpawnPointActorDestroyed(class AActor* SpawnPointActor);
	void OnOccupierActorDestroyed(class AActor* OccupierActor);
};

// 0x78 (0x118 - 0xA0)
// Class Palia.ActorTagComponent
class UActorTagComponent : public UActorComponent
{
public:
	uint8                                        Pad_2006[0x58];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnActorTagComponentUpdatedDel;                     // 0xF8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FTagEntry>                     TagValues;                                         // 0x108(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActorTagComponent* GetDefaultObj();

	void OnRep_TagValues();
	int32 GetTagValue(struct FGameplayTag& Tag);
};

// 0x18 (0xB8 - 0xA0)
// Class Palia.ActorTestHarnessComponent
class UActorTestHarnessComponent : public UActorComponent
{
public:
	float                                        SecondsBeforeSwitchingServer;                      // 0xA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2010[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CurrentTestCase;                                   // 0xA8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UActorTestHarnessComponent* GetDefaultObj();

	void OnTestStopped(const class FString& TestCase);
	void OnTestStarted(const class FString& TestCase);
};

// 0x18 (0x2A8 - 0x290)
// Class Palia.ActorWithGAS
class AActorWithGAS : public AActor
{
public:
	uint8                                        Pad_2014[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UValeriaGASComponent*                  ValeriaGAS;                                        // 0x298(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValeriaGASAttributeSet*               AttributeSet;                                      // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AActorWithGAS* GetDefaultObj();

};

// 0x130 (0x1D0 - 0xA0)
// Class Palia.AICombatStateComponent
class UAICombatStateComponent : public UActorComponent
{
public:
	class AActor*                                HighestThreatReplicatedToClient;                   // 0xA0(0x8)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         IsCombatEnabled;                                   // 0xA8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2090[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCharacterAddedAsThreat;                          // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FAIBehaviourRanges                    BehaviourRanges;                                   // 0xC0(0x40)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TMap<class FName, float>                     Speeds;                                            // 0x100(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                        InitialThreatLevel;                                // 0x150(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         UseOldThreatSystem;                                // 0x154(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2093[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxAbilityId;                                      // 0x158(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        LockedInAbilityUntil;                              // 0x15C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBehaviorTreeComponent*                BTComp;                                            // 0x160(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVitalsComponent*                      Vitals;                                            // 0x168(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        LastBlockedDamageAt;                               // 0x170(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsInCombat;                                       // 0x174(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2095[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAIThreatList                         ThreatList;                                        // 0x178(0x50)(NativeAccessSpecifierPrivate)
	struct FTimerHandle                          TickThreatListTimerHandle;                         // 0x1C8(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAICombatStateComponent* GetDefaultObj();

	void WipeThreatList();
	void WasDamaged(class UVitalsComponent* VitalsComp, const struct FVitalsChange& Change);
	void TickThreatList();
	void SetThreat(class AActor* Actor, int32 Threat);
	void SetIsInCombat(bool IsInCombat);
	void Server_DrawMeleeAttackFeedback(class FName SocketName, float Radius);
	void OverwriteThreatList(const struct FAIThreatList& NewThreatList);
	void Multicast_DrawMeleeAttackFeedback(class FName SocketName, float Radius);
	bool IsOnThreatList(class AActor* Actor);
	bool IsInCombat();
	bool IsAbilityActive(int32 AbilityId);
	struct FAIThreatList GetThreatList();
	int32 GetThreatCount();
	float GetSpeed(class FName Key);
	class AActor* GetHighestThreatReplicatedToClient();
	class FString GetDebugString();
	class AActor* GetClosestThreat();
	struct FAIBehaviourRanges GetBehaviourRanges();
	float GetAwarenessRadius();
	class AActor* FindTarget();
	int32 FindBestAbility(class AActor* Target, enum class EValeriaFuncResult* OutResult);
	void DeactivateAbilitiesOutOfRange(class AActor* Target);
	bool CanMoveDuringAbility();
	void AddThreat(class AActor* Actor, int32 Threat);
	void AddCharacterToThreatList(class AValeriaCharacter* Character, bool SendToTopOfThreatList);
	bool ActivateAbility(int32 AbilityId);
};

// 0xA0 (0x140 - 0xA0)
// Class Palia.AimingComponent
class UAimingComponent : public UActorComponent
{
public:
	bool                                         NeedsToReload;                                     // 0xA0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20B6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           BeginCurve;                                        // 0xA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BeginAimDuration;                                  // 0xB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ZoomedInBoomDistance;                              // 0xB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           EndCurve;                                          // 0xB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EndAimDuration;                                    // 0xC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ZoomedOutBoomDistance;                             // 0xC4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ZoomedInTargetOffset;                              // 0xC8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ZoomedInSocketOffset;                              // 0xE0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ZoomedOutTargetOffset;                             // 0xF8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ZoomedOutSocketOffset;                             // 0x110(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAimingState                      CurrentState;                                      // 0x128(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EAimingAnimationAimOffset         CurrentAnimationAimOffsetToUse;                    // 0x129(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_20B8[0xE];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USpringArmComponent*                   CameraBoom;                                        // 0x138(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAimingComponent* GetDefaultObj();

	void SetAimingState(enum class EAimingState NewState, enum class EAimingAnimationAimOffset Offset);
	void RemoveQueuedUpWeaponFire();
	void QueueUpWeaponFire();
	void NotifyEndAiming();
	void NotifyBeginAiming();
	bool IsAiming();
	bool HasQueuedUpWeaponFire();
	enum class EAimingAnimationAimOffset GetAnimationAimOffsetToUse();
	float GetAimPitchDirection();
	enum class EAimingState GetAimingState();
};

// 0x28 (0x70 - 0x48)
// Class Palia.AISenseConfig_ValeriaHearing
class UAISenseConfig_ValeriaHearing : public UAISenseConfig
{
public:
	TSubclassOf<class UAISense_ValeriaHearing>   Implementation;                                    // 0x48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultHearingRange;                               // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HearingRangeForQuietActions;                       // 0x54(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HearingRangeForNormalActions;                      // 0x58(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HearingRangeForLoudActions;                        // 0x5C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HearingRangeForStealthedActions;                   // 0x60(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StealthMask;                                       // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAISenseAffiliationFilter             DetectionByAffiliation;                            // 0x68(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_20BE[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAISenseConfig_ValeriaHearing* GetDefaultObj();

};

// 0x40 (0x68 - 0x28)
// Class Palia.AISenseEvent_ValeriaHearing
class UAISenseEvent_ValeriaHearing : public UAISenseEvent
{
public:
	struct FAIValeriaNoiseEvent                  Event;                                             // 0x28(0x40)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAISenseEvent_ValeriaHearing* GetDefaultObj();

};

// 0x60 (0xE0 - 0x80)
// Class Palia.AISense_ValeriaHearing
class UAISense_ValeriaHearing : public UAISense
{
public:
	TArray<struct FAIValeriaNoiseEvent>          NoiseEvents;                                       // 0x80(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_20C8[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAISense_ValeriaHearing* GetDefaultObj();

	void ReportValeriaNoiseEvent(class UObject* WorldContextObject, const struct FVector& NoiseLocation, class AActor* Instigator, enum class EValeriaNoiseEventVolume Volume, int32 StealthMask, class FName Tag);
};

// 0x50 (0x2F0 - 0x2A0)
// Class Palia.AkCulledComponent
class UAkCulledComponent : public USceneComponent
{
public:
	uint8                                        Pad_20D9[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkAudioEvent*                         AkAudioEvent;                                      // 0x2A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OcclusionRefreshInterval;                          // 0x2B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttenuationScalingFactor;                          // 0x2B4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutoStart;                                        // 0x2B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20DA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinUpdateTime;                                     // 0x2BC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxUpdateTime;                                     // 0x2C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DebounceDistance;                                  // 0x2C4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideCullRadius;                               // 0x2C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20DD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxCullRadius;                                     // 0x2CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxCullRadiusSquared;                              // 0x2D0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PlayingID;                                         // 0x2D4(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkComponent*                          AssociatedAkComponent;                             // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsPlaying;                                        // 0x2E0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAllowedToPlay;                                  // 0x2E1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20DF[0xE];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAkCulledComponent* GetDefaultObj();

	void Update();
	void Stop(int32 FadeDuration);
	void Start();
	void SpawnAkComponent();
	void RemoveAkComponent(int32 FadeDuration);
	float GetCullRadius();
	float GetAttenuationRadius();
};

// 0xB0 (0x340 - 0x290)
// Class Palia.AkEventDebugActor
class AAkEventDebugActor : public AActor
{
public:
	class AActor*                                FollowActor;                                       // 0x290(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkComponent*                          FollowAkComponent;                                 // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                         AkAudioEvent;                                      // 0x2A0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                    Positions;                                         // 0x2A8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_20E4[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkAudioEvent*                         AudioEvent;                                        // 0x2D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APlayerCameraManager*                  PlayerCameraManager;                               // 0x2E0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                OwningActor;                                       // 0x2E8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                          DestroyTimerHandle;                                // 0x2F0(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                          TrackingTimerHandle;                               // 0x2F8(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                          ActionTimerHandle;                                 // 0x300(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_20E6[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAkEventDebugActor* GetDefaultObj();

	void OnFinishedPlaying();
	void DestroySelf();
};

// 0x0 (0x28 - 0x28)
// Class Palia.AnimStateFunctions
class UAnimStateFunctions : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAnimStateFunctions* GetDefaultObj();

	bool IsIdle(struct FAnimState& AnimState);
	bool IsEmpty(struct FAnimState& AnimState);
};

// 0x40 (0xE0 - 0xA0)
// Class Palia.ArcadeCommandComponent
class UArcadeCommandComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnScoresReceived;                                  // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FArcadeInputState                     CurrentInputState;                                 // 0xB0(0x30)(NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UArcadeCommandComponent* GetDefaultObj();

	void SendArcadeGameCommand(const struct FArcadeGameCommand& Command);
	void RpcServer_SendArcadeGameCommand(const struct FArcadeGameCommand& Command);
	void RpcClient_SendLeaderboardScores(TArray<struct FArcadeLeaderboardEntry>& Scores);
	struct FArcadeInputState ConsumeArcadeInputState();
};

// 0x38 (0x68 - 0x30)
// Class Palia.SubgameConfig
class USubgameConfig : public UDataAsset
{
public:
	TSubclassOf<class USubgameManagerComponent>  SubgameManagerClass;                               // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USubgameInputHandlerComponent> SubgameInputHandlerClass;                          // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxNumConcurrentPlayers;                           // 0x40(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraTransitionTime;                              // 0x44(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FQuestRewardConfig>            Rewards;                                           // 0x48(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAkRtpc*                               SubgameMixRtpc;                                    // 0x58(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASubgameCutawayScene>      SubgameCutawaySceneToCreate;                       // 0x60(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class USubgameConfig* GetDefaultObj();

	bool IsSubgameValid(class FString* Error);
};

// 0x8 (0x70 - 0x68)
// Class Palia.ArcadeConfig
class UArcadeConfig : public USubgameConfig
{
public:
	struct FGameplayTag                          ArcadeMachineHighScoreTag;                         // 0x68(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UArcadeConfig* GetDefaultObj();

};

// 0x198 (0x428 - 0x290)
// Class Palia.ArcadeMachineActor
class AArcadeMachineActor : public AActor
{
public:
	TArray<struct FArcadeLeaderboardEntry>       RequiredVillagerScores;                            // 0x290(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FArcadeLeaderboardEntry>       ExtraVillagerScores;                               // 0x2A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ArcadeMachineHighScoreTag;                         // 0x2B0(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsCurrentlyPlaying;                               // 0x2B8(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2114[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                CurrentlyPlayingActor;                             // 0x2C0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                 Server_CurrentReplayId;                            // 0x2C8(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FArcadeReplicatedReplayFrameArray     Server_ReplicatedReplayFrames;                     // 0x2D8(0x128)(Net, NativeAccessSpecifierPrivate)
	struct FGuid                                 Client_CurrentReplayId;                            // 0x400(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Client_CurrentFrameIndex;                          // 0x410(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Client_ReplayInputsConsumed;                       // 0x414(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FArcadeInputState>             Client_CurrentReplayInputs;                        // 0x418(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AArcadeMachineActor* GetDefaultObj();

	bool ViewingOthersIsEnabled();
	void OnCurrentReplayInputsChanged();
	bool IsMachineLocked();
	int32 GetNumberOfReplayInputsToConsume();
	struct FGuid GetCurrentReplayGuid();
	int32 ConvertReplayGuidToSeed(const struct FGuid& Guid);
	struct FArcadeInputState ConsumeReplayInput();
	void Client_OnReplayInputReplicated();
};

// 0x68 (0x2F8 - 0x290)
// Class Palia.ArcadeMachineBase
class AArcadeMachineBase : public AActor
{
public:
	class USceneComponent*                       ArcadeMachineRootComponent;                        // 0x290(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USphereComponent*                      InteractableSphereCollider;                        // 0x298(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                      CameraComponent;                                   // 0x2A0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkComponent*                          AkComponent;                                       // 0x2A8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractableComponent*                InteractableComponent;                             // 0x2B0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USubgameActivatorComponent*            SubgameActivatorComponent;                         // 0x2B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FArcadeLeaderboardEntry>       RequiredVillagerScores;                            // 0x2C0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FArcadeLeaderboardEntry>       ExtraVillagerScores;                               // 0x2D0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FArcadeLeaderboardEntry>       LeaderboardEntries;                                // 0x2E0(0x10)(BlueprintVisible, Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                          ArcadeMachineHighScoreTag;                         // 0x2F0(0x8)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AArcadeMachineBase* GetDefaultObj();

	void SetArcadeMachineHighScoreTag(struct FGameplayTag& InGameplayTag);
	void LoadLeaderboardScores(int32 NumScoresToRetrieve);
	void AddLeaderboardScore(class AValeriaCharacter* InCharacter, int32 InScore);
	void AddLeaderboardEntryToSortedArray(TArray<struct FArcadeLeaderboardEntry>* Leaderboard, struct FArcadeLeaderboardEntry& Entry);
};

// 0x50 (0xF0 - 0xA0)
// Class Palia.SubgameManagerComponent
class USubgameManagerComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnCharacterEnteredSubgameManager;                  // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCharacterExitedSubgameManager;                   // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        CompletedScreenTime;                               // 0xC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_214E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AValeriaCharacter*                     OwningCharacter;                                   // 0xC8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AValeriaCharacter*>             PlayingCharacters;                                 // 0xD0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	enum class ESubgameState                     SubgameState;                                      // 0xE0(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_214F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USubgameConfig*                        SubgameConfig;                                     // 0xE8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class USubgameManagerComponent* GetDefaultObj();

	void TransitionToSubgameCamera(class AValeriaPlayerController* ValeriaPlayerController);
	void TransitionBackToMainCamera(class AValeriaPlayerController* ValeriaPlayerController);
	void RemoveAllCharacters(enum class ESubgameResult InSubgameResult);
	void InitializeSubgame(class USubgameConfig* InSubgameConfig, class AValeriaCharacter* CreatingCharacter);
	enum class ESubgameState GetSubgameState();
	int32 GetNumActivePlayingCharacters();
	void ExitSubgame(class AValeriaCharacter* ExitingCharacter, enum class ESubgameResult SubgameResult);
	void EnterSubgame(class AValeriaCharacter* EnteringCharacter);
	void DestroyAfterDelay();
	void CompleteSubgame();
	bool BPNE_ShouldFadeToBlackOnCameraChange();
	class AActor* BPNE_GetSubgameCameraActor();
	void BPIE_CompleteSubgame();
	void BPIE_CharacterExitedSubgame(class AValeriaCharacter* EnteringCharacter, enum class ESubgameResult SubgameResult);
	void BPIE_CharacterEnteredSubgame(class AValeriaCharacter* EnteringCharacter);
	void BPIE_BeginSubgame();
	void BeginSubgame();
};

// 0x10 (0x100 - 0xF0)
// Class Palia.ArcadeSubgameManagerComponent
class UArcadeSubgameManagerComponent : public USubgameManagerComponent
{
public:
	class UArcadeConfig*                         ArcadeConfig;                                      // 0xF0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AArcadeMachineBase*                    ManagedArcadeMachine;                              // 0xF8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UArcadeSubgameManagerComponent* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class Palia.ArraySorter
class UArraySorter : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnCompare;                                         // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<int32>                                SortedIndices;                                     // 0x38(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         PreviousCompareResult;                             // 0x48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_215B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UArraySorter* GetDefaultObj();

	void Sort(int32 NumberOfElements);
	void SetCompareResult(bool IsLeftLessThanRight);
};

// 0x0 (0xA0 - 0xA0)
// Class Palia.AudioFoliageManagerComponent
class UAudioFoliageManagerComponent : public UActorComponent
{
public:

	static class UClass* StaticClass();
	static class UAudioFoliageManagerComponent* GetDefaultObj();

	TArray<struct FVector> SortVectorsByClosest(const TArray<struct FVector>& Vectors, const struct FVector& Center);
};

// 0x50 (0x80 - 0x30)
// Class Palia.AudioFoliageRustleDataAsset
class UAudioFoliageRustleDataAsset : public UPrimaryDataAsset
{
public:
	TMap<TSoftObjectPtr<class UStaticMesh>, class UAkAudioEvent*> RustleAudioByMesh;                                 // 0x30(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAudioFoliageRustleDataAsset* GetDefaultObj();

};

// 0x58 (0x88 - 0x30)
// Class Palia.AudioManager
class UAudioManager : public UGameInstanceSubsystem
{
public:
	uint8                                        Pad_2177[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, class AAkEventDebugActor*>       AudioDebugActors;                                  // 0x38(0x50)(NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAudioManager* GetDefaultObj();

	void UnregisterDebugActor(int32 PlayingID);
	void SetDebugDisplayStatus(bool bShowDebugInfo);
	void SetDebugDisplayOutOfRange(bool bShowDebugInfo);
	void OnAAkEventDebugActorDestroyed(class AActor* Actor);
};

// 0xD0 (0x100 - 0x30)
// Class Palia.AuthManager
class UAuthManager : public ULocalPlayerSubsystem
{
public:
	FMulticastInlineDelegateProperty_            LoggedIn;                                          // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            SignedInAsCharacter;                               // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            LogInFailure;                                      // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            RegisterSuccess;                                   // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            RegisterFailure;                                   // 0x70(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            LoginResetStatusDelegate;                          // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            LinkedSuccess_PF;                                  // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            LinkedFailure_PF;                                  // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnJWTTokenRefreshCompleted;                        // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_21B8[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAuthManager* GetDefaultObj();

	void StartRegisterUser(const struct FValeriaUserDTO& NewUserDTO);
	void StartLoginResetUser(const struct FValeriaUserDTO& LoginData);
	void StartLogin();
	void StartLink(bool bUseHeadlessAccount);
	void SetPassword(const class FString& Password);
	void SetAccountUsername(const class FString& AccountUsername);
	void QuickRegisterUser(const class FString& NewUserName);
	void OnJWTTokenRefreshCompleted__DelegateSignature(bool bSucceeded, int32 ErrorCode);
	void LoginResetHandler(int32 ForLocalUserNum, bool bWasSuccessful, const struct FValeriaUserDTO& ResultsData);
	bool IsLoggedIn();
	bool HasValidJWT();
	void HandleRegisterAccountSucceeded(int32 ForLocalUserNum, struct FValeriaUserDTO& NewUser);
	void HandleRegisterAccountFailed(int32 ForLocalUserNum, class FText& ErrorMessage);
	void HandleOnPlatformLoggedIn(int32 ForLocalUserNum, bool WasSuccessful, const struct FGuid& InAccountId, const class FString& InAccountUsername, const class FString& ErrorMessage, int32 ErrorCode);
	void HandleOnCharacterSelected(struct FOSSVAL_SelectedCharacter& SelectedCharacter);
	int32 GetValidJWTTokenErrorCode();
	struct FUniqueNetIdRepl GetNetId();
	class FString GetCharacterName();
	struct FGuid GetCharacterId();
	class FString GetAccountUsername();
	struct FGuid GetAccountId();
	class FString GenerateRandomUserName();
	void FakeLogin(int32 LocalUserNum, const class FString& AccountUsername, const class FString& CharacterName);
	void ChangeCharacter(const class FString& CharacterName, const class FString& Nickname);
};

// 0x128 (0x1C8 - 0xA0)
// Class Palia.VAL_BingoBoardgamePlayerComponent
class UVAL_BingoBoardgamePlayerComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnBingoBoardgameDataUpdated;                       // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        DataStalenessThresholdSeconds;                     // 0xB0(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_21FC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UBingoBoardgamesConfiguration> CurrentConfigurationSoftReference;                 // 0xB8(0x30)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBingoBoardgamesConfiguration*         CurrentConfiguration;                              // 0xE8(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVAL_BingoBoardgameReplicatedState    BingoBoardgameReplicatedState;                     // 0xF0(0x80)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	TMap<struct FGuid, struct FVAL_OnContributeBingoItemsDelegates> ContributeItemsRequestIdToResponseDelegatesMap;    // 0x170(0x50)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_21FF[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UVAL_BingoBoardgamePlayerComponent* GetDefaultObj();

	bool TryGetBingoBoardgameData(struct FBingoBoardTemplateData* OutBingoBoardTemplate, struct FBingoBoardgameState* OutBingoBoardgameState, bool bAllowFetch);
	void ServerMakeRequest_ContributeItems(int32 BingoCellIndex, TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType, int32 Quantity, const struct FGuid& RequestId);
	void ServerFetchBingoBoardData();
	void OnRep_BingoBoardgameReplicatedState();
	void OnBingoBoardgameDataUpdated__DelegateSignature(class UVAL_BingoBoardgamePlayerComponent* BingoBoardgamePlayerComponent);
	void HandlePlayerStateIdentityInitialized(class AVAL_PlayerState* PlayerState);
	void FetchBingoBoardData();
	void ContributeItems(int32 BingoCellIndex, TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType, int32 Quantity, FDelegateProperty_& OnSuccess, FDelegateProperty_& OnFailure);
	void ClientReceiveResponse_ContributeItems_Success(const struct FGuid& RequestId, TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType, int32 BingoCellIndex, int32 UpdatedTotal, int32 ContributedQuantity);
	void ClientReceiveResponse_ContributeItems_Failure(const struct FGuid& RequestId, class FText& ErrorMessage);
};

// 0x10 (0x40 - 0x30)
// Class Palia.BingoBoardgamesConfiguration
class UBingoBoardgamesConfiguration : public UDataAsset
{
public:
	TArray<struct FBingoBoardTemplateData>       BingoBoards;                                       // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBingoBoardgamesConfiguration* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Palia.VAL_BingoBoardgameBlueprintFunctionLibrary
class UVAL_BingoBoardgameBlueprintFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UVAL_BingoBoardgameBlueprintFunctionLibrary* GetDefaultObj();

	bool TryGetBingoCellFromTemplateByIndex(struct FBingoBoardTemplateData& Template, int32 Index, struct FBingoBoardGridCellTemplate* OutBingoCell);
	bool TryGetBingoCellFromTemplateByCartesian(struct FBingoBoardTemplateData& Template, int32 ColumnIndex, int32 RowIndex, struct FBingoBoardGridCellTemplate* OutBingoCell);
	bool TryGetBingoCellFromBoardgameStateByIndex(struct FBingoBoardgameState& BoardgameState, int32 Index, int32* OutProgress);
	bool TryGetBingoCellFromBoardgameStateByCartesian(struct FBingoBoardgameState& BoardgameState, int32 ColumnIndex, int32 RowIndex, int32* OutProgress);
	bool IsBillboardQuestsFeatureEnabled();
	int32 GetBingoCellIndexFromCartesian(int32 ColumnIndex, int32 RowIndex);
	void GetBingoCellCartesianFromIndex(int32 Index, int32* OutColumnIndex, int32* OutRowIndex);
	int32 GetBingoBoardSquareSize();
	int32 GetBingoBoardLinearArraySize();
};

// 0x58 (0xF8 - 0xA0)
// Class Palia.BookReadingComponent
class UBookReadingComponent : public UActorComponent
{
public:
	uint8                                        Pad_223B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBookReadingPersistBlock              BookReadingPersistBlock;                           // 0xA8(0x50)(Net, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBookReadingComponent* GetDefaultObj();

};

// 0x0 (0x98 - 0x98)
// Class Palia.BTTaskCreatureMoveForward
class UBTTaskCreatureMoveForward : public UBTTask_BlackboardBase
{
public:

	static class UClass* StaticClass();
	static class UBTTaskCreatureMoveForward* GetDefaultObj();

};

// 0x10 (0x80 - 0x70)
// Class Palia.BTTask_CreatureBecomeAware
class UBTTask_CreatureBecomeAware : public UBTTaskNode
{
public:
	float                                        NavigationCheckRadius;                             // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        JumpImpulseStrength;                               // 0x74(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        Duration;                                          // 0x78(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MovementDuration;                                  // 0x7C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_CreatureBecomeAware* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class Palia.BTTask_CreatureDespawn
class UBTTask_CreatureDespawn : public UBTTask_BlackboardBase
{
public:
	float                                        DespawnDuration;                                   // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2248[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_CreatureDespawn* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Palia.BTTask_CreatureDie
class UBTTask_CreatureDie : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_CreatureDie* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class Palia.BTTask_CreatureEscape
class UBTTask_CreatureEscape : public UBTTask_BlackboardBase
{
public:
	float                                        NavAcceptanceRadius;                               // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bReachTestIncludesAgentRadius;                     // 0x9C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bReachTestIncludesGoalRadius;                      // 0x9D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_224E[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_CreatureEscape* GetDefaultObj();

};

// 0x38 (0xD0 - 0x98)
// Class Palia.BTTask_CreatureEvade
class UBTTask_CreatureEvade : public UBTTask_BlackboardBase
{
public:
	float                                        PathRefreshFrequency;                              // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MinimumTimeToEvade;                                // 0x9C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaximumTimeToEvade;                                // 0xA0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DistanceFromThreatsToStopEvading;                  // 0xA4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        PathDistanceToCompleteOnStopEvading;               // 0xA8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        InitialDirectionAngleNoise;                        // 0xAC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SubsequentAngleInterval;                           // 0xB0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MinimumEvadeTimeAfterTeleport;                     // 0xB4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MinimumViablePathDistance;                         // 0xB8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TargetPathDistance;                                // 0xBC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MinPauseTimeAfterEvadePathComplete;                // 0xC0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxPauseTimeAfterEvadePathComplete;                // 0xC4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        NavAcceptanceRadius;                               // 0xC8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bReachTestIncludesAgentRadius;                     // 0xCC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bReachTestIncludesGoalRadius;                      // 0xCD(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2256[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_CreatureEvade* GetDefaultObj();

};

// 0x0 (0x98 - 0x98)
// Class Palia.BTTask_CreatureHitReact
class UBTTask_CreatureHitReact : public UBTTask_BlackboardBase
{
public:

	static class UClass* StaticClass();
	static class UBTTask_CreatureHitReact* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Palia.BTTask_CreatureStunned
class UBTTask_CreatureStunned : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_CreatureStunned* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Palia.BTTask_CreatureWander
class UBTTask_CreatureWander : public UBTTaskNode
{
public:
	float                                        WanderRadius;                                      // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2268[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_CreatureWander* GetDefaultObj();

};

// 0x8 (0xA0 - 0x98)
// Class Palia.BTTask_PerformAbility
class UBTTask_PerformAbility : public UBTTask_BlackboardBase
{
public:
	int32                                        AbilityIndexToPerform;                             // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AbilityCooldown;                                   // 0x9C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_PerformAbility* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Palia.BTTask_ReturnToIdle
class UBTTask_ReturnToIdle : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_ReturnToIdle* GetDefaultObj();

};

// 0x10 (0x88 - 0x78)
// Class Palia.BTTask_WaitCustom
class UBTTask_WaitCustom : public UBTTask_Wait
{
public:
	TArray<float>                                AllowedWaitTimes;                                  // 0x78(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_WaitCustom* GetDefaultObj();

};

// 0xA8 (0x148 - 0xA0)
// Class Palia.BuffComponent
class UBuffComponent : public UActorComponent
{
public:
	uint8                                        Pad_2296[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnChanged;                                         // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnStarted;                                         // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintAuthorityOnly, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnStopped;                                         // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintAuthorityOnly, NativeAccessSpecifierPublic)
	TArray<struct FBuffActivation>               ActiveBuffs;                                       // 0xD8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                        Pad_229A[0x60];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuffComponent* GetDefaultObj();

	void RpcServer_ForceRemoveBuffInstance(int32 BuffInstanceId);
	void RpcServer_CheatClearAllBuffs();
	bool RemoveBuffInstance(int32 InstanceId);
	bool RemoveBuffByConfig(int32 BuffConfigId);
	void OnReplicatedAndShouldBroadcast();
	float GetPercentUsedFromActivation(struct FBuffActivation& BuffActivation);
	float GetPercentUsed(int32 InstanceId);
	int32 GetInstanceId(int32 BuffConfigId);
	float GetEffectQuantifier(enum class EBuffEffect Effect);
	void Client_ForceRemoveBuffInstance(int32 BuffInstanceId);
	bool BuffIsActive(int32 InstanceId);
	int32 ApplyEffectQuantifier(enum class EBuffEffect Effect, int32 Base);
	int32 AddBuff(int32 BuffConfigId);
};

// 0x0 (0x30 - 0x30)
// Class Palia.BuffGroupConfig
class UBuffGroupConfig : public UDataAsset
{
public:

	static class UClass* StaticClass();
	static class UBuffGroupConfig* GetDefaultObj();

};

// 0x68 (0x98 - 0x30)
// Class Palia.BugReportSubsystem
class UBugReportSubsystem : public ULocalPlayerSubsystem
{
public:
	FMulticastInlineDelegateProperty_            OnFailedToReportBug;                               // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_22A3[0x58];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBugReportSubsystem* GetDefaultObj();

	void ReportBug(const class FString& Summary);
};

// 0x68 (0x108 - 0xA0)
// Class Palia.BundlesComponent
class UBundlesComponent : public UActorComponent
{
public:
	uint8                                        Pad_2310[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            BundleCompletedDel;                                // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FBundlePersistBlock                   BundlePersistBlock;                                // 0xB8(0x50)(Net, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBundlesComponent* GetDefaultObj();

	void RpcServer_RemoveAndApplyBundleItems(TSoftObjectPtr<class UBundleShrineConfig>& bundleConfigPtr, int32 SubBundleId, TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType, int32 Amount);
	void RpcServer_InitializeBundle(int32 BundleConfigId, int32 SubBundleConfigId);
	void RpcServer_GrantSubBundleRewards(TSoftObjectPtr<class UBundleShrineConfig>& bundleConfigPtr, int32 SubBundleId);
	void RpcServer_GrantBundleRewards(TSoftObjectPtr<class UBundleShrineConfig>& bundleConfigPtr);
	void RpcClient_BundleCompleted();
	bool IsSubBundleRewardGranted(int32 BundleID, int32 SubBundleId);
	bool IsSubBundleRequirementComplete(int32 BundleID, int32 SubBundleId, int32 RequirementId);
	bool IsSubBundleComplete(int32 BundleID, int32 SubBundleId);
	bool IsBundleRewardGranted(int32 BundleID);
	bool IsBundleComplete(int32 BundleID);
	int32 GetSubmittedItemCount(int32 BundleID, int32 SubBundleId, int32 RequirementId);
	int32 GetSubBundleRequirementCompletedCount(int32 BundleID, int32 SubBundleId);
	bool Client_RemoveAndApplyBundleItems(TSoftObjectPtr<class UBundleShrineConfig>& bundleConfigPtr, int32 SubBundleId, TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType, int32 Amount, enum class EValeriaFuncResult* OutResult);
	void Client_InitializeBundle(int32 BundleConfigId, int32 SubBundleConfigId);
	bool Client_GrantSubBundleRewards(TSoftObjectPtr<class UBundleShrineConfig>& bundleConfigPtr, int32 SubBundleId, enum class EValeriaFuncResult* OutResult);
	bool Client_GrantBundleRewards(TSoftObjectPtr<class UBundleShrineConfig>& bundleConfigPtr, enum class EValeriaFuncResult* OutResult);
};

// 0x38 (0x68 - 0x30)
// Class Palia.BundleShrineConfig
class UBundleShrineConfig : public UDataAsset
{
public:
	int32                                        PersistId;                                         // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2316[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                BundleName;                                        // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FQuestRewardConfig>            BundleRewards;                                     // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSubBundleShrineConfig>        SubBundles;                                        // 0x58(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBundleShrineConfig* GetDefaultObj();

};

// 0x38 (0xD8 - 0xA0)
// Class Palia.BundleVaultComponent
class UBundleVaultComponent : public UActorComponent
{
public:
	uint8                                        Pad_2332[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBundleShrineConfig*                   BundleConfig;                                      // 0xA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  InteractText;                                      // 0xB0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FPersistentTagWriteback>       PlayerTagWritebackOnInteract;                      // 0xC8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBundleVaultComponent* GetDefaultObj();

	struct FServerUseEventResult OnServerInteract(class UInteractableComponent* Interactable, class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams);
	struct FUseEventResult OnClientInteract(class UInteractableComponent* Interactable, class AValeriaPlayerController* Player, const struct FInteractEventParams& EventParams);
	bool IsInteractable(class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams);
	bool GetText(class AValeriaCharacter* Character, enum class EInteractEventIndex EventIndex, struct FGetTextParams* Params);
};

// 0x10 (0xB0 - 0xA0)
// Class Palia.BurstNetSpeedComponent
class UBurstNetSpeedComponent : public UActorComponent
{
public:
	int32                                        BurstNetSpeed;                                     // 0xA0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BurstNetSpeedDuration;                             // 0xA4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2336[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBurstNetSpeedComponent* GetDefaultObj();

	void DisableBurstOfNetSpeed();
};

// 0x10 (0x2A0 - 0x290)
// Class Palia.CameraTargetActor
class ACameraTargetActor : public AActor
{
public:
	class USpringArmComponent*                   CameraBoom;                                        // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraComponent*                      FollowCamera;                                      // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ACameraTargetActor* GetDefaultObj();

};

// 0x60 (0x100 - 0xA0)
// Class Palia.CameraTargetComponent
class UCameraTargetComponent : public UActorComponent
{
public:
	class ACameraTargetActor*                    CameraActor;                                       // 0xA0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCameraTarget                         Target;                                            // 0xA8(0x30)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FTimerHandle                          RefreshTargetsTimerHandle;                         // 0xD8(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_233F[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraTargetComponent* GetDefaultObj();

	class AActor* GetTarget();
	void Client_TurnAtRate(float Rate);
	void Client_Turn(float Rate);
	void Client_LookUpAtRate(float Rate);
	void Client_LookUp(float Rate);
};

// 0x18 (0xB8 - 0xA0)
// Class Palia.CapsuleCollisionOverrideComponent
class UCapsuleCollisionOverrideComponent : public UActorComponent
{
public:
	class UCapsuleComponent*                     OwnerCapsule;                                      // 0xA0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  CollisionProfileOriginal;                          // 0xA8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  CollisionProfileOverride;                          // 0xB0(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCapsuleCollisionOverrideComponent* GetDefaultObj();

	void OnReplicatedNotify();
};

// 0x100 (0x148 - 0x48)
// Class Palia.ChallengeConfig
class UChallengeConfig : public UGuidDataAsset
{
public:
	class FText                                  DisplayName;                                       // 0x48(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  DisplayText;                                       // 0x60(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLootRequirements                     Requirements;                                      // 0x78(0xB0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FVillagerQuestRequirement>     Goals;                                             // 0x128(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FQuestRewardConfig>            Rewards;                                           // 0x138(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UChallengeConfig* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Palia.ChallengesSubsystem
class UChallengesSubsystem : public UGameInstanceSubsystem
{
public:

	static class UClass* StaticClass();
	static class UChallengesSubsystem* GetDefaultObj();

	struct FTimespan GetTimeTillExpiration(class UObject* Context);
	void GetDisplayInfo(class AValeriaCharacter* Character, TArray<struct FChallengeDisplayInfo>* Infos);
};

// 0x0 (0x580 - 0x580)
// Class Palia.CreatureSpawnBoxComponent
class UCreatureSpawnBoxComponent : public UBoxComponent
{
public:

	static class UClass* StaticClass();
	static class UCreatureSpawnBoxComponent* GetDefaultObj();

};

// 0x128 (0x3B8 - 0x290)
// Class Palia.ChapaaChaseManager
class AChapaaChaseManager : public AActor
{
public:
	FMulticastInlineDelegateProperty_            OnChapaaChaseStateChange;                          // 0x290(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnChapaaChaseCurrentGameChange;                    // 0x2A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnChapaaChaseParticipantChange;                    // 0x2B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FCreatureSpawnEntry>           CreatureSpawnConfig;                               // 0x2C0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        MaxRunTimeSeconds;                                 // 0x2D0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseCaptureGoal;                                   // 0x2D4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23B2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GoalCapturesPerPlayer;                             // 0x2D8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SpawnWaveIntervalSeconds;                          // 0x2DC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinWaveCreatureSpawn;                              // 0x2E0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxWaveCreatureSpawn;                              // 0x2E4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CreatureSpawnPerPlayer;                            // 0x2E8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LimitCreaturesPerPlayer;                           // 0x2EC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxLimitCreatures;                                 // 0x2F0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InitialDelay;                                      // 0x2F4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxCreaturesHeld;                                  // 0x2F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23B7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurrencyConfig*                       CurrencyToAward;                                   // 0x300(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GameStartTimestamp;                                // 0x308(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23B8[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UVAL_ItemTypeDefinitionAsset*          TempCreatureItemToEquip;                           // 0x318(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EChappaChaseState                 CurrentState;                                      // 0x320(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_23BA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBoxComponent*                         PlayerParticipationBox;                            // 0x328(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCreatureSpawnBoxComponent*            DefaultSpawnBox;                                   // 0x330(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBillboardComponent*                   RootBillboard;                                     // 0x338(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bOverridePlayerCount;                              // 0x340(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_23BE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        OverridePlayerCount;                               // 0x344(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_23C1[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FChapaaChaseParticipant>       CurrentParticipantInfo;                            // 0x380(0x10)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)
	TArray<class ACreatureCharacter*>            SpawnedCreatures;                                  // 0x390(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_23C4[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CurrentGameCaptureGoal;                            // 0x3A8(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CurrentGameCaptureCount;                           // 0x3AC(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CurrentGameScore;                                  // 0x3B0(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bPreviousGameSuccess;                              // 0x3B4(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_23C9[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AChapaaChaseManager* GetDefaultObj();

	void TryDropCreatures(class AValeriaPlayerController* Player);
	bool Stop();
	bool Start();
	void SetState(enum class EChappaChaseState NewState);
	void SetEnableSpawning(bool bEnable);
	bool PickUpCreature(class AValeriaPlayerController* Player, class ACreatureCharacter* Creature);
	void OnRep_CurrentState(enum class EChappaChaseState OldState);
	void OnRep_CurrentParticipantInfo();
	void OnRep_CurrentGameInfo();
	bool IsReadyToPlay();
	bool IsPlayerParticipating(const struct FChapaaChaseParticipant& Player);
	bool IsInProgress();
	void Initialize();
	void HandleParticipationBoxEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void HandleParticipationBoxBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void HandleCreatureDestroyed(class AActor* DestroyedActor);
	enum class EChappaChaseState GetState();
	bool GetPreviousGameSuccess();
	bool GetParticipantInfo(class AValeriaPlayerController* Player, struct FChapaaChaseParticipant* OutParticipantInfo);
	int32 GetParticipantCreatureHeldCount(class AValeriaPlayerController* InPlayer);
	int32 GetCurrentGameScore();
	int32 GetCurrentGameCaptureGoal();
	int32 GetCurrentGameCaptureCount();
	int32 GetCreatureCaptureValue(TSubclassOf<class ACreatureCharacter> InCreatureClass);
	TArray<struct FChapaaChaseParticipant> GetAllParticipantsSorted();
	TArray<struct FChapaaChaseParticipant> GetAllParticipants();
	int32 CaptureCreatures(class AValeriaPlayerController* Player);
	bool CanPickUpCreature(class AValeriaPlayerController* Player, class ACreatureCharacter* Creature);
};

// 0x28 (0x50 - 0x28)
// Class Palia.CharacterCustomizationItemConfig
class UCharacterCustomizationItemConfig : public UObject
{
public:
	uint8                                        Pad_2401[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ECustomizationItemSlot            ItemSlot;                                          // 0x2C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2402[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMesh*                         Mesh;                                              // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsBasicItem;                                       // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2406[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                Weights;                                           // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCharacterCustomizationItemConfig* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Palia.ValeriaItemConfigBlueprintFunctions
class UValeriaItemConfigBlueprintFunctions : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UValeriaItemConfigBlueprintFunctions* GetDefaultObj();

	class UCharacterCustomizationItemConfig* FromTorsoConfig(class UObject* Context, const struct FCharacterCustomizationTorsoConfig& TorsoConfig);
	class UCharacterCustomizationItemConfig* FromLegsConfig(class UObject* Context, const struct FCharacterCustomizationLegsConfig& LegsConfig);
	class UCharacterCustomizationItemConfig* FromFullBodyConfig(class UObject* Context, const struct FCharacterCustomizationFullBodyConfig& FullBodyConfig);
};

// 0xE0 (0x110 - 0x30)
// Class Palia.CharacterCustomManager
class UCharacterCustomManager : public ULocalPlayerSubsystem
{
public:
	FMulticastInlineDelegateProperty_            CharacterCreated;                                  // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            CharacterUpdated;                                  // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            CharacterDeleted;                                  // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            CharactersReceived;                                // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            CharacterReceived;                                 // 0x70(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            CharactersReceivedFailed;                          // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRefreshedAllOurCharacters;                       // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCharacterRenderStudioRegistered;                 // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_243F[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AVAL_CharacterRenderStudio*            CharacterRenderStudio;                             // 0xE0(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVAL_CharacterCustomization_ColorsDataAsset* ColorsDataAsset;                                   // 0xE8(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UObject*>                       CachedCharacterCustomizationSettingsObjects;       // 0xF0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2441[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCharacterCustomManager* GetDefaultObj();

	void UpdateCharacter(const struct FVALDTOS_MetaCharacterFormat& CharacterData);
	bool TryGetAllOurCharacters(TArray<struct FVALDTOS_MetaCharacterFormat>* OutOurCharacters);
	void OnRegisterCharacter_Successful__DelegateSignature(const class FString& CharacterName);
	void OnRegisterCharacter_Failure__DelegateSignature(class FText ErrorMessage, int32 ErrorCode);
	void OnRefreshedAllOurCharacters__DelegateSignature(class UCharacterCustomManager* CharacterCustomManager);
	void OnCharacterRenderStudioRegistered__DelegateSignature(class AVAL_CharacterRenderStudio* Studio);
	class UVAL_CharacterCustomization_ColorsDataAsset* GetColorsDataAsset();
	class AVAL_CharacterRenderStudio* GetCharacterRenderStudio();
};

// 0x40 (0xE0 - 0xA0)
// Class Palia.CharacterStateChangeInteraction
class UCharacterStateChangeInteraction : public UActorComponent
{
public:
	uint8                                        Pad_2482[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimState                            AnimState;                                         // 0xA8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	enum class ECharacterState                   CharacterState;                                    // 0xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2483[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Text;                                              // 0xC8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCharacterStateChangeInteraction* GetDefaultObj();

	struct FServerUseEventResult OnServerInteract(class UInteractableComponent* Interactable, class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams);
	bool IsInteractable(class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams);
	int32 InteractPriority();
	bool GetText(class AValeriaCharacter* Character, enum class EInteractEventIndex EventIndex, struct FGetTextParams* Params);
	bool CheckCanGather(class AValeriaCharacter* Character);
};

// 0x120 (0x1C0 - 0xA0)
// Class Palia.CharacterStateMachineComponent
class UCharacterStateMachineComponent : public UActorComponent
{
public:
	uint8                                        Pad_24F5[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCharacterStateChanged;                           // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnExitingCharacterState;                           // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEnteredCharacterState;                           // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AValeriaCharacter*                     CachedCharacter;                                   // 0xD8(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UValeriaCharacterMoveComponent*        CachedMovement;                                    // 0xE0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_24F7[0xC8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class ECharacterState>           CurrentStateStack;                                 // 0x1B0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCharacterStateMachineComponent* GetDefaultObj();

	bool UseEquippedInputEnabled(bool Inward, bool Pressed);
	void ToggleState(enum class ECharacterState StateTypeToToggle, const struct FCharacterStateChangeParams& Params);
	bool StartPlacementInputIsEnabled();
	bool ShouldHideInventoryToolbar();
	void RpcServer_ChangeMovementMode(enum class ECharacterMoveMode Mode);
	void RpcClient_ToggleState(enum class ECharacterState State, const struct FCharacterStateChangeParams& Params);
	void RpcClient_RevertToWorldState();
	void RpcClient_EndState(enum class ECharacterState State, const struct FCharacterStateChangeParams& Params);
	void RpcClient_ChangeState(enum class ECharacterState State, const struct FCharacterStateChangeParams& Params);
	void RevertToWorldState();
	bool PlacementInputIsEnabled();
	void OnExitingCharacterState__DelegateSignature(class UCharacterStateMachineComponent* Csm, struct FCharacterStateChangeParams& Params, enum class ECharacterState StateBeingExited, enum class ECharacterState StateBeingEntered);
	void OnEnteredCharacterState__DelegateSignature(class UCharacterStateMachineComponent* Csm, struct FCharacterStateChangeParams& Params, TArray<enum class ECharacterState>& StatesExited, enum class ECharacterState StateEntered);
	void OnControllerAttachedToCharacter(class AValeriaPlayerController* Player, class AValeriaCharacter* Character);
	enum class EMovementRelativeTo MovementRelativeTo();
	bool MovementByInputIsEnabled();
	bool JumpByInputIsEnabled();
	bool IsOnStack(enum class ECharacterState State);
	bool IsEquippedHidden();
	enum class ECharacterState GetCurrentStateType();
	bool FishingInputIsEnabled();
	void EndState(enum class ECharacterState StateTypeToEnd, const struct FCharacterStateChangeParams& Params);
	bool CustomCameraControl();
	bool ChangeState(enum class ECharacterState NewState, const struct FCharacterStateChangeParams& Params);
	bool CanTriggerAbility();
	bool CanTransitionTo(enum class ECharacterState State);
	bool CanSprint();
	bool CanChangeActionBar();
	bool AllowDashCancelling();
};

// 0x270 (0x2A0 - 0x30)
// Class Palia.ChatManager
class UChatManager : public ULocalPlayerSubsystem
{
public:
	FMulticastInlineDelegateProperty_            OnRequestOpenChannel;                              // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSessionConnected;                                // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSessionDisconnected;                             // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnNewChatMessage;                                  // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnNewControlMessage;                               // 0x70(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnReceivedValeriagram;                             // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCharacterMuted;                                  // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPlayerMuted;                                     // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRequestDisplayChatError;                         // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRequestDisplayChatUnreachable;                   // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRequestDisplayChatRetryLogin;                    // 0xD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRequestActivateChat;                             // 0xE0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRequestInactiveChat;                             // 0xF0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRequestInpurBarChangeMessageTarget;              // 0x100(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRequestInputBarInsertText;                       // 0x110(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDisplayReconnectChat;                            // 0x120(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPermissionsChanged;                              // 0x130(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_25AB[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          ReconnectTimerHandle;                              // 0x180(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25AC[0x118];                                   // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChatManager* GetDefaultObj();

	void ValChat_OnDisplayReconnectChat__DelegateSignature(bool bReconnecting, const class FString& ErrorMsg);
	void SessionConnectionFailureHandler(const class FString& Error);
	void SendValeriagram(class UVAL_ValeriagramPost* ValeriagramPost);
	void SendValeriaChatMessage(const struct FValeriaChatMessage& ChatMessage);
	void SendControlMessage(const struct FMessageTarget& MessageTarget, const struct FControlMessage& ControlMessage);
	void SendChatNotification(const struct FMessageTarget& MessageTarget, const class FString& NotificationContent);
	void SendChatMessage(const struct FMessageTarget& MessageTarget, const class FString& HumanMessage);
	void SendChatImage(const struct FMessageTarget& MessageTarget, class UTextureRenderTarget2D* ImageTexture);
	void RequestOpenChannel(struct FMessageTarget& MessageTarget);
	void RequestMuteUser_New(bool bMute, struct FUniqueNetIdRepl& PlayerNetId, const class FString& CharacterName);
	void RequestMuteUser(bool bMute, class FName& CharacterName);
	void RemoveChatPermission(enum class EVAL_ChatPermissions Permission);
	void OnRequestOpenChannel__DelegateSignature(const struct FMessageTarget& MessageTarget);
	void OnRequestInputBarInsertText__DelegateSignature(class FText& Text);
	void OnRequestInputBarChangeMessageTarget__DelegateSignature(const struct FMessageTarget& MessageTarget);
	void OnRequestInactivateChat__DelegateSignature();
	void OnRequestDisplayChatUnreachable__DelegateSignature(class FText ErrorText);
	void OnRequestDisplayChatRetryLogin__DelegateSignature(class FText ErrorText);
	void OnRequestDisplayChatErrorMessage__DelegateSignature(class FText ErrorText);
	void OnRequestActivateChat__DelegateSignature();
	void OnPlayerMuted__DelegateSignature(const struct FUniqueNetIdRepl& PlayerNetId, bool bMuted);
	void OnChatPermissionsChanged__DelegateSignature(enum class EVAL_ChatPermissions Permissions);
	void OnCharacterMuted__DelegateSignature(class FName CharacterName, bool bMuted);
	int32 MaximumCharacterLimit();
	void JoinRoom(const class FString& RoomId);
	bool IsUserMuted_New(struct FUniqueNetIdRepl& PlayerNetId);
	bool IsUserMuted(class FName& CharacterName);
	bool IsReconnectingToChat();
	bool IsConnected();
	bool HasChatPermission(enum class EVAL_ChatPermissions Permission);
	void HandlePlayerGuildChanged(class UVAL_PlayerGuildSubsystem* PlayerGuildSubsystem, const struct FGuid& NewGuildId);
	void HandleOnVivoxLoginFailed(int32 ErrorCode, const class FString& ErrorMsg);
	void HandleOnVivoxLoggedIn();
	void HandleOnSignedInAsCharacter(const class FString& CharacterName, int32 LocalUserNum, const struct FGuid& CharacterId);
	void HandleOnServerIdChanged(const class FString& ID);
	void HandleOnPawnChanged(class APawn* Pawn);
	void HandleOnPartyStateChanged(enum class EVAL_PartyManagerState State);
	void HandleOnDirectMsgReceived(struct FS6Vivox_TextMsg& Msg);
	void HandleOnChannelMsgReceived(struct FS6Vivox_ChannelTextMsg& Msg);
	class FString GetServerName();
	TArray<class FString> GetJoinedRoomList();
	enum class EVAL_ChatPermissions GetChatPermissionFlags();
	class FString GetChatErrorMsg();
	void EchoValeriaChatMessage(const struct FValeriaChatMessage& ChatMessage);
	void EchoChatNotificationToSelf(const class FString& Message);
	void EchoChatNotification(const struct FMessageTarget& MessageTarget, const class FString& NotificationContent);
	void ChatSessionReadyHandler();
	class UTexture2D* ChatImageTextureFromBufferString(const class FString& ImageData);
	void AddChatPermission(enum class EVAL_ChatPermissions Permission);
};

// 0x88 (0xD0 - 0x48)
// Class Palia.CheatSetConfig
class UCheatSetConfig : public UGuidDataAsset
{
public:
	bool                                         bRepeatable;                                       // 0x48(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25B5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FPersistentTagWriteback>       PlayerTagWritebacks;                               // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FValeriaItem>                  ItemsToGive;                                       // 0x60(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataTableRowHandle>           VillagersToMarkAsMet;                              // 0x70(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UVAL_QuestDef*>                 QuestsToGrant;                                     // 0x80(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UVAL_QuestDef*>                 QuestsToComplete;                                  // 0x90(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UPrivateSpaceVillagerVisitConfig*> HousingPlotVillagerVisitsToGrant;                  // 0xA0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UPrivateSpaceVillagerVisitConfig*> HousingPlotVillagerVisitsToComplete;               // 0xB0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FQuestRewardConfig>            AdditionalRewards;                                 // 0xC0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCheatSetConfig* GetDefaultObj();

};

// 0x88 (0x128 - 0xA0)
// Class Palia.ConfigurableTriggerVolume
class UConfigurableTriggerVolume : public UActorComponent
{
public:
	struct FTimeOfDayFilter                      TimeOfDayRequirement;                              // 0xA0(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                        TimeInsideVolumeRequired;                          // 0xB8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25BC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVillagerQuestProgressSubConfig> RequiredQuestProgress;                             // 0xC0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FQuestActivityPrereq>          RequiredQuestActivity;                             // 0xD0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataTableRowHandle>           RequiredVillagersInVolume;                         // 0xE0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPersistentTagFilter>          PlayerTagRequirements;                             // 0xF0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPersistentTagWriteback>       PlayerTagWriteback;                                // 0x100(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         RevertWritebackOnExit;                             // 0x110(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ApplyToVillagers;                                  // 0x111(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25BF[0x16];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConfigurableTriggerVolume* GetDefaultObj();

	void ActorEndOverlap(class AActor* MyActor, class AActor* OtherActor);
	void ActorBeginOverlap(class AActor* MyActor, class AActor* OtherActor);
};

// 0x20 (0x58 - 0x38)
// Class Palia.ValeriaContainerHashesConfig
class UValeriaContainerHashesConfig : public UDeveloperSettings
{
public:
	TArray<struct FValeriaContainerHash>         CharacterContainerHashes;                          // 0x38(0x10)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FValeriaContainerHash>         HousingContainerHashes;                            // 0x48(0x10)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValeriaContainerHashesConfig* GetDefaultObj();

};

// 0xC8 (0xF8 - 0x30)
// Class Palia.CookingSubsystem
class UCookingSubsystem : public UGameInstanceSubsystem
{
public:
	FMulticastInlineDelegateProperty_            OnComplexRecipeChanged;                            // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRecipeBrowse;                                    // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSubRecipeChanged;                                // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnShelfChanged;                                    // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnIngredientOverrideChanged;                       // 0x70(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnUseStarQualityChanged;                           // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCraftMultiplierChanged;                          // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FRecipePlayerOptions                  RecipeOptions;                                     // 0xA0(0x18)(NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnJoinComplexRecipe;                               // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            OnExitComplexRecipe;                               // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            OnComplexRecipeFinished;                           // 0xD8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TArray<class UCrafterComponent*>             ActivelyBrowsingCrafters;                          // 0xE8(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCookingSubsystem* GetDefaultObj();

	void SetRecipeOption_UseStarQualityItems(bool UseStarQuality);
	void SetRecipeOption_CraftMultiplier(int32 Multiplier);
	void RemoveRecipeOption_IngredientOverrideMappingForIndex(int32 SimpleIngredientIndex);
	void RecipeEvent__DelegateSignature(struct FComplexRecipeRecord& ComplexState, struct FComplexRecipeCrafter& CrafterState, int32 RecipeIndex);
	struct FRecipePlayerOptions GetRecipeOptions();
	bool GetRecipeOption_UseStarQualityItems();
	bool GetRecipeOption_IngredientOverrideMappingForIndex(int32 SimpleIngredientIndex, struct FRecipePlayerOptionMapping* OutMapping, enum class EValeriaFuncResult* OutResult);
	enum class EComplexRecipeCueState GetCookingRecipeCueStateForIngredient(class UCrafterComponent* CrafterComponent, struct FRecipe_RequireItem& RequireItem, int32 IngredientIndex);
	enum class EComplexRecipeCueState GetCookingRecipeCueStateForHUD(int32 CrafterPersistId, struct FRecipe_RequireItem& RequireItem);
	enum class EComplexRecipeCueState GetCookingRecipeCueStateForCrafter(class UCrafterComponent* CrafterComponent, struct FRecipe_RequireItem& RequireItem);
	void CookingSubsystemEvent__DelegateSignature();
	void ComplexRecipeStartEvent__DelegateSignature(struct FCrafterConfig& MainCrafterConfig, struct FComplexRecipeRecord& RecipeRecord);
	void ComplexRecipeEvent__DelegateSignature(struct FComplexRecipeRecord& RecipeRecord);
	void ClearRecipeOption_IngredientOverrideMappings();
	void AddRecipeOption_IngredientOverrideMapping(struct FRecipePlayerOptionMapping& MapPing);
};

// 0x108 (0x1A8 - 0xA0)
// Class Palia.InventoryComponent
class UInventoryComponent : public UActorComponent
{
public:
	uint8                                        Pad_269F[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FInventoryBag>                 Bags;                                              // 0xB8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	int32                                        ItemsCollected;                                    // 0xC8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26A0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGameplayTag>                  TagsToTrackForStats;                               // 0xD0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnItemAdded;                                       // 0xE0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnChanged;                                         // 0xF0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnInvFullErrorRequested;                           // 0x100(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnInventoryUpgraded;                               // 0x110(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_26A3[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FValeriaItem>                  ItemAddedNotifQueue;                               // 0x148(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_26A4[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UInventoryComponent* GetDefaultObj();

	struct FNotification ShouldBlockGathering(class AValeriaCharacter* Character);
	void SetActiveActionBarIndex(int32 RowIndex, int32 ColsPerRow);
	void RpcServer_SetActiveActionBarIndex(int32 RowIndex, int32 ColsPerRow);
	void RpcServer_RemoveAllItems(bool bIncludeTools);
	void RpcClient_ItemAdded(const struct FValeriaItem& Item);
	bool RemoveItem(struct FInventory_RemoveContext& RemoveContext);
	void OnRep_Bags();
	struct FUseEventResult OnClientUsedEquippedOnMe(class AValeriaPlayerController* Player, const struct FUseEventParams& Params);
	void NotifyInventoryUpgraded(class FText NotificationText);
	void NotifyInventoryFull(class FText NotificationText);
	int32 K2_GetItemAmountByType(TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType, struct FStarQualityConstraint& StarQualityConstraint);
	int32 K2_GetItemAmountByTag(struct FGameplayTag& IngredientTag, struct FStarQualityConstraint& StarQualityConstraint);
	bool IsShippingBin();
	bool IsLocationInActiveActionBar(struct FBagSlotLocation& Location);
	bool IsBagInActionBar(int32 BagIndex);
	int32 GetTotalMaxSlotsInBag(int32 BagIndex);
	int32 GetTotalMaxSlotsForActionBar();
	int32 GetTotalMaxSlots();
	TArray<struct FBagSlotLocation> GetToolsForToolWheel();
	class UStorageComponent* GetStorageComponent();
	int32 GetNumberOfOverflowSlots();
	int32 GetNumberOfActionBarRows(int32 ColsPerRow);
	struct FBagSlotLocation GetLocationAtActionBarIndex(int32 RowIndex, int32 ColumnIndex, int32 ColsPerRow);
	struct FValeriaItem GetItemAtActionBarIndex(int32 RowIndex, int32 ColumnIndex, int32 ColsPerRow);
	struct FValeriaItem GetItemAt(const struct FBagSlotLocation& Location);
	struct FGameplayTag GetBagTypeForBagIndex(int32 BagIndex);
	struct FGameplayTag GetBagTypeAtActionBarIndex(int32 RowIndex, int32 ColumnIndex, int32 ColsPerRow);
	int32 GetBagIndexForGamePlayTag(struct FGameplayTag& GameplayTag);
	TArray<struct FValeriaItem> GetAllPlaceableItemsInBag(struct FGameplayTagContainer& IncludeTag, struct FGameplayTagContainer& ExcludeTag);
	struct FBagSlotLocation FindItemByTypeAndVariant(TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType, int32 TintPersistID, bool bRequireStarQuality);
	struct FBagSlotLocation FindItemByType(TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType, bool bRequireStarQuality);
	struct FBagSlotLocation FindItemByTag(struct FGameplayTag& ItemTag, bool bRequireStarQuality);
	bool ContainsItemByTypeOrTag(TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType, struct FGameplayTag& IngredientTag, int32 Amount, struct FGameplayTag& BagType);
	bool ContainsItemByType(TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType, int32 Amount);
	bool ContainsItemByTag(struct FGameplayTag& Tag);
	bool ContainsItemByCategory(enum class EItemCategory ItemCategory);
	bool CanAddItemTypeHere(TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType);
	bool CanAddItemsFully(TArray<struct FValeriaItem>& Items);
	bool CanAddItemFully(struct FValeriaItem& Item);
	bool AreStorageSlotsFull();
	bool AreSlotsFull();
	bool AreInventorySlotsFull();
	int32 AddItemToBag(const struct FValeriaItem& ItemToAdd, enum class EInventoryAddItemFlags Flags, struct FGameplayTag& BagType);
	int32 AddItem(const struct FValeriaItem& ItemToAdd, enum class EInventoryAddItemFlags Flags);
};

// 0x18 (0x1C0 - 0x1A8)
// Class Palia.CrafterAutomaticInventoryComponent
class UCrafterAutomaticInventoryComponent : public UInventoryComponent
{
public:
	uint8                                        Pad_26B1[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCrafterComponent_Automatic*           CrafterComponent;                                  // 0x1B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCrafterAutomaticInventoryComponent* GetDefaultObj();

	class UCrafterComponent_Automatic* GetInventoryComponent();
};

// 0x260 (0x300 - 0xA0)
// Class Palia.CrafterComponent
class UCrafterComponent : public UActorComponent
{
public:
	uint8                                        Pad_2738[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCrafterChanged;                                  // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCrafterChangedWithContext;                       // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCrafterStateChanged;                             // 0xD8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCrafterBurned;                                   // 0xE8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCrafterCharacterEngaged;                         // 0xF8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPropChanged;                                     // 0x108(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnMinigameSuccessfulInput;                         // 0x118(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnMinigameMistimedInput;                           // 0x128(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnComplexRecipeStarted;                            // 0x138(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnComplexRecipeFinished;                           // 0x148(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   CrafterConfig;                                     // 0x158(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCrafterRecipeState                   RecipeState;                                       // 0x168(0x38)(Net, RepNotify, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCrafterStep>                  Steps;                                             // 0x1A0(0x10)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAddedIngredient>              UsedItems;                                         // 0x1B0(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCrafterIngredient>            Ingredients;                                       // 0x1C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FValeriaItem                          ItemCrafting;                                      // 0x1D0(0x50)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCraftingPlayerReward>         PlayerRewards;                                     // 0x220(0x10)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPersistGuid>                  PlayerIdsToReward;                                 // 0x230(0x10)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	enum class ERecipePropPhase                  CurrentPropPhase;                                  // 0x240(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_273A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                CurrentProp;                                       // 0x248(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystemComponent*              Particles;                                         // 0x250(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                ActiveSteps;                                       // 0x258(0x10)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FVAL_TimerHandle                      Server_CraftTimerHandle;                           // 0x268(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVAL_TimerHandle                      Server_CraftBurnTimerHandle;                       // 0x270(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                          Server_RecipeRequest_RevealTimerHandle;            // 0x278(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                          Server_RecipeRequest_ExpireTimerHandle;            // 0x280(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FStartingPlayerInfo                   StartingPlayerInfo;                                // 0x288(0x20)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTimerHandle                          UpdateHoldTimeTimerHandle;                         // 0x2A8(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                          UpdateItemDecayTimerHandle;                        // 0x2B0(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractableComponent*                InteractableComponent;                             // 0x2B8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UProximityChecker*                     ProximityChecker;                                  // 0x2C0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int64                                        CurrentStateStartTimeMs;                           // 0x2C8(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int64                                        StartedCraftingAtMs;                               // 0x2D0(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ExpectedMeshEncroachment;                          // 0x2D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_273B[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftClassPtr<class AActor>>          PropsToPreload;                                    // 0x2F0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UCrafterComponent* GetDefaultObj();

	bool WasRequestStepStarted(int32 RequestIndex);
	bool TryGetBurnTimes(int64* StartTime, int64* EndTime);
	int32 StarQualityItemsConsumedByRecipe(class AValeriaCharacter* VC, int32 RecipeConfigId);
	struct FNotification ShouldBlockGathering(class AValeriaCharacter* Character);
	enum class ECrafterEngageResult SetIsEngaging(bool bShouldEngage, class AValeriaPlayerController* Vpc);
	bool Server_Collect(class AActor* Actor);
	void RpcMulticast_SuccessfullInput(class AValeriaCharacter* VC);
	void RpcMulticast_RecipeRequests_OnBurned();
	void RpcMulticast_MistimedInput(class AValeriaCharacter* VC);
	struct FServerUseEventResult OnServerInteract(class UInteractableComponent* Interactable, class AValeriaCharacter* VC, const struct FInteractEventParams& EventParams);
	void OnReplicatedAndShouldNotify();
	void OnReplicated_PropPhase(enum class ERecipePropPhase OldPropPhase);
	void OnRep_Steps();
	void OnRep_CrafterState(struct FCrafterRecipeState& OldState);
	void OnPostCraftBurnTimer();
	struct FUseEventResult OnClientInteract(class UInteractableComponent* Interactable, class AValeriaPlayerController* Vpc, const struct FInteractEventParams& EventParams);
	bool K2_GetComplexState(struct FComplexRecipeRecord* OutRecipeRecord);
	bool IsRequestStepExpired(int32 RequestIndex);
	bool IsRequestStepDone(int32 RequestIndex);
	bool IsRequestStepActive(int32 RequestIndex);
	bool IsPlateVisible(class AActor* InteractingActor);
	bool IsInteractingMode();
	bool IsInteractable(class AValeriaCharacter* VC, const struct FInteractEventParams& EventParams);
	bool IsIngredientFullyAdded(int32 Index);
	bool IsIngredientExpired(int32 Index);
	bool IsIngredientActive(int32 Index);
	bool IsComplexRecipe(int32 RecipeId);
	int32 InteractPriority();
	bool HasRecipeFailed();
	bool HasInventorySpaceToProduceRecipe(int32 RecipeConfigId, class UInventoryComponent* InventoryComponent);
	bool HasIngredientTypesToProduceRecipe(int32 RecipeConfigId, class UInventoryComponent* InputInventory, struct FGameplayTag& InputInventoryBagType);
	bool HasIngredientsToProduceRecipe(int32 RecipeConfigId, class UInventoryComponent* InputInventory, struct FGameplayTag& InputInventoryBagType);
	void HandleMinigameSuccessfulInput(class UMinigameComponentMasterQTE* MinigameComponent);
	void HandleMinigameStateChanged(class UMinigameComponentBase* Comp, enum class EMinigameState PrevState, enum class EMinigameState NewState);
	void HandleMinigameMistimedInput(class UMinigameComponentMasterQTE* MinigameComponent);
	void HandleInteractableClaimedLocationChanged(struct FVAL_InteractorLockParams& LockParams, class UInteractorComponent* InteractorComponent, bool bLocationClaimed);
	void HandleInteractableChanged(class UInteractableComponent* InInteractableComponent, class AActor* Actor);
	int32 GetTimeSpentCraftingMs();
	int32 GetTimeRemainingTillBurntMs();
	bool GetText(class AValeriaCharacter* VC, enum class EInteractEventIndex EventIndex, struct FGetTextParams* Params);
	TArray<struct FRecipe_RequireItem> GetStartingIngredients(int32 RecipeId);
	int32 GetRequireItemAmount(class AValeriaCharacter* VC, struct FRecipe_RequireItem& RequireItem, bool UseStarQualityItem);
	bool GetRequestTimes(int32* StartTime, int32* EndTime);
	int32 GetRequestRequiredTimeToHoldMs(int32 RequestIndex);
	float GetRequestRemainingNormalized(int32 RequestIndex);
	int32 GetRequestProgressTimeToHoldMs(int32 RequestIndex);
	float GetRequestCompletionNormalized(int32 RequestIndex);
	struct FRecipeStepConfig GetRecipeStepConfig(int32 RequestIndex, int32 RecipeId);
	void GetRecipeNeeds(class AValeriaCharacter* VC, int32 RecipeId, struct FRecipeNeeds* RecipeNeeds, bool bUseStarQualityItems);
	struct FValeriaItem GetRecipeItemToProduce();
	int32 GetRecipeIdCrafting();
	struct FRecipeConfig GetRecipeConfig(int32 RecipeId);
	TArray<struct FPersistGuid> GetPlayers();
	class AHousingPlotActor* GetOwningPlot();
	int32 GetNumPlayers();
	int32 GetNumberOfRequests();
	int32 GetNumberOfInteractions(int32 RecipeId);
	float GetNormalizedCraftingProgress();
	TArray<int32> GetManualIngredientSteps(int32 RecipeId);
	struct FValeriaItem GetItemCrafting(class AValeriaCharacter* VC);
	class FText GetIngredientRequestText(struct FCrafterIngredient& IngredientRequest);
	int32 GetCraftTimeToHoldRequiredSecs();
	int32 GetCraftTimeToHoldProgressMs();
	int32 GetCraftTimeMs(int32 RecipeId);
	int64 GetCraftStartTimeMs();
	bool GetCraftPhaseTimes(int32* StartTime, int32* EndTime);
	bool GetCraftLimitTimes(int32* StartTime, int32* EndTime);
	enum class ECrafterState GetCrafterState();
	struct FCrafterConfig GetCrafterConfig();
	int64 GetCraftEndTimeMs();
	TArray<struct FValeriaItem> GetAddedIngredients();
	void GatherIconsForIngredients(TArray<class UTexture2D*>* Icons, TArray<int32>* Amounts, int32 RecipeId);
	bool DoesPlayerHaveRootIngredients(class AValeriaCharacter* VC, int32 RecipeId, bool bUseStarQualityItems);
	bool DoesBroadcastApply(class UCrafterComponent* Crafter);
	bool ContainsAllIngredients(int32 Multiplier);
	void Client_TryDisengageCrafter(class AValeriaPlayerController* PlayerController);
	bool CanShowCrafterPanel();
	enum class ERecipeAvailability CanSelectRecipe(class AActor* Actor, int32 RecipeConfigId, bool bCheckPlotFilter, bool bUseStarQualityItems, bool bAllowIntermixingRegularAndStarQualityIngredients, int32 Multiplier);
	bool CanMakeRecipe(class AActor* Actor, int32 RecipeConfigId, bool bUseStarQualityItems, bool bAllowIntermixingRegularAndStarQualityIngredients, int32 CraftMultiplier);
};

// 0x40 (0x340 - 0x300)
// Class Palia.CrafterComponent_Automatic
class UCrafterComponent_Automatic : public UCrafterComponent
{
public:
	FMulticastInlineDelegateProperty_            RecipesChanged;                                    // 0x300(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<int32>                                RecipeListUnlocked;                                // 0x310(0x10)(Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                RecipeListAll;                                     // 0x320(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UCrafterAutomaticInventoryComponent*   InventoryComponent;                                // 0x330(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         Server_HasBeenSetup;                               // 0x338(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_274A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCrafterComponent_Automatic* GetDefaultObj();

	void SwapIndices(int32 FirstIndex, int32 SecondIndex);
	void RpcServer_SwapIndices(int32 FirstIndex, int32 SecondIndex);
	void OnRecipeUnlocked(class URecipeInventoryComponent* Recipes, TArray<int32>& RecipeConfigId);
	void OnInventoryChanged(class UInventoryComponent* Inventory);
	void OnAutoCrafterChanged(class UCrafterComponent* Crafter);
	bool IsIngredientUsedInRecipe(TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType, int32 RecipeConfigId);
	TArray<int32> GetRecipeListAll();
	TArray<int32> GetRecipeList();
	class UInventoryComponent* GetInventoryComponent();
	void DevOnly_OnRecipesLocked(class URecipeInventoryComponent* Recipes);
	bool CanIngredientBeUsedByUnlockedRecipe(TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType);
	bool CanIngredientBeUsedByAnyRecipe(TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& ItemType);
};

// 0x110 (0x140 - 0x30)
// Class Palia.CraftingGlobalConfig
class UCraftingGlobalConfig : public UDataAsset
{
public:
	struct FCraftingGlobalConfig_CoopSettings    CoOp;                                              // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_274B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCraftingGlobalConfig_ItemUseSettings ItemUse;                                           // 0x38(0x38)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	enum class ECraftingRequestItemMode          RequestItemMode;                                   // 0x70(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_274C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FNotification                         RecipeRuined;                                      // 0x78(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UVAL_ItemTypeDefinitionAsset*          FailureRewardItemType;                             // 0xA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        QualityBaseChance;                                 // 0xB0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        QualityChancePerSkillLevel;                        // 0xB4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        QualityChanceForIngredients;                       // 0xB8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        QualityChanceForMinigame;                          // 0xBC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FirstTimeFurniturePercentBonus;                    // 0xC0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_274E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCraftingGlobalConfig_ModificationBenchSettings ModificationBenchSettings;                         // 0xC8(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FCraftingGlobalConfig_CookingSettings Cooking;                                           // 0xE8(0x58)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCraftingGlobalConfig* GetDefaultObj();

};

// 0x8 (0x3C0 - 0x3B8)
// Class Palia.CreatureAIController
class ACreatureAIController : public AAIController
{
public:
	class UBehaviorTreeComponent*                BTComponent;                                       // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ACreatureAIController* GetDefaultObj();

};

// 0x148 (0x460 - 0x318)
// Class Palia.ValeriaMoveablePawn
class AValeriaMoveablePawn : public APawn
{
public:
	class USkeletalMeshComponent*                Mesh;                                              // 0x318(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UValeriaBaseMovementComponent*         MovementComponent;                                 // 0x320(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCapsuleComponent*                     CapsuleComponent;                                  // 0x328(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBasedMovementInfo                    BasedMovement;                                     // 0x330(0x48)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FBasedMovementInfo                    ReplicatedBasedMovement;                           // 0x378(0x48)(Net, RepNotify, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        ReplicatedMovementMode;                            // 0x3C0(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInBaseReplication;                                // 0x3C1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2765[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ResyncMeshTimeRemaining;                           // 0x3C4(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               DesyncMeshOriginalOffset;                          // 0x3C8(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FQuat                                 DesyncMeshOriginalLocQuat;                         // 0x3E0(0x20)(Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bProxyIsJumpForceApplied : 1;                      // Mask: 0x1, PropSize: 0x10x400(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPressedJump : 1;                                  // Mask: 0x2, PropSize: 0x10x400(0x1)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClientUpdating : 1;                               // Mask: 0x4, PropSize: 0x10x400(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClientWasFalling : 1;                             // Mask: 0x8, PropSize: 0x10x400(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSimGravityDisabled : 1;                           // Mask: 0x10, PropSize: 0x10x400(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClientCheckEncroachmentOnNetUpdate : 1;           // Mask: 0x20, PropSize: 0x10x400(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bWasJumping : 1;                                   // Mask: 0x40, PropSize: 0x10x400(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_17E : 1;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_276A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        JumpKeyHoldTime;                                   // 0x404(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JumpForceTimeRemaining;                            // 0x408(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProxyJumpForceStartedTime;                         // 0x40C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JumpMaxHoldTime;                                   // 0x410(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        JumpMaxCount;                                      // 0x414(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        JumpCurrentCount;                                  // 0x418(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        JumpCurrentCountPreJump;                           // 0x41C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnReachedJumpApex;                                 // 0x420(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2770[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            MovementModeChangedDelegate;                       // 0x440(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCharacterMovementUpdated;                        // 0x450(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AValeriaMoveablePawn* GetDefaultObj();

	void StopMontageByMapping(class FName& MappingName);
	void StopJumping();
	void StopAnimMontage(class UAnimMontage* AnimMontage);
	void ResyncMesh(float Duration);
	void PlayMontageByMapping(class FName& MappingName, float InPlayRate, class FName& StartSectionName, bool bCanHardJump);
	float PlayAnimMontage(class UAnimMontage* AnimMontage, float InPlayRate, class FName& StartSectionName);
	void OnWalkingOffLedge(struct FVector& PreviousFloorImpactNormal, struct FVector& PreviousFloorContactNormal, struct FVector& PreviousLocation, float TimeDelta);
	void OnRep_ReplicatedBasedMovement();
	void OnLaunched(const struct FVector& LaunchVelocity, bool bXYOverride, bool bZOverride);
	void OnLanded(struct FHitResult& Hit);
	void OnJumped();
	void LaunchCharacter(const struct FVector& LaunchVelocity, bool bXYOverride, bool bZOverride);
	void K2_UpdateCustomMovement(float DeltaTime);
	void K2_OnMovementModeChanged(enum class EMovementMode PrevMovementMode, enum class EMovementMode NewMovementMode, uint8 PrevCustomMode, uint8 NewCustomMode);
	void Jump();
	bool IsJumpProvidingForce();
	class FName GetLastUsedAnimMappingName();
	class UAnimMontage* GetCurrentMontage();
	class UAnimMontage* FindMontageByMapping(class FName& MappingName, class FName& MappingQualifier);
	void DesyncMesh(bool bLocation, bool bRotation);
	void ClientCheatWalk();
	void ClientCheatGhost();
	void ClientCheatFly();
	bool CanJumpInternal();
	bool CanJump();
	void ApplyMontageByMappingDelta(class FName& NewMappingName, class FName& OldMappingName);
};

// 0xE0 (0x540 - 0x460)
// Class Palia.CreatureCharacter
class ACreatureCharacter : public AValeriaMoveablePawn
{
public:
	uint8                                        Pad_2784[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnHealthChanged;                                   // 0x478(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class ECurrentBehavior                  CurrentBehavior;                                   // 0x488(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2785[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   CreatureConfig;                                    // 0x490(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bTriggerOnCreaturePathChangedEvents;               // 0x4A0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDelayDestroyOnDeath;                              // 0x4A1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2786[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAICombatStateComponent*               CombatState;                                       // 0x4A8(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULootComponent*                        LootComponent;                                     // 0x4B0(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVitalsComponent*                      Vitals;                                            // 0x4B8(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UValeriaGASComponent*                  ValeriaGAS;                                        // 0x4C0(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDeathComponent*                       Death;                                             // 0x4C8(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDespawnComponent*                     Despawn;                                           // 0x4D0(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHitReactComponent*                    HitReact;                                          // 0x4D8(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UParticipationTrackingComponent*       ParticipationTracking;                             // 0x4E0(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UValeriaGASAttributeSet*               AttributeSet;                                      // 0x4E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHuntingCreatureTeleportComponent*     TeleportComponent;                                 // 0x4F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMirrorImageSpawningComponent*         MirrorImageComponent;                              // 0x4F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2788[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHasBeenAlerted;                                   // 0x508(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2789[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCreatureAlertTriggered;                          // 0x510(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bIsAnInsect;                                       // 0x520(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_278B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EscapeValueForInsectCatching;                      // 0x524(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        EscapeValuePercentIncreasePerStar;                 // 0x528(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        EscapeValueFlatIncreasePerStar;                    // 0x52C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        QualityStars;                                      // 0x530(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_278F[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACreatureCharacter* GetDefaultObj();

	void TriggerCreatureAlert();
	void SkipCreatureAlert();
	void RpcNetMulticast_TriggerCreatureAlert();
	void RpcNetMulticast_OnPathChanged(const struct FVector& StartPosition, const struct FVector& EndPosition);
	void OnCreatureWasAlerted();
	void OnCreaturesPathChanged(const struct FVector& StartPosition, const struct FVector& EndPosition);
	void OnCreatureKnockbackStarted(class AActor* Attacker, const struct FVector& KnockBackDirection, const struct FVector& FinalDestination);
	bool HasBeenAlerted();
	void HandleDeathServer(class UDeathComponent* DeathComponent);
	class UVitalsComponent* GetVitals();
	int32 GetQualityStars();
	class UParticipationTrackingComponent* GetParticipationTracking();
	class UHitReactComponent* GetHitReact();
	class UValeriaGASComponent* GetGAS();
	class UDespawnComponent* GetDespawnComponent();
	class UDeathComponent* GetDeathComponent();
	class UAICombatStateComponent* GetCombatState();
	class UValeriaGASAttributeSet* GetAttributeSet();
	bool FindEscapeDestination(struct FVector* OutDestination);
	void DoBehaviorMovement(enum class ECurrentBehavior NewBehavior, const struct FRootMotionSource_MoveToForce& RootMotionSource);
	float CalculateMaxSpeed();
};

// 0x648 (0x7A0 - 0x158)
// Class Palia.ValeriaBaseMovementComponent
class UValeriaBaseMovementComponent : public UPawnMovementComponent
{
public:
	class AValeriaMoveablePawn*                  MoveableOwner;                                     // 0x158(0x8)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPathFollowingComponent*               FollowComponent;                                   // 0x160(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GravityScale;                                      // 0x168(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxStepHeight;                                     // 0x16C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JumpZVelocity;                                     // 0x170(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JumpOffJumpZFactor;                                // 0x174(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JumpCapsuleHalfHeight;                             // 0x178(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JumpCapsuleRadius;                                 // 0x17C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WalkCapsuleHalfHeight;                             // 0x180(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WalkCapsuleRadius;                                 // 0x184(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WalkableFloorAngle;                                // 0x188(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        WalkableFloorZ;                                    // 0x18C(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EMovementMode                     MovementMode;                                      // 0x190(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EValeriaMoveSimulationFlag        MoveSimFlags;                                      // 0x191(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27F4[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              TargetFacing;                                      // 0x198(0x18)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               TargetLocation1;                                   // 0x1B0(0x18)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               TargetLocation2;                                   // 0x1C8(0x18)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaMoveablePawn*                  TargetLocationLeader;                              // 0x1E0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeaderFollowDistance;                              // 0x1E8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeaderCloseEnoughRange;                            // 0x1EC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasReachedTargetLocation1;                        // 0x1F0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27F6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TeleportDirectToThreshold;                         // 0x1F4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UseFacingInsteadInSimFaceVelocityThreshold;        // 0x1F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldUseForcedFacing;                            // 0x1FC(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27F8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              ForcedFacing;                                      // 0x200(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                             SimplePathTarget;                                  // 0x218(0x10)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             SimplePathDirection;                               // 0x228(0x10)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SimplePathDuration;                                // 0x238(0x4)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSimplePathGuaranteeFinalPosition;                 // 0x23C(0x1)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_27F9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               SimplePathGuaranteedFinalLocation;                 // 0x240(0x18)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                              SimplePathGuaranteedFinalRotation;                 // 0x258(0x18)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        CustomMovementMode;                                // 0x270(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENetworkSmoothingMode             NetworkSmoothingMode;                              // 0x271(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27FC[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundFriction;                                    // 0x274(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27FD[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, float>                     SpeedScalarModifierMap;                            // 0x2B8(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	float                                        SpeedScalar;                                       // 0x308(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxWalkSpeed;                                      // 0x30C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxAcceleration;                                   // 0x310(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SimSpeedCatchUpScalar;                             // 0x314(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BrakingFrictionFactor;                             // 0x318(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BrakingFriction;                                   // 0x31C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BrakingSubStepTime;                                // 0x320(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BrakingDecelerationWalking;                        // 0x324(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BrakingDecelerationFalling;                        // 0x328(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BrakingDecelerationSwimming;                       // 0x32C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BrakingDecelerationFlying;                         // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AirControl;                                        // 0x334(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AirControlBoostMultiplier;                         // 0x338(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AirControlBoostVelocityThreshold;                  // 0x33C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FallingLateralFriction;                            // 0x340(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Buoyancy;                                          // 0x344(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PerchRadiusThreshold;                              // 0x348(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PerchAdditionalHeight;                             // 0x34C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RotationRate;                                      // 0x350(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                              TempOverrideRotationRate;                          // 0x368(0x18)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        bUseSeparateBrakingFriction : 1;                   // Mask: 0x1, PropSize: 0x10x380(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bApplyGravityWhileJumping : 1;                     // Mask: 0x2, PropSize: 0x10x380(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseControllerDesiredRotation : 1;                 // Mask: 0x4, PropSize: 0x10x380(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOrientRotationToMovement : 1;                     // Mask: 0x8, PropSize: 0x10x380(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSweepWhileNavWalking : 1;                         // Mask: 0x10, PropSize: 0x10x380(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_186 : 1;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bMovementInProgress : 1;                           // Mask: 0x40, PropSize: 0x10x380(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bEnableScopedMovementUpdates : 1;                  // Mask: 0x80, PropSize: 0x10x380(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceMaxAccel : 1;                                // Mask: 0x1, PropSize: 0x10x381(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRunPhysicsWithNoController : 1;                   // Mask: 0x2, PropSize: 0x10x381(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceNextFloorCheck : 1;                          // Mask: 0x4, PropSize: 0x10x381(0x1)(Edit, BlueprintVisible, DisableEditOnTemplate, EditConst, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShrinkProxyCapsule : 1;                           // Mask: 0x8, PropSize: 0x10x381(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanWalkOffLedges : 1;                             // Mask: 0x10, PropSize: 0x10x381(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_187 : 2;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bNetworkSkipProxyPredictionOnNetUpdate : 1;        // Mask: 0x80, PropSize: 0x10x381(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNetworkSkipProxyPredictionAlways : 1;             // Mask: 0x1, PropSize: 0x10x382(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDeferUpdateMoveComponent : 1;                     // Mask: 0x2, PropSize: 0x10x382(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnablePhysicsInteraction : 1;                     // Mask: 0x4, PropSize: 0x10x382(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTouchForceScaledToMass : 1;                       // Mask: 0x8, PropSize: 0x10x382(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPushForceScaledToMass : 1;                        // Mask: 0x10, PropSize: 0x10x382(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPushForceUsingZOffset : 1;                        // Mask: 0x20, PropSize: 0x10x382(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bScalePushForceToVelocity : 1;                     // Mask: 0x40, PropSize: 0x10x382(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_188 : 1;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_2803[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USceneComponent*                       DeferredUpdatedMoveComponent;                      // 0x388(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxOutOfWaterStepHeight;                           // 0x390(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutofWaterZ;                                       // 0x394(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Mass;                                              // 0x398(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StandingDownwardForceScale;                        // 0x39C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InitialPushForceFactor;                            // 0x3A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PushForceFactor;                                   // 0x3A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PushForcePointZOffsetFactor;                       // 0x3A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TouchForceFactor;                                  // 0x3AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinTouchForce;                                     // 0x3B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxTouchForce;                                     // 0x3B4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RepulsionForce;                                    // 0x3B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2807[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Acceleration;                                      // 0x3C0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2808[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 LastUpdateRotation;                                // 0x3E0(0x20)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               LastUpdateLocation;                                // 0x400(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               LastUpdateVelocity;                                // 0x418(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               PendingImpulseToApply;                             // 0x430(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               PendingForceToApply;                               // 0x448(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AnalogInputModifier;                               // 0x460(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2809[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxSimulationTimeStep;                             // 0x470(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxSimulationIterations;                           // 0x474(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxJumpApexAttemptsPerSimulation;                  // 0x478(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDepenetrationWithGeometry;                      // 0x47C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDepenetrationWithGeometryAsProxy;               // 0x480(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDepenetrationWithPawn;                          // 0x484(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDepenetrationWithPawnAsProxy;                   // 0x488(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NetProxyShrinkRadius;                              // 0x48C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NetProxyShrinkHalfHeight;                          // 0x490(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LedgeCheckThreshold;                               // 0x494(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JumpOutOfWaterPitch;                               // 0x498(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_280B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFloorInfo                            CurrentFloor;                                      // 0x4A0(0xF0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	enum class EMovementMode                     DefaultLandMovementMode;                           // 0x590(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMovementMode                     GroundMovementMode;                                // 0x591(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_280C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ReduceSimulationToTeleportsThreshold;              // 0x594(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ReduceSimulationToOneStepThreshold;                // 0x598(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CachedDistanceFromLocalPlayerSq;                   // 0x59C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bMovedBySimLodTele : 1;                            // Mask: 0x1, PropSize: 0x10x5A0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_189 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_280D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        QuickFloorAdjustTraceStartHeight;                  // 0x5A4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        QuickFloorAdjustTraceEndDepth;                     // 0x5A8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CheckFloorPeriod;                                  // 0x5AC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CheckFloorTimer;                                   // 0x5B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_280E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class AActor*, float>                   CosmeticAvoidanceActors;                           // 0x5B8(0x50)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        bMaintainHorizontalGroundVelocity : 1;             // Mask: 0x1, PropSize: 0x10x608(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bImpartBaseVelocityX : 1;                          // Mask: 0x2, PropSize: 0x10x608(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bImpartBaseVelocityY : 1;                          // Mask: 0x4, PropSize: 0x10x608(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bImpartBaseVelocityZ : 1;                          // Mask: 0x8, PropSize: 0x10x608(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bImpartBaseAngularVelocity : 1;                    // Mask: 0x10, PropSize: 0x10x608(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bJustTeleported : 1;                               // Mask: 0x20, PropSize: 0x10x608(0x1)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNetworkUpdateReceived : 1;                        // Mask: 0x40, PropSize: 0x10x608(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNetworkMovementModeChanged : 1;                   // Mask: 0x80, PropSize: 0x10x608(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNotifyApex : 1;                                   // Mask: 0x1, PropSize: 0x10x609(0x1)(Edit, BlueprintVisible, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCheatFlying : 1;                                  // Mask: 0x2, PropSize: 0x10x609(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreBaseRotation : 1;                           // Mask: 0x4, PropSize: 0x10x609(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bFastAttachedMove : 1;                             // Mask: 0x8, PropSize: 0x10x609(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysCheckFloor : 1;                             // Mask: 0x10, PropSize: 0x10x609(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseFlatBaseForFloorChecks : 1;                    // Mask: 0x20, PropSize: 0x10x609(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPerformingJumpOff : 1;                            // Mask: 0x40, PropSize: 0x10x609(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bWantsToLeaveNavWalking : 1;                       // Mask: 0x80, PropSize: 0x10x609(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRequestedMoveUseAcceleration : 1;                 // Mask: 0x1, PropSize: 0x10x60A(0x1)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_18A : 1;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bHasRequestedVelocity : 1;                         // Mask: 0x4, PropSize: 0x10x60A(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRequestedMoveWithMaxSpeed : 1;                    // Mask: 0x8, PropSize: 0x10x60A(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_18B : 1;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bProjectNavMeshWalking : 1;                        // Mask: 0x20, PropSize: 0x10x60A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bProjectNavMeshOnBothWorldChannels : 1;            // Mask: 0x40, PropSize: 0x10x60A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_18C : 1;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_2810[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RequestedVelocity;                                 // 0x610(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               PendingLaunchVelocity;                             // 0x628(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2811[0x108];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        NavMeshProjectionInterval;                         // 0x748(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NavMeshProjectionTimer;                            // 0x74C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NavMeshProjectionInterpSpeed;                      // 0x750(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NavMeshProjectionHeightScaleUp;                    // 0x754(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NavMeshProjectionHeightScaleDown;                  // 0x758(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NavWalkingFloorDistTolerance;                      // 0x75C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTeleportToResolvePath;                           // 0x760(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FValeriaBaseMovementComponentPostPhysicsTickFunction PostPhysicsTickFunction;                           // 0x770(0x30)(NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValeriaBaseMovementComponent* GetDefaultObj();

	bool StopFollowingLeader();
	bool StartFollowingLeader(class AValeriaMoveablePawn* NewLeader, float Distance, float CloseEnough);
	void SetWalkableFloorZ(float InWalkableFloorZ);
	void SetWalkableFloorAngle(float InWalkableFloorAngle);
	void SetMovementMode(enum class EMovementMode NewMovementMode, uint8 NewCustomMode);
	void SetAvoidanceActor(class AActor* NewAvoidanceActor, float Radius);
	void Server_SnapToDirection(const struct FRotator& Rotation);
	void RpcMulticast_SnapToDirection(const struct FRotator& Rotation);
	void RpcClient_ApplyTeleport(const struct FVector& TeleportLocation, const struct FRotator& TeleportRotation);
	void RpcClient_ApplyJump();
	void RpcClient_AddImpulse(const struct FVector& Impulse, bool bVelocityChange);
	void OnRep_TargetLocationLeader();
	void OnRep_TargetLocation1();
	void OnRep_MoveSimFlags(enum class EValeriaMoveSimulationFlag& OldFlags);
	float K2_GetWalkableFloorZ();
	float K2_GetWalkableFloorAngle();
	void K2_FindFloor(const struct FVector& CapsuleLocation, struct FFloorInfo* FloorResult);
	void K2_ComputeFloorDist(const struct FVector& CapsuleLocation, float LineDistance, float SweepDistance, float SweepRadius, struct FFloorInfo* FloorResult);
	bool IsWalking();
	bool IsWalkable(struct FHitResult& Hit);
	float GetValidPerchRadius();
	float GetPerchRadiusThreshold();
	class UPrimitiveComponent* GetMovementBase();
	class AValeriaMoveablePawn* GetMoveableOwner();
	float GetMinAnalogSpeed();
	float GetMaxJumpHeightWithJumpTime();
	float GetMaxJumpHeight();
	float GetMaxBrakingDeceleration();
	float GetMaxAcceleration();
	struct FVector GetLastUpdateVelocity();
	struct FRotator GetLastUpdateRotation();
	struct FVector GetLastUpdateLocation();
	struct FVector GetImpartedMovementBaseVelocity();
	class UPathFollowingComponent* GetFollowingComponent();
	struct FVector GetCurrentAcceleration();
	float GetAnalogInputModifier();
	void DisableMovement();
	void DeterminePrimaryAvoidanceActor(class AActor** AvoidanceActor, float* Radius);
	bool DetermineCurrentNavMeshLocation(struct FVector* NavFloorLocation);
	void ClearAvoidanceActor(class AActor* MatchAvoidanceActor);
	void ClearAllAvoidanceActors();
	void ClearAccumulatedForces();
	void CapsuleTouched(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void CalcVelocity(float DeltaTime, float Friction, bool bFluid, float BrakingDeceleration);
	bool AttemptServerTeleport(struct FVector& TeleportTarget, struct FRotator& TeleportRotation);
	void AddImpulse(const struct FVector& Impulse, bool bVelocityChange);
	void AddForce(const struct FVector& Force);
};

// 0x40 (0x7E0 - 0x7A0)
// Class Palia.ValeriaNpcMovementComponent
class UValeriaNpcMovementComponent : public UValeriaBaseMovementComponent
{
public:
	bool                                         bMovingOnPlacedPath;                               // 0x7A0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_281F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               OldTargetLocation1;                                // 0x7A8(0x18)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               OldTargetLocation2;                                // 0x7C0(0x18)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EMovementMode                     ForcedClientMovementMode;                          // 0x7D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EMovementMode                     ForcedServerMovementMode;                          // 0x7D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2820[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ClientMovementModeChangedFromForcedCounter;        // 0x7DC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValeriaNpcMovementComponent* GetDefaultObj();

};

// 0x10 (0x7F0 - 0x7E0)
// Class Palia.CreatureMovementComponent
class UCreatureMovementComponent : public UValeriaNpcMovementComponent
{
public:
	float                                        SprintSpeedMultiplier;                             // 0x7E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2822[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCreatureMovementComponent* GetDefaultObj();

};

// 0x58 (0xA0 - 0x48)
// Class Palia.CurrencyConfig
class UCurrencyConfig : public UGuidDataAsset
{
public:
	int32                                        MaxAmount;                                         // 0x48(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2823[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            Icon;                                              // 0x50(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Name;                                              // 0x58(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x70(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ToolTipText;                                       // 0x80(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bIsSkillMedal;                                     // 0x98(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2824[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCurrencyConfig* GetDefaultObj();

};

// 0x48 (0x78 - 0x30)
// Class Palia.DataLayerStatesConfig
class UDataLayerStatesConfig : public UDataAsset
{
public:
	TArray<TSoftObjectPtr<class UDataLayerAsset>> UnloadedLayers;                                    // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UDataLayerAsset>> ActivatedLayers;                                   // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UDataLayerAsset>> LoadedLayers;                                      // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FVector                               ActiveQueryLocation;                               // 0x60(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDataLayerStatesConfig* GetDefaultObj();

};

// 0x28 (0xC8 - 0xA0)
// Class Palia.DeathComponent
class UDeathComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnDeathServer;                                     // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDeath;                                           // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AActor*                                DeathInstigator;                                   // 0xC0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDeathComponent* GetDefaultObj();

	void RpcClient_DisplayDeath(class AActor* PassedDeathInstigator);
	class AActor* GetDeathInstigator();
};

// 0x20 (0xC0 - 0xA0)
// Class Palia.DebugCheatComponent
class UDebugCheatComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnDebugSaveStateCompleted;                         // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        SpawnedActors;                                     // 0xB0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDebugCheatComponent* GetDefaultObj();

	void RpcServer_SendCheat(const struct FDebugCheat& Cheat);
	void RpcClient_DebugSaveComplete();
};

// 0x80 (0x120 - 0xA0)
// Class Palia.DebugInfoComponent
class UDebugInfoComponent : public UActorComponent
{
public:
	uint8                                        Pad_2847[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnChanged;                                         // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FTitleAndRowsInfo>             ServerLoadedPrivateSpacesTitleAndRowsInfo;         // 0xB8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FDebugInfoPersistBlock                DebugInfoPersistBlock;                             // 0xC8(0x58)(Net, RepNotify, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDebugInfoComponent* GetDefaultObj();

	void RpcServer_ToggleCheats();
	void RpcServer_SetCheats(bool CanCheat);
	void RpcServer_RequestServerLoadedPrivateSpacesTitleAndRowsInfo(bool bRequestOnlyOwner);
	void OnServerLoadedPrivateSpacesTitleAndRowsInfoReplicatedAndShouldNotify();
	void OnReplicatedAndShouldNotify(const struct FDebugInfoPersistBlock& OldDebugInfoPersistBlock);
	bool HasReceivedCheatSetByGuid(struct FGuid& InGuid);
	bool HasReceivedCheatSet(class UCheatSetConfig* InCheatSetConfig);
	bool GetShowVillagerDebugInfo();
	bool GetShowHiddenGearTypes();
	bool GetIgnoreGiftTimeRestriction();
	bool GetIgnoreFriendshipLevelRequirementsForDynamicGiftPrefs();
	bool GetIgnoreDailyDialogueLimit();
	bool AreCheatsEnabled();
};

// 0x190 (0x230 - 0xA0)
// Class Palia.DebugServerActorsComponent
class UDebugServerActorsComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnReplicated;                                      // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDebugServerActorListToTrack          Targets;                                           // 0xB0(0x118)(Net, RepNotify, NativeAccessSpecifierPrivate)
	TArray<class UClass*>                        SelectedClasses;                                   // 0x1C8(0x10)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FTimerHandle                          UpdateTargetsTimerHandle;                          // 0x1D8(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class UClass*, struct FLinearColor>     ClassColors;                                       // 0x1E0(0x50)(NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDebugServerActorsComponent* GetDefaultObj();

	void Server_UpdateTimer();
	void Server_UpdateAllProperties();
	void Server_UpdateActorProperties(struct FDebugServerActorListToTrackItem* TrackItem);
	void Server_UntrackActor(class AActor* InActor);
	bool Server_UnselectActorClass(class UClass* InClass);
	bool Server_TrackActor(class AActor* InActor);
	bool Server_SelectActorClass(class UClass* InClass);
	void Server_OnActorDestroyed(class AActor* InActor);
	void Reset();
	struct FLinearColor GetActorDebugColor(class UClass* InClass);
	TArray<struct FDebugServerActorListToTrackItem> GetActorData();
	void Client_OnReplicated();
};

// 0xC0 (0x160 - 0xA0)
// Class Palia.DebugSpawningComponent
class UDebugSpawningComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnSettingsChanged;                                 // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDebugSpawningSettings                Settings;                                          // 0xB0(0x38)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class AActor>                    SpawnManagerClassToIterate;                        // 0xE8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                        CurrentlyTrackingSpawnManagers;                    // 0xF0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UClass*>                        CurrentlyTrackingSpawnees;                         // 0x100(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDebugSpawningReplicatedData          ReplicatedData;                                    // 0x110(0x30)(Net, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                        Targets;                                           // 0x140(0x10)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UDebugServerActorsComponent*           DebugServerActors;                                 // 0x150(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2875[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDebugSpawningComponent* GetDefaultObj();

	void SetEnabled(bool Enable);
	void SetDebugSpawningSettings(struct FDebugSpawningSettings& InSettings);
	void Server_OnActorSpawned(class AActor* InActor);
	void Server_OnActorDespawned(class AActor* InActor);
	void RpcServer_UntrackSpawnManager(class FName& SpawnManagerName);
	void RpcServer_UntrackSpawneeClass(class FName& SpawneeClassName);
	void RpcServer_UntrackAllSpawnManagers();
	void RpcServer_UntrackAllSpawnees();
	void RpcServer_UntrackAll();
	void RpcServer_TrackSpawnManager(class FName& SpawnManagerName);
	void RpcServer_TrackSpawneeClass(class FName& SpawneeClassName);
	void RpcServer_SetEnabled(bool Enable);
	void RpcServer_SetDebugSpawningSettings(struct FDebugSpawningSettings& InSettings);
	void OnSpawnManagerActorSpawnChange(class AActor* InActor);
	bool IsTrackingSpawnManager(class FName& SpawnManagerName);
	TArray<class FName> GetSpawnManagerNames();
	TArray<class FName> GetSpawneeClassNames();
	struct FDebugSpawningSettings GetDebugSpawningSettings();
	void Client_UntrackSpawnManager(class FName& SpawnManagerName);
	void Client_UntrackSpawneeClass(class FName& SpawneeClassName);
	void Client_UntrackAllSpawnManagers();
	void Client_UntrackAllSpawnees();
	void Client_UntrackAll();
	void Client_TrackSpawnManager(class FName& SpawnManagerName);
	void Client_TrackSpawneeClass(class FName& SpawneeClassName);
	void Client_OnReplicatedSettings();
	void Client_OnReplicatedData();
};

// 0x158 (0x190 - 0x38)
// Class Palia.DefaultDestinationsConfig
class UDefaultDestinationsConfig : public UDeveloperSettings
{
public:
	struct FLevelToDestination                   HousingPlotDefault;                                // 0x38(0x38)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FLevelToDestination                   VisitingPlotDefault;                               // 0x70(0x38)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FLevelToDestination                   SpecificLocationDefault;                           // 0xA8(0x38)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UWorld>, TSoftObjectPtr<class UTeleportTravelConfigAsset>> DefaultMapDestinations;                            // 0xE0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UTeleportTravelConfigAsset>> CrossServerDestinations;                           // 0x130(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UWorld>, TSoftObjectPtr<class UTeleportTravelConfigAsset>> DefaultInitialMapPrivateSpaces;                    // 0x140(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDefaultDestinationsConfig* GetDefaultObj();

};

// 0x38 (0xD8 - 0xA0)
// Class Palia.DespawnComponent
class UDespawnComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnDespawnStarted;                                  // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDespawnWasCancelled;                             // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2882[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeStartedDespawnAt;                              // 0xC8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TotalDespawnTime;                                  // 0xCC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsImmuneWhileDespawning;                          // 0xD0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2883[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDespawnComponent* GetDefaultObj();

	void RpcNetMulticast_CancelDespawn();
	void RpcNetMulticast_BeginDespawn(float DespawnDuration);
	bool IsDespawning();
	float GetTotalDespawnTime();
	float GetSpentDespawnTime();
	float GetRemainingDespawnTime();
	float GetDespawnProgress();
};

// 0x8 (0xA8 - 0xA0)
// Class Palia.DespawnTimerComponent
class UDespawnTimerComponent : public UActorComponent
{
public:
	uint8                                        Pad_2886[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeBeforeDespawn;                                 // 0xA4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UDespawnTimerComponent* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class Palia.Dev_SpawnActorConfig
class UDev_SpawnActorConfig : public UDataAsset
{
public:
	TArray<class FName>                          WhiteListAssetPaths;                               // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDev_SpawnActorConfig* GetDefaultObj();

};

// 0x1A0 (0x240 - 0xA0)
// Class Palia.DialogueComponent
class UDialogueComponent : public UActorComponent
{
public:
	uint8                                        Pad_28B7[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnIgnoreDialogueTriggered;                         // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDialogProgressed;                                // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDialogueStarted;                                 // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDialogueEnded;                                   // 0xD8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDialogueCameraInitialFadeOutComplete;            // 0xE8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDialogueCameraInitialFadeInStart;                // 0xF8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDialogueCameraEndingFadeOutComplete;             // 0x108(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDialogueScriptedNotify;                          // 0x118(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCameraComponent*                      DialogueCamera;                                    // 0x128(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FViewTargetTransitionParams           DialogueCameraTransitionInfo;                      // 0x130(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bShouldHidePlayerDuringDialogue;                   // 0x140(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28C0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DialogueFadeInDuration;                            // 0x144(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DialogueFadeHoldDuration;                          // 0x148(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DialogueFadeOutDuration;                           // 0x14C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStopBehaviorAnimsDuringFadeIn;                    // 0x150(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRestartDialogueAnimsDuringFadeIn;                 // 0x151(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStallTextDuringCameraFade;                        // 0x152(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28C7[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RestartDialogueAnimsDuringFadeInTimingScalar;      // 0x154(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutomaticallyFindDialogueCamera;                  // 0x158(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutomaticallySanitizeFocalDistance;               // 0x159(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldAvoidConversation;                          // 0x15A(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnRouteToDestination;                             // 0x15B(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeUntilRushOnTravelStart;                        // 0x15C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RushSpeedUp;                                       // 0x160(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AutomaticallyPlayAnimOutroDelay;                   // 0x164(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClientDialogueDisplayInfo            TextDisplayInfo;                                   // 0x168(0x38)(NativeAccessSpecifierPublic)
	TArray<class UVAL_DialogueAsset*>            DialogueList;                                      // 0x1A0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AValeriaCharacter*>             EngagedCharacters;                                 // 0x1B0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                         bPlayersEngaged;                                   // 0x1C0(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_28CD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          Server_CleanEngagedCharactersHandle;               // 0x1C8(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                          Server_RushHandle;                                 // 0x1D0(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                          Client_CameraFadeHandle;                           // 0x1D8(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                          Client_DialogueTextHandle;                         // 0x1E0(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                          Client_AnimQueueRestartHandle;                     // 0x1E8(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                          Client_AnimQueueOutroHandle;                       // 0x1F0(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSkipNextCameraFade;                               // 0x1F8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldStallDialogueAnimsForBehaviorOutro;         // 0x1F9(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_28CE[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  LastPlayedDialogueMontage;                         // 0x1FC(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  LastPlayedDialogueMontageSection;                  // 0x204(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_28CF[0x34];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDialogueComponent* GetDefaultObj();

	void VillagerActivityStatusChanged(class AValeriaVillagerController* ChangedValeriaVillagerController, enum class EVillagerActivityStatus NewActivityStatus);
	void StartNewDialogueText(class FText& NewText, bool bPerformLocalSubsitutions);
	void SetShouldHidePlayerDuringDialogue(bool bShouldHide);
	void RegisterEnRouteToDestination();
	void RegisterArrivedAtDestination();
	void OpenVillagerStore(class UPersistentTagMapComponent* TagMap);
	struct FServerUseEventResult OnServerInteract(class UInteractableComponent* Interactable, class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams);
	void OnRep_bPlayersEngaged();
	struct FUseEventResult OnClientInteract(class UInteractableComponent* Interactable, class AValeriaPlayerController* Player, const struct FInteractEventParams& Params);
	void LogSelectedDialogue(int32 PreviousDialogueID, int32 SelectedDialogueID);
	bool IsLocallyEngagedForDialogue();
	bool IsInteractable(class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams);
	bool IsDialogueTextFullyDisplayed();
	bool IsAnyoneEngagedForDialogue();
	int32 InteractPriority();
	bool GetText(class AValeriaCharacter* Character, enum class EInteractEventIndex EventIndex, struct FGetTextParams* Params);
	class FString GetDialogueDisplayString();
	void ForceCompleteCurrentDialogueText();
	class FText CreateSubstitutedTextForClient(class FText& InputText);
};

// 0xA0 (0x140 - 0xA0)
// Class Palia.DialogueHistoryComponent
class UDialogueHistoryComponent : public UActorComponent
{
public:
	uint8                                        Pad_28D6[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnChanged;                                         // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                        DayGroupingOverlapHours;                           // 0xB8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_28D7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDialogueChainEntry>           CurrentDialogueChain;                              // 0xC0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDialogueHistory                      DialogueHistory;                                   // 0xD0(0x58)(NativeAccessSpecifierPrivate)
	TArray<struct FDialogueHistoryEntry>         DialogueHistory_QueuedToSend;                      // 0x128(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FTimerHandle                          ProcessDialogueHistoryQueueHandle;                 // 0x138(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDialogueHistoryComponent* GetDefaultObj();

	void StartProcessingLongTermHistoryQueue();
	void RpcClient_SendLongTermHistoryQueue(TArray<struct FDialogueHistoryEntry>& Data);
	void RpcClient_ResetLongTermHistoryQueue();
	void ProcessLongTermHistoryQueue();
};

// 0x30 (0xD0 - 0xA0)
// Class Palia.DisplacerBeastComponent
class UDisplacerBeastComponent : public UActorComponent
{
public:
	TSubclassOf<class AActor>                    IllusionTemplate;                                  // 0xA0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                SpawnedDecoy;                                      // 0xA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeBetweenActions;                                // 0xB0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DecoySpawnRadius;                                  // 0xB4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxCombatTimeBeforeDespawnAttempt;                 // 0xB8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28DC[0x14];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDisplacerBeastComponent* GetDefaultObj();

	void OnDeath(class UDeathComponent* Death);
};

// 0x38 (0xD8 - 0xA0)
// Class Palia.DisplacerShadeComponent
class UDisplacerShadeComponent : public UActorComponent
{
public:
	class USphereComponent*                      CollisionComponent;                                // 0xA0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ShadeLifetime;                                     // 0xA8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExplosionPhysicsImpulsePower;                      // 0xAC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnHitValidTargetClientSide;                        // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_28F5[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDisplacerShadeComponent* GetDefaultObj();

	void NotifyComponentEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void NotifyComponentBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
};

// 0x8 (0x30 - 0x28)
// Class Palia.DummyObject
class UDummyObject : public UObject
{
public:
	class UDataTable*                            TableRef;                                          // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDummyObject* GetDefaultObj();

};

// 0x38 (0xD8 - 0xA0)
// Class Palia.DynamicGiftPrefDataComponent
class UDynamicGiftPrefDataComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnDynamicGiftPreferencesChangedDel;                // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_28FC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWeeklyEventConfig                    PreferenceResetTime;                               // 0xB4(0xC)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        PreferenceDataVersionNumber;                       // 0xC0(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_28FD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVillagerDynamicPreferenceData> CurrentPreferenceData;                             // 0xC8(0x10)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDynamicGiftPrefDataComponent* GetDefaultObj();

	void OnRep_CurrentPreferenceData();
	TArray<int32> GetPreferenceIdsForVillager(int32 VillagerCoreId);
};

// 0x160 (0x458 - 0x2F8)
// Class Palia.EndlessRunnerArcadeMachine
class AEndlessRunnerArcadeMachine : public AArcadeMachineBase
{
public:
	struct FGuid                                 Server_CurrentReplayId;                            // 0x2F8(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FArcadeReplicatedReplayFrameArray     Server_ReplicatedReplayFrames;                     // 0x308(0x128)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FGuid                                 Client_CurrentReplayId;                            // 0x430(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Client_CurrentFrameIndex;                          // 0x440(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Client_ReplayInputsConsumed;                       // 0x444(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FArcadeInputState>             Client_CurrentReplayInputs;                        // 0x448(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AEndlessRunnerArcadeMachine* GetDefaultObj();

	bool ViewingOthersIsEnabled();
	int32 GetNumberOfReplayInputsToConsume();
	struct FGuid GetCurrentReplayGuid();
	int32 ConvertReplayGuidToSeed(const struct FGuid& Guid);
	struct FArcadeInputState ConsumeReplayInput();
	void Client_OnReplayInputReplicated();
	void BPIE_OnCurrentReplayInputsChanged();
	void AddReplayFrame(class AActor* FromActor, const struct FArcadeReplayFrame& InFrame);
};

// 0x40 (0x68 - 0x28)
// Class Palia.EnvEffectState
class UEnvEffectState : public UObject
{
public:
	enum class ELightingModificationType         LightModificationType;                             // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2905[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class ULightingBaseState>      LightBaseState;                                    // 0x30(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2906[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEnvEffectState* GetDefaultObj();

	void EnvEffectEnd();
	void EnvEffectBegin();
};

// 0xB8 (0x348 - 0x290)
// Class Palia.EnvLightingOverrideVolume
class AEnvLightingOverrideVolume : public AActor
{
public:
	bool                                         bUseTimeBlend;                                     // 0x290(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2909[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BlendTime;                                         // 0x294(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ELightingModificationType         OverrideType;                                      // 0x298(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_290A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ULightingBaseState*                    OverrideState;                                     // 0x2A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OverrideStateStrength;                             // 0x2A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_290B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ULightingModState*                     ModificationState;                                 // 0x2B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UEnvEffectState>> EnvEffectClasses;                                  // 0x2B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TSubclassOf<class AValEnvironmentManager>    EnvManagerClass;                                   // 0x2C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                       Root;                                              // 0x2D0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         OuterBoundsBoxComp;                                // 0x2D8(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         InnerBoundsBoxComp;                                // 0x2E0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentBlendPercentage;                            // 0x2E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_290D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AValEnvironmentManager*                EnvManager;                                        // 0x2F0(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_290E[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AEnvLightingOverrideVolume* GetDefaultObj();

	bool UpdateBlend();
	bool UnregisterOverrideState();
	bool RegisterOverrideState();
};

// 0x0 (0x2C8 - 0x2C8)
// Class Palia.Env_CompVolume
class AEnv_CompVolume : public ATriggerVolume
{
public:

	static class UClass* StaticClass();
	static class AEnv_CompVolume* GetDefaultObj();

};

// 0x0 (0x2C8 - 0x2C8)
// Class Palia.Env_DistanceFadeVolume
class AEnv_DistanceFadeVolume : public AVolume
{
public:

	static class UClass* StaticClass();
	static class AEnv_DistanceFadeVolume* GetDefaultObj();

	bool DoesEncompassPoint(const struct FVector& Point, float SphereRadius);
};

// 0x1C8 (0x268 - 0xA0)
// Class Palia.EquipmentComponent
class UEquipmentComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnEquipmentChanged;                                // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnReequipCurrentEquipped;                          // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSelectedEquipmentChanged;                        // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEquipmentUseAttempted;                           // 0xD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCanChangeEquippedUpdated;                        // 0xE0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEquipmentVisibilityChanged;                      // 0xF0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPropsSpawned;                                    // 0x100(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FEquipmentItem                        EquippedTool;                                      // 0x110(0x58)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FEquipmentItem                        EquippedPrimary;                                   // 0x168(0x58)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2967[0x78];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPropInfo                             CurrentProps;                                      // 0x238(0x30)(Net, RepNotify, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UEquipmentComponent* GetDefaultObj();

	void Server_UpdateWaterLevel(int32 NewWaterLevel);
	void Server_UnequipTemporaryItem();
	void Server_RepairToolDurability(int32 Amount);
	void Server_HandleInventoryChanged(class UInventoryComponent* Inventory);
	void Server_DecrementToolDurability(int32 Amount);
	void RpcServer_ValidateEquippedItem(struct FEquipmentItem& EquipItem);
	void RpcServer_UpdateProps(struct FPropInfo& ShowProps);
	void RpcServer_UnequipCurrent(enum class EEquipmentType UnequipType);
	void RpcServer_HiddenStateChange(bool bNewHidden);
	void RpcServer_CHEAT_DecrementToolDurability(int32 Amount, class UGearSlotTypeConfig* GearSlot);
	void RpcNetMulticast_PlayMontageOnEquippedActor(const struct FMontageInfo& MontageInfo);
	void RpcClient_UpdateWaterLevel(int32 NewWaterLevel);
	void RpcClient_ForceEquipItem(struct FEquipmentItem& EquipItem);
	void RpcClient_AcknowledgeEquipSucceeded();
	void PlayMontageOnEquippedActor(const struct FMontageInfo& MontageInfo, bool Multicast);
	void OnRep_EquippedToolUpdated();
	void OnRep_EquippedPrimaryUpdated();
	void OnRep_CurrentProps();
	void K2_Server_EquipTemporaryItem(TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& EquipItem, class AActor* Target);
	bool HasSelectedItem();
	struct FValeriaItem GetValeriaItemFromEquipped();
	struct FEquipmentItem GetEquippedItem();
	void Client_UnselectItem(bool bSendNotify);
	bool Client_TryUseEquipped(struct FUseEventParams& EventParams, bool bIsPrimaryAction);
	bool Client_TryUnequip();
	bool Client_TrySelectItemFromInventory(struct FBagSlotLocation& InventoryLocation);
	bool Client_TryEquipItemFromInventory(struct FBagSlotLocation& InventoryLocation);
	void Client_ShowAnimationProps(TMap<enum class ECharacterAttachPoint, TSoftClassPtr<class AEquipViewActor>>& Props, class FName& PropNotify, class FName& Qualifier);
	void Client_HandleWeedingStarted();
	void Client_HandleWeedingEnded();
	void Client_HandleSeedPlantingStateChanged(bool bIsSeedPlantingActive);
	void Client_HandlePlacementModeChanged(class AValeriaCharacter* Character, bool bIsPlacementMode);
	void Client_HandleLongFallingChanged(bool bIsLongFalling);
	void Client_HandleInspirationSequenceChanged(class AValeriaCharacter* Character, bool bIsInInspirationSequence);
	void Client_HandleGlidingChanged(bool bIsGliding);
	void Client_HandleEmoteStarted(class UEmoteDataAsset* PlayingEmoteData);
	void Client_HandleEmoteEnded();
	void Client_HandleClimbingChanged(bool bIsClimbing);
	void Client_HandleCharacterStateChange(class UCharacterStateMachineComponent* CharacterStateMachine, const struct FCharacterStateChangeParams& StateChangeParams);
	void Client_HandleAnimInitialized();
	void Client_HandleAbilityStarted(class UGameplayAbility* Ability);
	void Client_HandleAbilityEnded(class UGameplayAbility* Ability);
	void Client_ClearAnimationProps();
};

// 0x0 (0x290 - 0x290)
// Class Palia.EquipViewActor
class AEquipViewActor : public AActor
{
public:

	static class UClass* StaticClass();
	static class AEquipViewActor* GetDefaultObj();

	void ReceiveNamedNotify(class FName& NotifyName, class FName& QualifierName);
	void OnOwnerAnimNotifyBeginReceived(class FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload);
};

// 0x10 (0x38 - 0x28)
// Class Palia.ValeriaExecCmds
class UValeriaExecCmds : public UObject
{
public:
	TArray<class FString>                        Commands;                                          // 0x28(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UValeriaExecCmds* GetDefaultObj();

	class UValeriaExecCmds* GetExecCmds();
	void Execute(class APlayerController* PlayerController);
};

// 0x108 (0x138 - 0x30)
// Class Palia.ExperiencePackageConfig
class UExperiencePackageConfig : public UPrimaryDataAsset
{
public:
	class FName                                  AssetCategoryName;                                 // 0x30(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                 Map;                                               // 0x38(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAbleToReturnToWhereLeftOff;                       // 0x68(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2984[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UDataLayerStatesConfig> DataLayerConfig;                                   // 0x70(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                            SpawnConfig;                                       // 0xA0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FExperienceEventData>          ExperienceEventData;                               // 0xA8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bAllowPlayerPlots;                                 // 0xB8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2988[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTeleportTravelConfigAsset> DefaultDestination;                                // 0xC0(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTeleportTravelConfigAsset> InitialPrivateSpace;                               // 0xF0(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayerStartTag;                                    // 0x120(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DevelopmentVersion;                                // 0x130(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2989[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UExperiencePackageConfig* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class Palia.VAL_ExpPkgSelectionSettings
class UVAL_ExpPkgSelectionSettings : public UDeveloperSettings
{
public:
	class FString                                SelectedExperiencePackage;                         // 0x38(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UVAL_ExpPkgSelectionSettings* GetDefaultObj();

};

// 0x58 (0x590 - 0x538)
// Class Palia.FenceComponent
class UFenceComponent : public UPrimitiveComponent
{
public:
	struct FFenceConfig                          FenceConfig;                                       // 0x538(0x20)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFenceState                           FenceState;                                        // 0x558(0x18)(Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UFenceMeshComponent*                   StartPostMeshComp;                                 // 0x570(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFenceMeshComponent*                   EndPostMeshComp;                                   // 0x578(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFenceMeshComponent*                   SpanMeshComp;                                      // 0x580(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2990[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFenceComponent* GetDefaultObj();

	int32 TrySetFenceLength(int32 DesiredFenceLength, bool bHasStartPost, bool bHasEndPost);
	void OnRep_FenceState();
	bool HasStartPost();
	bool HasEndPost();
	class UFenceMeshComponent* GetStartPostMeshComponent();
	class UFenceMeshComponent* GetSpanMeshComponent();
	int32 GetMinFenceLength(bool bWithEndPost);
	int32 GetMaxFenceLength(bool bWithEndPost);
	int32 GetFenceLength();
	class UFenceMeshComponent* GetEndPostMeshComponent();
};

// 0x8 (0x600 - 0x5F8)
// Class Palia.FenceMeshComponent
class UFenceMeshComponent : public UStaticMeshComponent
{
public:
	enum class EFenceMeshType                    Type;                                              // 0x5F8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2992[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFenceMeshComponent* GetDefaultObj();

};

// 0x0 (0x290 - 0x290)
// Class Palia.FishingCastIndicatorActor
class AFishingCastIndicatorActor : public AActor
{
public:

	static class UClass* StaticClass();
	static class AFishingCastIndicatorActor* GetDefaultObj();

	void OnCastIndicatorChanged(const struct FVector& Endpoint, enum class EFishingCastIndicatorStatus Status);
};

// 0x8A0 (0x940 - 0xA0)
// Class Palia.FishingComponent
class UFishingComponent : public UActorComponent
{
public:
	uint8                                        Pad_29E9[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnFishingRodMovement;                              // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_29EA[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFishingMiniGameViewState             ViewStateOnServer;                                 // 0xD0(0x130)(Edit, BlueprintVisible, BlueprintReadOnly, Net, EditConst, RepNotify, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSelectedBait;                                    // 0x200(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSelectedNoBait;                                  // 0x210(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFishingStateChanged;                             // 0x220(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnReceivedFishingEncouragement;                    // 0x230(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFishCaught;                                      // 0x240(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FName                                  SelectedFishConfigToCatchOnServer;                 // 0x250(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_29EB[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          CastingTimerHandle;                                // 0x268(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                CameraViewTarget;                                  // 0x270(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                CastingProjectile;                                 // 0x278(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_29EC[0x5A0];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class AValeriaCharacter*                     CachedCharOwner;                                   // 0x820(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AValeriaPlayerController*              CachedPlayerController;                            // 0x828(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraTargetComponent*                CachedCameraTarget;                                // 0x830(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraComponent*                      CachedCameraComponent;                             // 0x838(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFishingViewComponent*                 CachedFishingView;                                 // 0x840(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsPaused;                                         // 0x848(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasPaused;                                        // 0x849(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_29ED[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeLastEncouragedSomeone;                         // 0x84C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               CastDestination;                                   // 0x850(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CastTimeOfActualDeploy;                            // 0x868(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCastHasBeenDeployed;                              // 0x86C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_29EE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UValeriaWaterBodyComponent> PreviousSourceWaterBody;                           // 0x870(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSet<int32>                                  ItemIdsOfFishesCaught;                             // 0x878(0x50)(NativeAccessSpecifierPrivate)
	struct FFishingPersistBlock                  FishingPersistBlock;                               // 0x8C8(0x58)(NativeAccessSpecifierPrivate)
	int64                                        TimeLastFishingSessionStartedAt;                   // 0x920(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  OverrideNextFishToCatch;                           // 0x928(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_29EF[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFishingComponent* GetDefaultObj();

	bool ShouldCurrentFishStruggle();
	void SetHookedFishVisibility(bool IsVisible);
	void SetFishingState(enum class EFishingState_OLD NewState);
	void RpcServer_UpdateViewStateOnServer(const struct FFishingMiniGameViewState& ViewState);
	void RpcServer_SetFishingState(enum class ECharacterState NewState);
	void RpcServer_SelectLoot(class FName WaterType, TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset>& BaitItemType);
	void RpcServer_NotifyServerBaitSelected(class UVAL_ItemTypeDefinitionAsset* BaitItemType);
	void RpcServer_FishStartedBiting(class UValeriaWaterBodyComponent* WaterBody);
	void RpcServer_EndFishingState(enum class ECharacterState OldState);
	void RpcServer_EndFishing(struct FFishingEndContext& Context);
	void RpcServer_CheatOverrideNextFishToCatch(class FName FishToCatch);
	void RpcServer_CheatApplyCoopFishingBuff();
	void RpcClient_StartFishingAt(class FName& FishConfigToCatch);
	void RpcClient_ReceiveEncouragement(class AValeriaCharacter* FromVc);
	void RpcClient_InitializeSelectedBait(class UVAL_ItemTypeDefinitionAsset* BaitItemType);
	void RpcClient_FishCaught(const struct FFishCaughtResult& Result);
	void RetryBaitSelectFromPersistBlock(class UInventoryComponent* Inventory);
	struct FServerUseEventResult OnServerInteract(class UInteractableComponent* Interactable, class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams);
	void OnReplicated_ViewStateOnServer();
	struct FSelfUseEventResult OnClientUseEquippedInward(class AValeriaPlayerController* Player, const struct FUseEventParams& Params);
	struct FUseEventResult OnClientInteract(class UInteractableComponent* Interactable, class AValeriaPlayerController* Character, const struct FInteractEventParams& EventParams);
	void OnBobbleHitSomething(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void OnBobbleDestroyed(class AActor* DestroyedActor);
	void MoveRodPosition(float Delta);
	bool IsInteractable(class AValeriaCharacter* Character, const struct FInteractEventParams& EventParams);
	int32 InteractPriority();
	void HandleEquipmentChanged(class UEquipmentComponent* Equipment, const struct FEquipmentItem& Item);
	bool GetText(class AValeriaCharacter* Character, enum class EInteractEventIndex EventIndex, struct FGetTextParams* Params);
	struct FValeriaItem GetSelectedBait();
	enum class EFishingState_OLD GetFishingState();
	void GetDebugInfo(enum class EFishingState_NEW* CurrentFishingState, enum class EFFishingLevelSegmentActionType* FishActionType, int32* CurrentSegmentNextIndex, int32* TotalSegments, float* CurrentActionLerpPctg, float* TimePassed, float* ActionStated, float* ActionTargetLocation, float* CurrentBobberSpeed, float* CurrentBobberPosition, float* TotalTaskTime, float* RawTaskTimeWithoutPause, float* TimeInCurrentTask, class FString* FishName, float* SafeZonePosition);
	enum class EFishingSafeTier GetCurrentSafetyTier();
	class AActor* GetCastingBobber();
	class UFishingViewComponent* GetCachedFishingViewComponent();
	class FString GetAchievementNameForFish(class UVAL_ItemTypeDefinitionAsset* FishItemType);
	void ExitFishingCSMState();
	bool CanStartFishing(struct FNotification* ErrorNotification);
	void AnimDoneFishing();
};

// 0x2B0 (0x2E0 - 0x30)
// Class Palia.FishingGlobalConfig
class UFishingGlobalConfig : public UDataAsset
{
public:
	struct FFishingSubclasses                    Subclasses;                                        // 0x30(0x58)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UVAL_ItemTypeDefinitionAsset*          NoBaitSelectedItemType;                            // 0x88(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DurabilityLossStart;                               // 0x90(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DurabilityLossMidway;                              // 0x94(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DurabilityLossEnd;                                 // 0x98(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_29FA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             NoFishWaitTimeMinMax;                              // 0xA0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFishingCameraSettings                CameraSettings;                                    // 0xB0(0x38)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FFishingCastingSettings               CastSettings;                                      // 0xE8(0x50)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FFishingGoalSettings                  GoalSettings;                                      // 0x138(0x30)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FFishingNotifications                 Notifications;                                     // 0x168(0x90)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFishingSoundSettings                 SoundSettings;                                     // 0x1F8(0x8)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                        FishingWorldScale;                                 // 0x200(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FishDepth;                                         // 0x204(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FishOffset;                                        // 0x208(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ViewStateUpdatesPerSecond;                         // 0x20C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               RodOffset;                                         // 0x210(0x18)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OnBeginReelingInitialCooldown;                     // 0x228(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TelegraphMaxDistance;                              // 0x22C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TelegraphMaxSpeed;                                 // 0x230(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinTelegraphs;                                     // 0x234(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxTelegraphs;                                     // 0x238(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TelegraphMinPctg;                                  // 0x23C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TelegraphMaxPctg;                                  // 0x240(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinTelegraphCooldown;                              // 0x244(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxTelegraphCooldown;                              // 0x248(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TelegraphLerpExp;                                  // 0x24C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  CelebrationSequenceSocketName;                     // 0x250(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PoofTimeFromWaterToHandOnCelebration;              // 0x258(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TotalCelebrationDuration;                          // 0x25C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CelebrationOnFirstCatchOnlyOverride;               // 0x260(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_29FD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FishingFinishReelInSpeed;                          // 0x264(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AfterFinishDestroyBobberWhenAtDistanceToRod;       // 0x268(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_29FE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFishingEncouragementSettings         Encouragement;                                     // 0x270(0x20)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FEndFishingSettings                   EndSettings;                                       // 0x290(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FFishingXpSettings                    XpSettings;                                        // 0x2A0(0xC)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_29FF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFishingCoopBuffSettings              CoopBuffSettings;                                  // 0x2B0(0x18)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                  GenericFishingErrorText;                           // 0x2C8(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UFishingGlobalConfig* GetDefaultObj();

};

// 0xC0 (0x630 - 0x570)
// Class Palia.FishingLineComponent
class UFishingLineComponent : public UMeshComponent
{
public:
	bool                                         bAttachStart;                                      // 0x570(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAttachEnd;                                        // 0x571(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A08[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FComponentReference                   AttachEndTo;                                       // 0x578(0x28)(Edit, NativeAccessSpecifierPublic)
	class FName                                  AttachEndToSocketName;                             // 0x5A0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               EndLocation;                                       // 0x5A8(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinFishingLineLengthToSnap;                        // 0x5C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TensionFactor;                                     // 0x5C4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumSegments;                                       // 0x5C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SubstepTime;                                       // 0x5CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SolverIterations;                                  // 0x5D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableStiffness;                                  // 0x5D4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseSubstepping;                                   // 0x5D5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSkipFishingLineUpdateWhenNotVisible;              // 0x5D6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSkipFishingLineUpdateWhenNotOwnerRecentlyRendered; // 0x5D7(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableCollision;                                  // 0x5D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A09[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CollisionFriction;                                 // 0x5DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               FishingLineForce;                                  // 0x5E0(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FishingLineGravityScale;                           // 0x5F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FishingLineWidth;                                  // 0x5FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumSides;                                          // 0x600(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TileMaterial;                                      // 0x604(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A0A[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FishingLineLength;                                 // 0x620(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A0B[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFishingLineComponent* GetDefaultObj();

	void SetAttachEndToComponent(class USceneComponent* Component, class FName SocketName);
	void SetAttachEndTo(class AActor* Actor, class FName ComponentProperty, class FName SocketName);
	void ResetSimulation();
	void GetFishingLineParticleLocations(TArray<struct FVector>* Locations);
	class USceneComponent* GetAttachedComponent();
	class AActor* GetAttachedActor();
};

// 0x280 (0x320 - 0xA0)
// Class Palia.FishingViewComponent
class UFishingViewComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnFishingBobberWasCreated;                         // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFishIsBitingChanged;                             // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFishJumped;                                      // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnNibbled;                                         // 0xD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnViewWasUpdated;                                  // 0xE0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AActor*                                Bobber;                                            // 0xF0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                Rod;                                               // 0xF8(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                Fish;                                              // 0x100(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                Endpoint;                                          // 0x108(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFishingCastIndicatorActor*            CastIndicator;                                     // 0x110(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A30[0x68];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFishingNibbleActorData>       NibbleFish;                                        // 0x180(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A31[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UFishViewComponent*                    FishView;                                          // 0x1A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  CelebrationFishHandSocketName;                     // 0x1B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A32[0x160];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class US6Core_AssetLoader*                   FishingViewAssetLoader;                            // 0x318(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFishingViewComponent* GetDefaultObj();

	void RpcServer_BobberHitSomething(enum class EFishingBobberHitSomethingResult Result, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& ImpactPoint, class UPhysicalMaterial* PhysMat);
	void RpcNetMulticast_BobberHitSomething(enum class EFishingBobberHitSomethingResult Result, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& ImpactPoint, class UPhysicalMaterial* PhysMat);
	void OnViewWasUpdatedEvent(const struct FFishingMiniGameViewState& ViewState, class UFishingComponent* Source);
	void OnRodBeforeDestroyedEvent(class AActor* Rod);
	void OnMiniGameStateChanged(enum class EFishingMiniGameState PreviousState, enum class EFishingMiniGameState NewState, class UFishingComponent* Source);
	void OnFishingBobbleBeforeDestroyed(class AActor* bobble);
	void OnCastingBobbleWasCreated(class AActor* bobble);
	void OnCastingBobbleBeforeDestroyed(class AActor* bobble);
	void OnBobberHitSomething(enum class EFishingBobberHitSomethingResult Result, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& ImpactPoint, class UPhysicalMaterial* PhysMat);
	bool IsInSafeZone();
	struct FFishingMiniGameViewState GetViewState();
	float GetSafeZoneLength();
	struct FVector GetSafeZoneCenterAtOffset(struct FVector& Offset);
	struct FVector GetSafeZoneCenter();
	struct FVector GetLineLocationRod();
	struct FVector GetLineLocationBobber();
	class AActor* GetActorRod();
	class AActor* GetActorFish();
	class AActor* GetActorBobber();
};

// 0x18 (0xB8 - 0xA0)
// Class Palia.FishViewComponent
class UFishViewComponent : public UActorComponent
{
public:
	float                                        Speed;                                             // 0xA0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinSpeed;                                          // 0xA4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SpeedAtAnimPlaybackOne;                            // 0xA8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StateLerp;                                         // 0xAC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TurnBlend;                                         // 0xB0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TransitionDone;                                    // 0xB4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAnimStateFish                    AnimState;                                         // 0xB5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EAnimStateFish                    AnimStatePrev;                                     // 0xB6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A39[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFishViewComponent* GetDefaultObj();

	enum class EAnimStateFish GetStatePrev();
	enum class EAnimStateFish GetState();
};

// 0x80 (0x5E0 - 0x560)
// Class Palia.FoliageRustleAudioComponent
class UFoliageRustleAudioComponent : public UCapsuleComponent
{
public:
	class UAudioFoliageRustleDataAsset*          FoliageRustleData;                                 // 0x560(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  RustleOverlapTag;                                  // 0x568(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StopTransitionDurationMs;                          // 0x570(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAkCurveInterpolation             StopFadeCurve;                                     // 0x574(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A58[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkRtpc*                               IsLocalMixRTPC;                                    // 0x578(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkRtpc*                               ActorSpeedRTPC;                                    // 0x580(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ActorSpeedRTPCInterpolationMs;                     // 0x588(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A5B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class UAkAudioEvent*, struct FFoliageRustleState> ActiveRustles;                                     // 0x590(0x50)(ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFoliageRustleAudioComponent* GetDefaultObj();

	void HandleEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void HandleBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
};

// 0x1D8 (0x278 - 0xA0)
// Class Palia.FollowCameraManagerComponent
class UFollowCameraManagerComponent : public UActorComponent
{
public:
	class UDataTable*                            Settings;                                          // 0xA0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpringArmComponent*                   CameraBoom;                                        // 0xA8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraComponent*                      FollowCamera;                                      // 0xB0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFollowCameraSettings                 PreviousSetting;                                   // 0xB8(0xB0)(NativeAccessSpecifierPrivate)
	struct FFollowCameraSettings                 CurrentSetting;                                    // 0x168(0xB0)(NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A6B[0x60];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFollowCameraManagerComponent* GetDefaultObj();

	void PlayDollyZoom();
	bool IsSettingActive(class FName& SettingsName);
	void DeactivateSetting(class FName SettingsName, class UObject* Instigator, bool Force);
	void ApplyGraphicSettings(struct FValeriaGraphicSettings& GraphicSettings);
	void ActivateSetting(class FName SettingsName, class UObject* Instigator);
};

// 0x0 (0x28 - 0x28)
// Class Palia.GameplayBlueprintLibrary
class UGameplayBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UGameplayBlueprintLibrary* GetDefaultObj();

	bool NotEqual_ObjectObject(struct FDebugServerActorMapping& A, struct FDebugServerActorMapping& B);
	bool EqualEqual_ObjectObject(struct FDebugServerActorMapping& A, struct FDebugServerActorMapping& B);
};

// 0x0 (0x30 - 0x30)
// Class Palia.VAL_GameplayConditionDef
class UVAL_GameplayConditionDef : public UDataAsset
{
public:

	static class UClass* StaticClass();
	static class UVAL_GameplayConditionDef* GetDefaultObj();

	bool GetAutoDescription(class FText* OutDescription, class UObject* Context);
};

// 0x10 (0x40 - 0x30)
// Class Palia.VAL_QuantityCondition
class UVAL_QuantityCondition : public UVAL_GameplayConditionDef
{
public:
	int32                                        AmountRequired;                                    // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasUpperLimit;                                    // 0x34(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A74[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AmountUpperLimit;                                  // 0x38(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A75[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UVAL_QuantityCondition* GetDefaultObj();

};

// 0x8 (0x48 - 0x40)
// Class Palia.VAL_DeductibleCondition
class UVAL_DeductibleCondition : public UVAL_QuantityCondition
{
public:
	bool                                         bDeductOnComplete;                                 // 0x40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A77[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UVAL_DeductibleCondition* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class Palia.VAL_CompositeCondition
class UVAL_CompositeCondition : public UVAL_GameplayConditionDef
{
public:
	TArray<class UVAL_GameplayConditionDef*>     SubConditions;                                     // 0x30(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UVAL_CompositeCondition* GetDefaultObj();

};

// 0x0 (0x40 - 0x40)
// Class Palia.VAL_CompositeCondition_And
class UVAL_CompositeCondition_And : public UVAL_CompositeCondition
{
public:

	static class UClass* StaticClass();
	static class UVAL_CompositeCondition_And* GetDefaultObj();

};

// 0x0 (0x40 - 0x40)
// Class Palia.VAL_CompositeCondition_Or
class UVAL_CompositeCondition_Or : public UVAL_CompositeCondition
{
public:

	static class UClass* StaticClass();
	static class UVAL_CompositeCondition_Or* GetDefaultObj();

};

// 0x38 (0x80 - 0x48)
// Class Palia.VAL_HasItemTypeCondition
class UVAL_HasItemTypeCondition : public UVAL_DeductibleCondition
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x48(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAlsoCheckStorage;                                 // 0x78(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
