#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1C (0x1C - 0x0)
// Function Palia.AbilityAnimationComponent.TryChangeState
struct UAbilityAnimationComponent_TryChangeState_Params
{
public:
	struct FAnimState                            Context;                                           // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	enum class ERpcAction                        RpcAction;                                         // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E37[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.AbilityAnimationComponent.StopMontage
struct UAbilityAnimationComponent_StopMontage_Params
{
public:
	class UAnimMontage*                          AnimMontage;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E3A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.AbilityAnimationComponent.StopAnimation
struct UAbilityAnimationComponent_StopAnimation_Params
{
public:
	struct FGameplayTag                          AnimTag;                                           // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.AbilityAnimationComponent.StopAll
struct UAbilityAnimationComponent_StopAll_Params
{
public:
	float                                        BlendOut;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1C (0x1C - 0x0)
// Function Palia.AbilityAnimationComponent.RpcServer_TryChangeState
struct UAbilityAnimationComponent_RpcServer_TryChangeState_Params
{
public:
	struct FAnimState                            Context;                                           // 0x0(0x18)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	enum class ERpcAction                        RpcAction;                                         // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E52[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Palia.AbilityAnimationComponent.RpcServer_MontageAction
struct UAbilityAnimationComponent_RpcServer_MontageAction_Params
{
public:
	struct FMontageActionContext                 Context;                                           // 0x0(0xC)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.AbilityAnimationComponent.RpcMontageAction
struct UAbilityAnimationComponent_RpcMontageAction_Params
{
public:
	struct FMontageActionContext                 Context;                                           // 0x0(0xC)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1C (0x1C - 0x0)
// Function Palia.AbilityAnimationComponent.RpcClient_TryChangeState
struct UAbilityAnimationComponent_RpcClient_TryChangeState_Params
{
public:
	struct FAnimState                            Context;                                           // 0x0(0x18)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	enum class ERpcAction                        RpcAction;                                         // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E64[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Palia.AbilityAnimationComponent.PlayMontage
struct UAbilityAnimationComponent_PlayMontage_Params
{
public:
	struct FMontageInfo                          MontageInfo;                                       // 0x0(0x18)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E6E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.AbilityAnimationComponent.PlayAnimation
struct UAbilityAnimationComponent_PlayAnimation_Params
{
public:
	struct FGameplayTag                          AnimTag;                                           // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.AbilityAnimationComponent.OnRep_ReplicatedAnimMontage
struct UAbilityAnimationComponent_OnRep_ReplicatedAnimMontage_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function Palia.AbilityAnimationComponent.OnRep_LocomotionTag
struct UAbilityAnimationComponent_OnRep_LocomotionTag_Params
{
public:
	struct FGameplayTag                          OldTag;                                            // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.AbilityAnimationComponent.OnRep_CombatTag
struct UAbilityAnimationComponent_OnRep_CombatTag_Params
{
public:
	struct FGameplayTag                          OldTag;                                            // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.AbilityAnimationComponent.OnAbilityStarted
struct UAbilityAnimationComponent_OnAbilityStarted_Params
{
public:
	class UGameplayAbility*                      ActivatedAbility;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.AbilityAnimationComponent.OnAbilityEnded
struct UAbilityAnimationComponent_OnAbilityEnded_Params
{
public:
	class UGameplayAbility*                      EndedAbility;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.AbilityAnimationComponent.MontageActionFromContext
struct UAbilityAnimationComponent_MontageActionFromContext_Params
{
public:
	struct FMontageActionContext                 Context;                                           // 0x0(0xC)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AbilityAnimationComponent.MontageAction
struct UAbilityAnimationComponent_MontageAction_Params
{
public:
	enum class ERpcMontageAction                 Event;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E9A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          Montage;                                           // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.AbilityAnimationComponent.IsNotifyStateActive
struct UAbilityAnimationComponent_IsNotifyStateActive_Params
{
public:
	class FName                                  NotifyStateName;                                   // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1EAA[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1E8 (0x1E8 - 0x0)
// Function Palia.AbilityAnimationComponent.HandleStateChanged
struct UAbilityAnimationComponent_HandleStateChanged_Params
{
public:
	class UCharacterStateMachineComponent*       Csm;                                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterStateChangeParams           Params;                                            // 0x8(0x1E0)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.AbilityAnimationComponent.HandleOnAnimInitialized
struct UAbilityAnimationComponent_HandleOnAnimInitialized_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function Palia.AbilityAnimationComponent.HandleEquipmentVisibilityChanged
struct UAbilityAnimationComponent_HandleEquipmentVisibilityChanged_Params
{
public:
	class UEquipmentComponent*                   InEquipmentComponent;                              // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHidden;                                           // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1EBD[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x60 (0x60 - 0x0)
// Function Palia.AbilityAnimationComponent.HandleEquipmentChanged
struct UAbilityAnimationComponent_HandleEquipmentChanged_Params
{
public:
	class UEquipmentComponent*                   InEquipmentComponent;                              // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEquipmentItem                        Item;                                              // 0x8(0x58)(Parm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Palia.AbilityAnimationComponent.HandleAnimNotifyStateEnd
struct UAbilityAnimationComponent_HandleAnimNotifyStateEnd_Params
{
public:
	class FName                                  NotifyName;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBranchingPointNotifyPayload          BranchingPointNotifyPayload;                       // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Palia.AbilityAnimationComponent.HandleAnimNotifyStateBegin
struct UAbilityAnimationComponent_HandleAnimNotifyStateBegin_Params
{
public:
	class FName                                  NotifyName;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBranchingPointNotifyPayload          BranchingPointNotifyPayload;                       // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AbilityAnimationComponent.GetTagAssociatedWithRowName
struct UAbilityAnimationComponent_GetTagAssociatedWithRowName_Params
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.AbilityAnimationComponent.GetSequenceByName
struct UAbilityAnimationComponent_GetSequenceByName_Params
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  MappingQualifier;                                  // 0x8(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.AbilityAnimationComponent.GetSequence
struct UAbilityAnimationComponent_GetSequence_Params
{
public:
	struct FGameplayTag                          Tag;                                               // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  MappingQualifier;                                  // 0x8(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                         ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AbilityAnimationComponent.GetRowNameAssociatedWithTag
struct UAbilityAnimationComponent_GetRowNameAssociatedWithTag_Params
{
public:
	struct FGameplayTag                          Tag;                                               // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.AbilityAnimationComponent.GetMontageByName
struct UAbilityAnimationComponent_GetMontageByName_Params
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  MappingQualifier;                                  // 0x8(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.AbilityAnimationComponent.GetMontage
struct UAbilityAnimationComponent_GetMontage_Params
{
public:
	struct FGameplayTag                          Tag;                                               // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  MappingQualifier;                                  // 0x8(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.AbilityAnimationComponent.GetMappingNameByTag
struct UAbilityAnimationComponent_GetMappingNameByTag_Params
{
public:
	struct FGameplayTag                          Tag;                                               // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  MappingQualifier;                                  // 0x8(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.AbilityAnimationComponent.GetLocomotionTag
struct UAbilityAnimationComponent_GetLocomotionTag_Params
{
public:
	struct FGameplayTag                          ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.AbilityAnimationComponent.GetCombatTag
struct UAbilityAnimationComponent_GetCombatTag_Params
{
public:
	struct FGameplayTag                          ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.AbilityAnimationComponent.GetBlendSpaceByName
struct UAbilityAnimationComponent_GetBlendSpaceByName_Params
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  MappingQualifier;                                  // 0x8(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                           ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.AbilityAnimationComponent.GetBlendSpace
struct UAbilityAnimationComponent_GetBlendSpace_Params
{
public:
	struct FGameplayTag                          Tag;                                               // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  MappingQualifier;                                  // 0x8(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                           ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.AbilityAnimationComponent.Client_OnAnimStateChange
struct UAbilityAnimationComponent_Client_OnAnimStateChange_Params
{
public:
	struct FAnimState                            OldAnimState;                                      // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.UpdateIntegerStatForPlayer
struct UValeriaAccomplishmentsManager_UpdateIntegerStatForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EValeriaStatModificationType      ModificationType;                                  // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F1C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Value;                                             // 0x1C(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.UpdateFloatStatForPlayer
struct UValeriaAccomplishmentsManager_UpdateFloatStatForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EValeriaStatModificationType      ModificationType;                                  // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F25[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Value;                                             // 0x1C(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.UpdateDoubleStatForPlayer
struct UValeriaAccomplishmentsManager_UpdateDoubleStatForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EValeriaStatModificationType      ModificationType;                                  // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F29[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Value;                                             // 0x20(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.SetBooleanStatForPlayer
struct UValeriaAccomplishmentsManager_SetBooleanStatForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         NewValue;                                          // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F2D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.IncrementCollectionStatForPlayer
struct UValeriaAccomplishmentsManager_IncrementCollectionStatForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PersistId;                                         // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x1C(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.HasSetCollectionStatForPlayer
struct UValeriaAccomplishmentsManager_HasSetCollectionStatForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PersistId;                                         // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Value;                                             // 0x1C(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1D(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F38[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.HasRedeemedAchievementRewards
struct UValeriaAccomplishmentsManager_HasRedeemedAchievementRewards_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                AchievementID;                                     // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F43[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.HasAchievementUnlocked
struct UValeriaAccomplishmentsManager_HasAchievementUnlocked_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                AchievementID;                                     // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F47[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetUnlockRulesForAchievement
struct UValeriaAccomplishmentsManager_GetUnlockRulesForAchievement_Params
{
public:
	class FString                                AchievementID;                                     // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAchievementUnlockRule>        ReturnValue;                                       // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetStatValueForPlayerAsString
struct UValeriaAccomplishmentsManager_GetStatValueForPlayerAsString_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Value;                                             // 0x18(0x10)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F4A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetRewardsForAchievement
struct UValeriaAccomplishmentsManager_GetRewardsForAchievement_Params
{
public:
	class FString                                AchievementID;                                     // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAchievementRewards>           ReturnValue;                                       // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetIntegerStatForPlayer
struct UValeriaAccomplishmentsManager_GetIntegerStatForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x18(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1C(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F53[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetFloatStatForPlayer
struct UValeriaAccomplishmentsManager_GetFloatStatForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Value;                                             // 0x18(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1C(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F57[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetCurrentTierOfAchievementGroup
struct UValeriaAccomplishmentsManager_GetCurrentTierOfAchievementGroup_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                GroupID;                                           // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x18(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F59[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetCollectionStatForPlayer
struct UValeriaAccomplishmentsManager_GetCollectionStatForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PersistId;                                         // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x1C(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F5C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetBooleanStatForPlayer
struct UValeriaAccomplishmentsManager_GetBooleanStatForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatName;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Value;                                             // 0x18(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x19(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F62[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetAllStatsForPlayer
struct UValeriaAccomplishmentsManager_GetAllStatsForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>           OutStatNameValueTable;                             // 0x8(0x50)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetAchievementsForPlayer
struct UValeriaAccomplishmentsManager_GetAchievementsForPlayer_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FValeriaOnlineAchievement>     ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetAchievementsForNetId
struct UValeriaAccomplishmentsManager_GetAchievementsForNetId_Params
{
public:
	struct FUniqueNetIdRepl                      AccountId;                                         // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FValeriaOnlineAchievement>     ReturnValue;                                       // 0x30(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetAchievementInGroupByTier
struct UValeriaAccomplishmentsManager_GetAchievementInGroupByTier_Params
{
public:
	int32                                        Tier;                                              // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F68[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                GroupID;                                           // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ReturnValue;                                       // 0x18(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetAchievementGroup
struct UValeriaAccomplishmentsManager_GetAchievementGroup_Params
{
public:
	class FString                                AccomplishmentId;                                  // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                GroupID;                                           // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                        ReturnValue;                                       // 0x20(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetAchievementDefinitions
struct UValeriaAccomplishmentsManager_GetAchievementDefinitions_Params
{
public:
	TArray<struct FValeriaOnlineAchievementDefinition> ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0xB8 (0xB8 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.GetAchievementDefinition
struct UValeriaAccomplishmentsManager_GetAchievementDefinition_Params
{
public:
	class FString                                AchievementID;                                     // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FValeriaOnlineAchievementDefinition   ReturnValue;                                       // 0x10(0xA8)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaAccomplishmentsManager.CanPlayerRedeemAchievement
struct UValeriaAccomplishmentsManager_CanPlayerRedeemAchievement_Params
{
public:
	class APlayerController*                     Player;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                AchievementID;                                     // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F6E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Palia.Activatable.IsActive
struct IActivatable_IsActive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.Activatable.Deactivate
struct IActivatable_Deactivate_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.Activatable.CanActivate
struct IActivatable_CanActivate_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.Activatable.Activate
struct IActivatable_Activate_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function Palia.ActivationManager.PerformActivation
struct AActivationManager_PerformActivation_Params
{
public:
	int32                                        NumToActivate;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.ActorSpawnPointsManager.RemoveSpawnPoint
struct UActorSpawnPointsManager_RemoveSpawnPoint_Params
{
public:
	class AActor*                                SpawnPointActor;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.ActorSpawnPointsManager.OnSpawnPointActorDestroyed
struct UActorSpawnPointsManager_OnSpawnPointActorDestroyed_Params
{
public:
	class AActor*                                SpawnPointActor;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.ActorSpawnPointsManager.OnOccupierActorDestroyed
struct UActorSpawnPointsManager_OnOccupierActorDestroyed_Params
{
public:
	class AActor*                                OccupierActor;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.ActorTagComponent.OnRep_TagValues
struct UActorTagComponent_OnRep_TagValues_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function Palia.ActorTagComponent.GetTagValue
struct UActorTagComponent_GetTagValue_Params
{
public:
	struct FGameplayTag                          Tag;                                               // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ActorTestHarnessComponent.StartLoadTestClient
struct UActorTestHarnessComponent_StartLoadTestClient_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ActorTestHarnessComponent.OnTestStopped
struct UActorTestHarnessComponent_OnTestStopped_Params
{
public:
	class FString                                TestCase;                                          // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ActorTestHarnessComponent.OnTestStarted
struct UActorTestHarnessComponent_OnTestStarted_Params
{
public:
	class FString                                TestCase;                                          // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.AICombatStateComponent.WipeThreatList
struct UAICombatStateComponent_WipeThreatList_Params
{
public:
};

// 0x50 (0x50 - 0x0)
// Function Palia.AICombatStateComponent.WasDamaged
struct UAICombatStateComponent_WasDamaged_Params
{
public:
	class UVitalsComponent*                      VitalsComp;                                        // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVitalsChange                         Change;                                            // 0x8(0x48)(Parm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.AICombatStateComponent.TickThreatList
struct UAICombatStateComponent_TickThreatList_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function Palia.AICombatStateComponent.SetThreat
struct UAICombatStateComponent_SetThreat_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Threat;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F96[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Palia.AICombatStateComponent.SetIsInCombat
struct UAICombatStateComponent_SetIsInCombat_Params
{
public:
	bool                                         IsInCombat;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.AICombatStateComponent.Server_DrawMeleeAttackFeedback
struct UAICombatStateComponent_Server_DrawMeleeAttackFeedback_Params
{
public:
	class FName                                  SocketName;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function Palia.AICombatStateComponent.OverwriteThreatList
struct UAICombatStateComponent_OverwriteThreatList_Params
{
public:
	struct FAIThreatList                         NewThreatList;                                     // 0x0(0x50)(Parm, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.AICombatStateComponent.Multicast_DrawMeleeAttackFeedback
struct UAICombatStateComponent_Multicast_DrawMeleeAttackFeedback_Params
{
public:
	class FName                                  SocketName;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AICombatStateComponent.IsOnThreatList
struct UAICombatStateComponent_IsOnThreatList_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F9B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Palia.AICombatStateComponent.IsInCombat
struct UAICombatStateComponent_IsInCombat_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.AICombatStateComponent.IsAbilityActive
struct UAICombatStateComponent_IsAbilityActive_Params
{
public:
	int32                                        AbilityId;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FA0[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// Function Palia.AICombatStateComponent.GetThreatList
struct UAICombatStateComponent_GetThreatList_Params
{
public:
	struct FAIThreatList                         ReturnValue;                                       // 0x0(0x50)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.AICombatStateComponent.GetThreatCount
struct UAICombatStateComponent_GetThreatCount_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.AICombatStateComponent.GetSpeed
struct UAICombatStateComponent_GetSpeed_Params
{
public:
	class FName                                  Key;                                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.AICombatStateComponent.GetHighestThreatReplicatedToClient
struct UAICombatStateComponent_GetHighestThreatReplicatedToClient_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AICombatStateComponent.GetDebugString
struct UAICombatStateComponent_GetDebugString_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.AICombatStateComponent.GetClosestThreat
struct UAICombatStateComponent_GetClosestThreat_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function Palia.AICombatStateComponent.GetBehaviourRanges
struct UAICombatStateComponent_GetBehaviourRanges_Params
{
public:
	struct FAIBehaviourRanges                    ReturnValue;                                       // 0x0(0x40)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.AICombatStateComponent.GetAwarenessRadius
struct UAICombatStateComponent_GetAwarenessRadius_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.AICombatStateComponent.FindTarget
struct UAICombatStateComponent_FindTarget_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AICombatStateComponent.FindBestAbility
struct UAICombatStateComponent_FindBestAbility_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EValeriaFuncResult                OutResult;                                         // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FAB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0xC(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.AICombatStateComponent.DeactivateAbilitiesOutOfRange
struct UAICombatStateComponent_DeactivateAbilitiesOutOfRange_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.AICombatStateComponent.CanMoveDuringAbility
struct UAICombatStateComponent_CanMoveDuringAbility_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AICombatStateComponent.AddThreat
struct UAICombatStateComponent_AddThreat_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Threat;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FAC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.AICombatStateComponent.AddCharacterToThreatList
struct UAICombatStateComponent_AddCharacterToThreatList_Params
{
public:
	class AValeriaCharacter*                     Character;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SendToTopOfThreatList;                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FAE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.AICombatStateComponent.ActivateAbility
struct UAICombatStateComponent_ActivateAbility_Params
{
public:
	int32                                        AbilityId;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FB1[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x2 (0x2 - 0x0)
// Function Palia.AimingComponent.SetAimingState
struct UAimingComponent_SetAimingState_Params
{
public:
	enum class EAimingState                      NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAimingAnimationAimOffset         Offset;                                            // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.AimingComponent.RemoveQueuedUpWeaponFire
struct UAimingComponent_RemoveQueuedUpWeaponFire_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.AimingComponent.QueueUpWeaponFire
struct UAimingComponent_QueueUpWeaponFire_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.AimingComponent.NotifyEndAiming
struct UAimingComponent_NotifyEndAiming_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.AimingComponent.NotifyBeginAiming
struct UAimingComponent_NotifyBeginAiming_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.AimingComponent.IsAiming
struct UAimingComponent_IsAiming_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.AimingComponent.HasQueuedUpWeaponFire
struct UAimingComponent_HasQueuedUpWeaponFire_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.AimingComponent.GetAnimationAimOffsetToUse
struct UAimingComponent_GetAnimationAimOffsetToUse_Params
{
public:
	enum class EAimingAnimationAimOffset         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.AimingComponent.GetAimPitchDirection
struct UAimingComponent_GetAimPitchDirection_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.AimingComponent.GetAimingState
struct UAimingComponent_GetAimingState_Params
{
public:
	enum class EAimingState                      ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.AISense_ValeriaHearing.ReportValeriaNoiseEvent
struct UAISense_ValeriaHearing_ReportValeriaNoiseEvent_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               NoiseLocation;                                     // 0x8(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Instigator;                                        // 0x20(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EValeriaNoiseEventVolume          Volume;                                            // 0x28(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FC8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        StealthMask;                                       // 0x2C(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Tag;                                               // 0x30(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.AkCulledComponent.Update
struct UAkCulledComponent_Update_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function Palia.AkCulledComponent.Stop
struct UAkCulledComponent_Stop_Params
{
public:
	int32                                        FadeDuration;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.AkCulledComponent.Start
struct UAkCulledComponent_Start_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.AkCulledComponent.SpawnAkComponent
struct UAkCulledComponent_SpawnAkComponent_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function Palia.AkCulledComponent.RemoveAkComponent
struct UAkCulledComponent_RemoveAkComponent_Params
{
public:
	int32                                        FadeDuration;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.AkCulledComponent.GetCullRadius
struct UAkCulledComponent_GetCullRadius_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.AkCulledComponent.GetAttenuationRadius
struct UAkCulledComponent_GetAttenuationRadius_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.AkEventDebugActor.OnFinishedPlaying
struct AAkEventDebugActor_OnFinishedPlaying_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.AkEventDebugActor.DestroySelf
struct AAkEventDebugActor_DestroySelf_Params
{
public:
};

// 0x1C (0x1C - 0x0)
// Function Palia.AnimStateFunctions.IsIdle
struct UAnimStateFunctions_IsIdle_Params
{
public:
	struct FAnimState                            AnimState;                                         // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FE6[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1C (0x1C - 0x0)
// Function Palia.AnimStateFunctions.IsEmpty
struct UAnimStateFunctions_IsEmpty_Params
{
public:
	struct FAnimState                            AnimState;                                         // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FE8[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// Function Palia.ArcadeCommandComponent.SendArcadeGameCommand
struct UArcadeCommandComponent_SendArcadeGameCommand_Params
{
public:
	struct FArcadeGameCommand                    Command;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function Palia.ArcadeCommandComponent.RpcServer_SendArcadeGameCommand
struct UArcadeCommandComponent_RpcServer_SendArcadeGameCommand_Params
{
public:
	struct FArcadeGameCommand                    Command;                                           // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ArcadeCommandComponent.RpcClient_SendLeaderboardScores
struct UArcadeCommandComponent_RpcClient_SendLeaderboardScores_Params
{
public:
	TArray<struct FArcadeLeaderboardEntry>       Scores;                                            // 0x0(0x10)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Palia.ArcadeCommandComponent.ConsumeArcadeInputState
struct UArcadeCommandComponent_ConsumeArcadeInputState_Params
{
public:
	struct FArcadeInputState                     ReturnValue;                                       // 0x0(0x30)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.SubgameConfig.IsSubgameValid
struct USubgameConfig_IsSubgameValid_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FFD[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Palia.ArcadeMachineActor.ViewingOthersIsEnabled
struct AArcadeMachineActor_ViewingOthersIsEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.ArcadeMachineActor.OnCurrentReplayInputsChanged
struct AArcadeMachineActor_OnCurrentReplayInputsChanged_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.ArcadeMachineActor.IsMachineLocked
struct AArcadeMachineActor_IsMachineLocked_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.ArcadeMachineActor.GetNumberOfReplayInputsToConsume
struct AArcadeMachineActor_GetNumberOfReplayInputsToConsume_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ArcadeMachineActor.GetCurrentReplayGuid
struct AArcadeMachineActor_GetCurrentReplayGuid_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// Function Palia.ArcadeMachineActor.ConvertReplayGuidToSeed
struct AArcadeMachineActor_ConvertReplayGuidToSeed_Params
{
public:
	struct FGuid                                 Guid;                                              // 0x0(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x10(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Palia.ArcadeMachineActor.ConsumeReplayInput
struct AArcadeMachineActor_ConsumeReplayInput_Params
{
public:
	struct FArcadeInputState                     ReturnValue;                                       // 0x0(0x30)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.ArcadeMachineActor.Client_OnReplayInputReplicated
struct AArcadeMachineActor_Client_OnReplayInputReplicated_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function Palia.ArcadeMachineBase.SetArcadeMachineHighScoreTag
struct AArcadeMachineBase_SetArcadeMachineHighScoreTag_Params
{
public:
	struct FGameplayTag                          InGameplayTag;                                     // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.ArcadeMachineBase.LoadLeaderboardScores
struct AArcadeMachineBase_LoadLeaderboardScores_Params
{
public:
	int32                                        NumScoresToRetrieve;                               // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ArcadeMachineBase.AddLeaderboardScore
struct AArcadeMachineBase_AddLeaderboardScore_Params
{
public:
	class AValeriaCharacter*                     InCharacter;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InScore;                                           // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_202D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function Palia.ArcadeMachineBase.AddLeaderboardEntryToSortedArray
struct AArcadeMachineBase_AddLeaderboardEntryToSortedArray_Params
{
public:
	TArray<struct FArcadeLeaderboardEntry>       Leaderboard;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FArcadeLeaderboardEntry               Entry;                                             // 0x10(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.SubgameManagerComponent.TransitionToSubgameCamera
struct USubgameManagerComponent_TransitionToSubgameCamera_Params
{
public:
	class AValeriaPlayerController*              ValeriaPlayerController;                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.SubgameManagerComponent.TransitionBackToMainCamera
struct USubgameManagerComponent_TransitionBackToMainCamera_Params
{
public:
	class AValeriaPlayerController*              ValeriaPlayerController;                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.SubgameManagerComponent.RemoveAllCharacters
struct USubgameManagerComponent_RemoveAllCharacters_Params
{
public:
	enum class ESubgameResult                    InSubgameResult;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.SubgameManagerComponent.InitializeSubgame
struct USubgameManagerComponent_InitializeSubgame_Params
{
public:
	class USubgameConfig*                        InSubgameConfig;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaCharacter*                     CreatingCharacter;                                 // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.SubgameManagerComponent.GetSubgameState
struct USubgameManagerComponent_GetSubgameState_Params
{
public:
	enum class ESubgameState                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.SubgameManagerComponent.GetNumActivePlayingCharacters
struct USubgameManagerComponent_GetNumActivePlayingCharacters_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.SubgameManagerComponent.ExitSubgame
struct USubgameManagerComponent_ExitSubgame_Params
{
public:
	class AValeriaCharacter*                     ExitingCharacter;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESubgameResult                    SubgameResult;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_204D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.SubgameManagerComponent.EnterSubgame
struct USubgameManagerComponent_EnterSubgame_Params
{
public:
	class AValeriaCharacter*                     EnteringCharacter;                                 // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.SubgameManagerComponent.DestroyAfterDelay
struct USubgameManagerComponent_DestroyAfterDelay_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.SubgameManagerComponent.CompleteSubgame
struct USubgameManagerComponent_CompleteSubgame_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.SubgameManagerComponent.BPNE_ShouldFadeToBlackOnCameraChange
struct USubgameManagerComponent_BPNE_ShouldFadeToBlackOnCameraChange_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.SubgameManagerComponent.BPNE_GetSubgameCameraActor
struct USubgameManagerComponent_BPNE_GetSubgameCameraActor_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.SubgameManagerComponent.BPIE_CompleteSubgame
struct USubgameManagerComponent_BPIE_CompleteSubgame_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function Palia.SubgameManagerComponent.BPIE_CharacterExitedSubgame
struct USubgameManagerComponent_BPIE_CharacterExitedSubgame_Params
{
public:
	class AValeriaCharacter*                     EnteringCharacter;                                 // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESubgameResult                    SubgameResult;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_206A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.SubgameManagerComponent.BPIE_CharacterEnteredSubgame
struct USubgameManagerComponent_BPIE_CharacterEnteredSubgame_Params
{
public:
	class AValeriaCharacter*                     EnteringCharacter;                                 // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.SubgameManagerComponent.BPIE_BeginSubgame
struct USubgameManagerComponent_BPIE_BeginSubgame_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.SubgameManagerComponent.BeginSubgame
struct USubgameManagerComponent_BeginSubgame_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function Palia.ArraySorter.Sort
struct UArraySorter_Sort_Params
{
public:
	int32                                        NumberOfElements;                                  // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ArraySorter.SetCompareResult
struct UArraySorter_SetCompareResult_Params
{
public:
	bool                                         IsLeftLessThanRight;                               // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.AudioFoliageManagerComponent.SortVectorsByClosest
struct UAudioFoliageManagerComponent_SortVectorsByClosest_Params
{
public:
	TArray<struct FVector>                       Vectors;                                           // 0x0(0x10)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                               Center;                                            // 0x10(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                       ReturnValue;                                       // 0x28(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.AudioManager.UnregisterDebugActor
struct UAudioManager_UnregisterDebugActor_Params
{
public:
	int32                                        PlayingID;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.AudioManager.SetDebugDisplayStatus
struct UAudioManager_SetDebugDisplayStatus_Params
{
public:
	bool                                         bShowDebugInfo;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.AudioManager.SetDebugDisplayOutOfRange
struct UAudioManager_SetDebugDisplayOutOfRange_Params
{
public:
	bool                                         bShowDebugInfo;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.AudioManager.OnAAkEventDebugActorDestroyed
struct UAudioManager_OnAAkEventDebugActorDestroyed_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.AuthManager.StartUnlink
struct UAuthManager_StartUnlink_Params
{
public:
};

// 0x68 (0x68 - 0x0)
// Function Palia.AuthManager.StartRegisterUser
struct UAuthManager_StartRegisterUser_Params
{
public:
	struct FValeriaUserDTO                       NewUserDTO;                                        // 0x0(0x68)(Parm, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function Palia.AuthManager.StartLoginResetUser
struct UAuthManager_StartLoginResetUser_Params
{
public:
	struct FValeriaUserDTO                       LoginData;                                         // 0x0(0x68)(Parm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.AuthManager.StartLogin
struct UAuthManager_StartLogin_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.AuthManager.StartLink
struct UAuthManager_StartLink_Params
{
public:
	bool                                         bUseHeadlessAccount;                               // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AuthManager.SetPassword
struct UAuthManager_SetPassword_Params
{
public:
	class FString                                Password;                                          // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AuthManager.SetAccountUsername
struct UAuthManager_SetAccountUsername_Params
{
public:
	class FString                                AccountUsername;                                   // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AuthManager.QuickRegisterUser
struct UAuthManager_QuickRegisterUser_Params
{
public:
	class FString                                NewUserName;                                       // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Palia.AuthManager.OnJWTTokenRefreshCompleted__DelegateSignature
struct UAuthManager_OnJWTTokenRefreshCompleted__DelegateSignature_Params
{
public:
	bool                                         bSucceeded;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20BC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ErrorCode;                                         // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function Palia.AuthManager.LoginResetHandler
struct UAuthManager_LoginResetHandler_Params
{
public:
	int32                                        ForLocalUserNum;                                   // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasSuccessful;                                    // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20C3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FValeriaUserDTO                       ResultsData;                                       // 0x8(0x68)(Parm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.AuthManager.IsLoggedIn
struct UAuthManager_IsLoggedIn_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.AuthManager.HasValidJWT
struct UAuthManager_HasValidJWT_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function Palia.AuthManager.HandleRegisterAccountSucceeded
struct UAuthManager_HandleRegisterAccountSucceeded_Params
{
public:
	int32                                        ForLocalUserNum;                                   // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20D4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FValeriaUserDTO                       NewUser;                                           // 0x8(0x68)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Palia.AuthManager.HandleRegisterAccountFailed
struct UAuthManager_HandleRegisterAccountFailed_Params
{
public:
	int32                                        ForLocalUserNum;                                   // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20DD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ErrorMessage;                                      // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Palia.AuthManager.HandleOnPlatformUnlinked
struct UAuthManager_HandleOnPlatformUnlinked_Params
{
public:
	int32                                        ForLocalUserNum;                                   // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasSuccessful;                                    // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20E4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 InAccountId;                                       // 0x8(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ErrorMessage;                                      // 0x18(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ErrorCode;                                         // 0x28(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20E5[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// Function Palia.AuthManager.HandleOnPlatformLoggedIn
struct UAuthManager_HandleOnPlatformLoggedIn_Params
{
public:
	int32                                        ForLocalUserNum;                                   // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         WasSuccessful;                                     // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20F3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 InAccountId;                                       // 0x8(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                InAccountUsername;                                 // 0x18(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ErrorMessage;                                      // 0x28(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ErrorCode;                                         // 0x38(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20F5[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// Function Palia.AuthManager.HandleOnPlatformLinked
struct UAuthManager_HandleOnPlatformLinked_Params
{
public:
	int32                                        ForLocalUserNum;                                   // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasSuccessful;                                    // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2100[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 InAccountId;                                       // 0x8(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                InAccountUsername;                                 // 0x18(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ErrorMessage;                                      // 0x28(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ErrorCode;                                         // 0x38(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2102[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// Function Palia.AuthManager.HandleOnCharacterSelected
struct UAuthManager_HandleOnCharacterSelected_Params
{
public:
	struct FOSSVAL_SelectedCharacter             SelectedCharacter;                                 // 0x0(0x40)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.AuthManager.GetValidJWTTokenErrorCode
struct UAuthManager_GetValidJWTTokenErrorCode_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Palia.AuthManager.GetNetId
struct UAuthManager_GetNetId_Params
{
public:
	struct FUniqueNetIdRepl                      ReturnValue;                                       // 0x0(0x30)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AuthManager.GetCharacterName
struct UAuthManager_GetCharacterName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AuthManager.GetCharacterId
struct UAuthManager_GetCharacterId_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AuthManager.GetAccountUsername
struct UAuthManager_GetAccountUsername_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AuthManager.GetAccountId
struct UAuthManager_GetAccountId_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.AuthManager.GenerateRandomUserName
struct UAuthManager_GenerateRandomUserName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Palia.AuthManager.FakeLogin
struct UAuthManager_FakeLogin_Params
{
public:
	int32                                        LocalUserNum;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2110[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                AccountUsername;                                   // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CharacterName;                                     // 0x18(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Palia.AuthManager.ChangeCharacter
struct UAuthManager_ChangeCharacter_Params
{
public:
	class FString                                CharacterName;                                     // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Nickname;                                          // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x7A0 (0x7A0 - 0x0)
// Function Palia.VAL_BingoBoardgamePlayerComponent.TryGetBingoBoardgameData
struct UVAL_BingoBoardgamePlayerComponent_TryGetBingoBoardgameData_Params
{
public:
	struct FBingoBoardTemplateData               OutBingoBoardTemplate;                             // 0x0(0x728)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FBingoBoardgameState                  OutBingoBoardgameState;                            // 0x728(0x70)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bAllowFetch;                                       // 0x798(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x799(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_212D[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// Function Palia.VAL_BingoBoardgamePlayerComponent.ServerMakeRequest_ContributeItems
struct UVAL_BingoBoardgamePlayerComponent_ServerMakeRequest_ContributeItems_Params
{
public:
	int32                                        BingoCellIndex;                                    // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_213D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x8(0x30)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Quantity;                                          // 0x38(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 RequestId;                                         // 0x3C(0x10)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2140[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function Palia.VAL_BingoBoardgamePlayerComponent.ServerFetchBingoBoardData
struct UVAL_BingoBoardgamePlayerComponent_ServerFetchBingoBoardData_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.VAL_BingoBoardgamePlayerComponent.OnRep_BingoBoardgameReplicatedState
struct UVAL_BingoBoardgamePlayerComponent_OnRep_BingoBoardgameReplicatedState_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Palia.VAL_BingoBoardgamePlayerComponent.OnBingoBoardgameDataUpdated__DelegateSignature
struct UVAL_BingoBoardgamePlayerComponent_OnBingoBoardgameDataUpdated__DelegateSignature_Params
{
public:
	class UVAL_BingoBoardgamePlayerComponent*    BingoBoardgamePlayerComponent;                     // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.VAL_BingoBoardgamePlayerComponent.HandlePlayerStateIdentityInitialized
struct UVAL_BingoBoardgamePlayerComponent_HandlePlayerStateIdentityInitialized_Params
{
public:
	class AVAL_PlayerState*                      PlayerState;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.VAL_BingoBoardgamePlayerComponent.FetchBingoBoardData
struct UVAL_BingoBoardgamePlayerComponent_FetchBingoBoardData_Params
{
public:
};

// 0x60 (0x60 - 0x0)
// Function Palia.VAL_BingoBoardgamePlayerComponent.ContributeItems
struct UVAL_BingoBoardgamePlayerComponent_ContributeItems_Params
{
public:
	int32                                        BingoCellIndex;                                    // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2163[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x8(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Quantity;                                          // 0x38(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x3C(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x4C(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2165[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// Function Palia.VAL_BingoBoardgamePlayerComponent.ClientReceiveResponse_ContributeItems_Success
struct UVAL_BingoBoardgamePlayerComponent_ClientReceiveResponse_ContributeItems_Success_Params
{
public:
	struct FGuid                                 RequestId;                                         // 0x0(0x10)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x10(0x30)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BingoCellIndex;                                    // 0x40(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UpdatedTotal;                                      // 0x44(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ContributedQuantity;                               // 0x48(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2171[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function Palia.VAL_BingoBoardgamePlayerComponent.ClientReceiveResponse_ContributeItems_Failure
struct UVAL_BingoBoardgamePlayerComponent_ClientReceiveResponse_ContributeItems_Failure_Params
{
public:
	struct FGuid                                 RequestId;                                         // 0x0(0x10)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ErrorMessage;                                      // 0x10(0x18)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x780 (0x780 - 0x0)
// Function Palia.VAL_BingoBoardgameBlueprintFunctionLibrary.TryGetBingoCellFromTemplateByIndex
struct UVAL_BingoBoardgameBlueprintFunctionLibrary_TryGetBingoCellFromTemplateByIndex_Params
{
public:
	struct FBingoBoardTemplateData               Template;                                          // 0x0(0x728)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x728(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2184[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBingoBoardGridCellTemplate           OutBingoCell;                                      // 0x730(0x48)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x778(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2185[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x780 (0x780 - 0x0)
// Function Palia.VAL_BingoBoardgameBlueprintFunctionLibrary.TryGetBingoCellFromTemplateByCartesian
struct UVAL_BingoBoardgameBlueprintFunctionLibrary_TryGetBingoCellFromTemplateByCartesian_Params
{
public:
	struct FBingoBoardTemplateData               Template;                                          // 0x0(0x728)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                        ColumnIndex;                                       // 0x728(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RowIndex;                                          // 0x72C(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBingoBoardGridCellTemplate           OutBingoCell;                                      // 0x730(0x48)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x778(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2188[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x80 (0x80 - 0x0)
// Function Palia.VAL_BingoBoardgameBlueprintFunctionLibrary.TryGetBingoCellFromBoardgameStateByIndex
struct UVAL_BingoBoardgameBlueprintFunctionLibrary_TryGetBingoCellFromBoardgameStateByIndex_Params
{
public:
	struct FBingoBoardgameState                  BoardgameState;                                    // 0x0(0x70)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x70(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OutProgress;                                       // 0x74(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x78(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_218B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x80 (0x80 - 0x0)
// Function Palia.VAL_BingoBoardgameBlueprintFunctionLibrary.TryGetBingoCellFromBoardgameStateByCartesian
struct UVAL_BingoBoardgameBlueprintFunctionLibrary_TryGetBingoCellFromBoardgameStateByCartesian_Params
{
public:
	struct FBingoBoardgameState                  BoardgameState;                                    // 0x0(0x70)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        ColumnIndex;                                       // 0x70(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RowIndex;                                          // 0x74(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OutProgress;                                       // 0x78(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x7C(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_218D[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Palia.VAL_BingoBoardgameBlueprintFunctionLibrary.IsBillboardQuestsFeatureEnabled
struct UVAL_BingoBoardgameBlueprintFunctionLibrary_IsBillboardQuestsFeatureEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.VAL_BingoBoardgameBlueprintFunctionLibrary.GetBingoCellIndexFromCartesian
struct UVAL_BingoBoardgameBlueprintFunctionLibrary_GetBingoCellIndexFromCartesian_Params
{
public:
	int32                                        ColumnIndex;                                       // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RowIndex;                                          // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.VAL_BingoBoardgameBlueprintFunctionLibrary.GetBingoCellCartesianFromIndex
struct UVAL_BingoBoardgameBlueprintFunctionLibrary_GetBingoCellCartesianFromIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OutColumnIndex;                                    // 0x4(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OutRowIndex;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.VAL_BingoBoardgameBlueprintFunctionLibrary.GetBingoBoardSquareSize
struct UVAL_BingoBoardgameBlueprintFunctionLibrary_GetBingoBoardSquareSize_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.VAL_BingoBoardgameBlueprintFunctionLibrary.GetBingoBoardLinearArraySize
struct UVAL_BingoBoardgameBlueprintFunctionLibrary_GetBingoBoardLinearArraySize_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.BTTask_CreatureEscape.HandleFinishedDespawnDelay
struct UBTTask_CreatureEscape_HandleFinishedDespawnDelay_Params
{
public:
	class UBehaviorTreeComponent*                OwnerComp;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.BTTask_CreatureEscape.HandleEscapeDestinationLost
struct UBTTask_CreatureEscape_HandleEscapeDestinationLost_Params
{
public:
	class UBehaviorTreeComponent*                OwnerComp;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.BTTask_CreatureEscape.HandleArrivedAtEscapeDestination
struct UBTTask_CreatureEscape_HandleArrivedAtEscapeDestination_Params
{
public:
	class UBehaviorTreeComponent*                OwnerComp;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.BTTask_CreatureSpecialAbility.HandleFinishedSpecialAbility
struct UBTTask_CreatureSpecialAbility_HandleFinishedSpecialAbility_Params
{
public:
	class UBehaviorTreeComponent*                OwnerComp;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.BuffComponent.RpcServer_ForceRemoveBuffInstance
struct UBuffComponent_RpcServer_ForceRemoveBuffInstance_Params
{
public:
	int32                                        BuffInstanceId;                                    // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.BuffComponent.RpcServer_CheatClearAllBuffs
struct UBuffComponent_RpcServer_CheatClearAllBuffs_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function Palia.BuffComponent.RpcServer_AddSlimeTrailDebuff
struct UBuffComponent_RpcServer_AddSlimeTrailDebuff_Params
{
public:
	int32                                        SlimeTier;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.BuffComponent.RemoveBuffInstance
struct UBuffComponent_RemoveBuffInstance_Params
{
public:
	int32                                        InstanceId;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21BD[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.BuffComponent.RemoveBuffByConfig
struct UBuffComponent_RemoveBuffByConfig_Params
{
public:
	int32                                        BuffConfigId;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21C0[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function Palia.BuffComponent.OnReplicatedAndShouldBroadcast
struct UBuffComponent_OnReplicatedAndShouldBroadcast_Params
{
public:
};

// 0x50 (0x50 - 0x0)
// Function Palia.BuffComponent.GetPercentUsedFromActivation
struct UBuffComponent_GetPercentUsedFromActivation_Params
{
public:
	struct FBuffActivation                       BuffActivation;                                    // 0x0(0x48)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x48(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21C4[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.BuffComponent.GetPercentUsed
struct UBuffComponent_GetPercentUsed_Params
{
public:
	int32                                        InstanceId;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.BuffComponent.GetInstanceId
struct UBuffComponent_GetInstanceId_Params
{
public:
	int32                                        BuffConfigId;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.BuffComponent.GetEffectQuantifier
struct UBuffComponent_GetEffectQuantifier_Params
{
public:
	enum class EBuffEffect                       Effect;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21CA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.BuffComponent.Client_ForceRemoveBuffInstance
struct UBuffComponent_Client_ForceRemoveBuffInstance_Params
{
public:
	int32                                        BuffInstanceId;                                    // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.BuffComponent.Client_AddSlimeTrailDebuff
struct UBuffComponent_Client_AddSlimeTrailDebuff_Params
{
public:
	int32                                        SlimeTier;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.BuffComponent.BuffIsActive
struct UBuffComponent_BuffIsActive_Params
{
public:
	int32                                        InstanceId;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21CF[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Palia.BuffComponent.ApplyEffectQuantifier
struct UBuffComponent_ApplyEffectQuantifier_Params
{
public:
	enum class EBuffEffect                       Effect;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21E6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Base;                                              // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.BuffComponent.AddBuff
struct UBuffComponent_AddBuff_Params
{
public:
	int32                                        BuffConfigId;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.ValeriaMoveablePawn.StopMontageByMapping
struct AValeriaMoveablePawn_StopMontageByMapping_Params
{
public:
	class FName                                  MappingName;                                       // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.ValeriaMoveablePawn.StopJumping
struct AValeriaMoveablePawn_StopJumping_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function Palia.ValeriaMoveablePawn.StopAnimMontage
struct AValeriaMoveablePawn_StopAnimMontage_Params
{
public:
	class UAnimMontage*                          AnimMontage;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.ValeriaMoveablePawn.ResyncMesh
struct AValeriaMoveablePawn_ResyncMesh_Params
{
public:
	float                                        Duration;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.ValeriaMoveablePawn.PlayMontageByMapping
struct AValeriaMoveablePawn_PlayMontageByMapping_Params
{
public:
	class FName                                  MappingName;                                       // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InPlayRate;                                        // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  StartSectionName;                                  // 0xC(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanHardJump;                                      // 0x14(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2212[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Palia.ValeriaMoveablePawn.PlayAnimMontage
struct AValeriaMoveablePawn_PlayAnimMontage_Params
{
public:
	class UAnimMontage*                          AnimMontage;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InPlayRate;                                        // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  StartSectionName;                                  // 0xC(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x14(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function Palia.ValeriaMoveablePawn.OnWalkingOffLedge
struct AValeriaMoveablePawn_OnWalkingOffLedge_Params
{
public:
	struct FVector                               PreviousFloorImpactNormal;                         // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               PreviousFloorContactNormal;                        // 0x18(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               PreviousLocation;                                  // 0x30(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeDelta;                                         // 0x48(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2215[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function Palia.ValeriaMoveablePawn.OnRep_ReplicatedBasedMovement
struct AValeriaMoveablePawn_OnRep_ReplicatedBasedMovement_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaMoveablePawn.OnLaunched
struct AValeriaMoveablePawn_OnLaunched_Params
{
public:
	struct FVector                               LaunchVelocity;                                    // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bXYOverride;                                       // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bZOverride;                                        // 0x19(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2218[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xE8 (0xE8 - 0x0)
// Function Palia.ValeriaMoveablePawn.OnLanded
struct AValeriaMoveablePawn_OnLanded_Params
{
public:
	struct FHitResult                            Hit;                                               // 0x0(0xE8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.ValeriaMoveablePawn.OnJumped
struct AValeriaMoveablePawn_OnJumped_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function Palia.ValeriaMoveablePawn.LaunchCharacter
struct AValeriaMoveablePawn_LaunchCharacter_Params
{
public:
	struct FVector                               LaunchVelocity;                                    // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bXYOverride;                                       // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bZOverride;                                        // 0x19(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2222[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function Palia.ValeriaMoveablePawn.K2_UpdateCustomMovement
struct AValeriaMoveablePawn_K2_UpdateCustomMovement_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.ValeriaMoveablePawn.K2_OnMovementModeChanged
struct AValeriaMoveablePawn_K2_OnMovementModeChanged_Params
{
public:
	enum class EMovementMode                     PrevMovementMode;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMovementMode                     NewMovementMode;                                   // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        PrevCustomMode;                                    // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        NewCustomMode;                                     // 0x3(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.ValeriaMoveablePawn.Jump
struct AValeriaMoveablePawn_Jump_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.ValeriaMoveablePawn.IsJumpProvidingForce
struct AValeriaMoveablePawn_IsJumpProvidingForce_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.ValeriaMoveablePawn.GetLastUsedAnimMappingName
struct AValeriaMoveablePawn_GetLastUsedAnimMappingName_Params
{
public:
	class FName                                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.ValeriaMoveablePawn.GetCurrentMontage
struct AValeriaMoveablePawn_GetCurrentMontage_Params
{
public:
	class UAnimMontage*                          ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.ValeriaMoveablePawn.FindMontageByMapping
struct AValeriaMoveablePawn_FindMontageByMapping_Params
{
public:
	class FName                                  MappingName;                                       // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  MappingQualifier;                                  // 0x8(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Palia.ValeriaMoveablePawn.DesyncMesh
struct AValeriaMoveablePawn_DesyncMesh_Params
{
public:
	bool                                         bLocation;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRotation;                                         // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.ValeriaMoveablePawn.ClientCheatWalk
struct AValeriaMoveablePawn_ClientCheatWalk_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.ValeriaMoveablePawn.ClientCheatGhost
struct AValeriaMoveablePawn_ClientCheatGhost_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.ValeriaMoveablePawn.ClientCheatFly
struct AValeriaMoveablePawn_ClientCheatFly_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.ValeriaMoveablePawn.CanJumpInternal
struct AValeriaMoveablePawn_CanJumpInternal_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ValeriaMoveablePawn.CanJump
struct AValeriaMoveablePawn_CanJump_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ValeriaMoveablePawn.ApplyMontageByMappingDelta
struct AValeriaMoveablePawn_ApplyMontageByMappingDelta_Params
{
public:
	class FName                                  NewMappingName;                                    // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  OldMappingName;                                    // 0x8(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CreatureCharacter.TryDoSpecialAbility
struct ACreatureCharacter_TryDoSpecialAbility_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.CreatureCharacter.TriggerCreatureAlert
struct ACreatureCharacter_TriggerCreatureAlert_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.CreatureCharacter.SkipCreatureAlert
struct ACreatureCharacter_SkipCreatureAlert_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function Palia.CreatureCharacter.Server_TryHidingDespawnTelemetry
struct ACreatureCharacter_Server_TryHidingDespawnTelemetry_Params
{
public:
	class AActor*                                HidingSpotActor;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         HiddenSuccessfully;                                // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         DisplacedDifferentCreature;                        // 0x9(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_227A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                DisplacedCreatureClassName;                        // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CreatureCharacter.RpcNetMulticast_TriggerCreatureAlert
struct ACreatureCharacter_RpcNetMulticast_TriggerCreatureAlert_Params
{
public:
};

// 0x30 (0x30 - 0x0)
// Function Palia.CreatureCharacter.RpcNetMulticast_OnPathChanged
struct ACreatureCharacter_RpcNetMulticast_OnPathChanged_Params
{
public:
	struct FVector                               StartPosition;                                     // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               EndPosition;                                       // 0x18(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CreatureCharacter.OnCreatureWasAlerted
struct ACreatureCharacter_OnCreatureWasAlerted_Params
{
public:
};

// 0x30 (0x30 - 0x0)
// Function Palia.CreatureCharacter.OnCreaturesPathChanged
struct ACreatureCharacter_OnCreaturesPathChanged_Params
{
public:
	struct FVector                               StartPosition;                                     // 0x0(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               EndPosition;                                       // 0x18(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.CreatureCharacter.OnCreatureKnockbackStarted
struct ACreatureCharacter_OnCreatureKnockbackStarted_Params
{
public:
	class AActor*                                Attacker;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               KnockBackDirection;                                // 0x8(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               FinalDestination;                                  // 0x20(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CreatureCharacter.NotifyEscapeDestinationLost
struct ACreatureCharacter_NotifyEscapeDestinationLost_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.CreatureCharacter.NotifyEscapeDestinationFound
struct ACreatureCharacter_NotifyEscapeDestinationFound_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.CreatureCharacter.IsDispelActive
struct ACreatureCharacter_IsDispelActive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CreatureCharacter.HasBeenAlerted
struct ACreatureCharacter_HasBeenAlerted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CreatureCharacter.HandleDeathServer
struct ACreatureCharacter_HandleDeathServer_Params
{
public:
	class UDeathComponent*                       DeathComponent;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CreatureCharacter.HandleArrivedAtEscapeDestination
struct ACreatureCharacter_HandleArrivedAtEscapeDestination_Params
{
public:
	struct FAIRequestID                          RequestId;                                         // 0x0(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPathFollowingResult              Result;                                            // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22C9[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.CreatureCharacter.GetVitals
struct ACreatureCharacter_GetVitals_Params
{
public:
	class UVitalsComponent*                      ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.CreatureCharacter.GetQualityStars
struct ACreatureCharacter_GetQualityStars_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CreatureCharacter.GetParticipationTracking
struct ACreatureCharacter_GetParticipationTracking_Params
{
public:
	class UParticipationTrackingComponent*       ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CreatureCharacter.GetHitReact
struct ACreatureCharacter_GetHitReact_Params
{
public:
	class UHitReactComponent*                    ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CreatureCharacter.GetGAS
struct ACreatureCharacter_GetGAS_Params
{
public:
	class UValeriaGASComponent*                  ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CreatureCharacter.GetDespawnComponent
struct ACreatureCharacter_GetDespawnComponent_Params
{
public:
	class UDespawnComponent*                     ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CreatureCharacter.GetDeathComponent
struct ACreatureCharacter_GetDeathComponent_Params
{
public:
	class UDeathComponent*                       ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CreatureCharacter.GetCombatState
struct ACreatureCharacter_GetCombatState_Params
{
public:
	class UAICombatStateComponent*               ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CreatureCharacter.GetAttributeSet
struct ACreatureCharacter_GetAttributeSet_Params
{
public:
	class UValeriaGASAttributeSet*               ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Palia.CreatureCharacter.FindEscapeDestination
struct ACreatureCharacter_FindEscapeDestination_Params
{
public:
	struct FVector                               OutDestination;                                    // 0x0(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22E8[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x130 (0x130 - 0x0)
// Function Palia.CreatureCharacter.DoBehaviorMovement
struct ACreatureCharacter_DoBehaviorMovement_Params
{
public:
	enum class ECurrentBehavior                  NewBehavior;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22F3[0xF];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRootMotionSource_MoveToForce         RootMotionSource;                                  // 0x10(0x120)(Parm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CreatureCharacter.DelayBeforeDespawn
struct ACreatureCharacter_DelayBeforeDespawn_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function Palia.CreatureCharacter.CalculateMaxSpeed
struct ACreatureCharacter_CalculateMaxSpeed_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Palia.BugCatchingCreatureCharacter.IsLODFeatureActive
struct ABugCatchingCreatureCharacter_IsLODFeatureActive_Params
{
public:
	enum class EVAL_BugCatchingLODFeature        Feature;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.BugCatchingCreatureCharacter.HandleOnChangedThrottleBucket
struct ABugCatchingCreatureCharacter_HandleOnChangedThrottleBucket_Params
{
public:
	class UValeriaBaseMovementComponent*         ValeriaMoveComponent;                              // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.BugReportSubsystem.ReportBug
struct UBugReportSubsystem_ReportBug_Params
{
public:
	class FString                                Summary;                                           // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function Palia.BundlesComponent.RpcServer_RemoveAndApplyBundleItems
struct UBundlesComponent_RpcServer_RemoveAndApplyBundleItems_Params
{
public:
	TSoftObjectPtr<class UBundleShrineConfig>    bundleConfigPtr;                                   // 0x0(0x30)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SubBundleId;                                       // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_234D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x38(0x30)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x68(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_234F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.BundlesComponent.RpcServer_InitializeBundle
struct UBundlesComponent_RpcServer_InitializeBundle_Params
{
public:
	class UBundleShrineConfig*                   BundleConfig;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.BundlesComponent.RpcServer_GrantSubBundleRewards
struct UBundlesComponent_RpcServer_GrantSubBundleRewards_Params
{
public:
	TSoftObjectPtr<class UBundleShrineConfig>    bundleConfigPtr;                                   // 0x0(0x30)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SubBundleId;                                       // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2375[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function Palia.BundlesComponent.RpcServer_GrantBundleRewards
struct UBundlesComponent_RpcServer_GrantBundleRewards_Params
{
public:
	TSoftObjectPtr<class UBundleShrineConfig>    bundleConfigPtr;                                   // 0x0(0x30)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.BundlesComponent.RpcClient_SubBundleCompleted
struct UBundlesComponent_RpcClient_SubBundleCompleted_Params
{
public:
	TSoftObjectPtr<class UBundleShrineConfig>    BundleConfig;                                      // 0x0(0x30)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SubBundleId;                                       // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_238C[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function Palia.BundlesComponent.RpcClient_BundleCompleted
struct UBundlesComponent_RpcClient_BundleCompleted_Params
{
public:
	TSoftObjectPtr<class UBundleShrineConfig>    BundleConfig;                                      // 0x0(0x30)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.BundlesComponent.OnRep_BundlePersistBlock
struct UBundlesComponent_OnRep_BundlePersistBlock_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function Palia.BundlesComponent.IsSubBundleRewardGranted
struct UBundlesComponent_IsSubBundleRewardGranted_Params
{
public:
	int32                                        BundleID;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SubBundleId;                                       // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23AA[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.BundlesComponent.IsSubBundleRequirementComplete
struct UBundlesComponent_IsSubBundleRequirementComplete_Params
{
public:
	int32                                        BundleID;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SubBundleId;                                       // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RequirementId;                                     // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23BE[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Palia.BundlesComponent.IsSubBundleComplete
struct UBundlesComponent_IsSubBundleComplete_Params
{
public:
	int32                                        BundleID;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SubBundleId;                                       // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23D2[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.BundlesComponent.IsBundleRewardGranted
struct UBundlesComponent_IsBundleRewardGranted_Params
{
public:
	int32                                        BundleID;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23E1[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.BundlesComponent.IsBundleComplete
struct UBundlesComponent_IsBundleComplete_Params
{
public:
	int32                                        BundleID;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23EC[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.BundlesComponent.GetSubmittedItemCount
struct UBundlesComponent_GetSubmittedItemCount_Params
{
public:
	int32                                        BundleID;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SubBundleId;                                       // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RequirementId;                                     // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0xC(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.BundlesComponent.GetSubBundleRequirementCompletedCount
struct UBundlesComponent_GetSubBundleRequirementCompletedCount_Params
{
public:
	int32                                        BundleID;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SubBundleId;                                       // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function Palia.BundlesComponent.Client_RemoveAndApplyBundleItems
struct UBundlesComponent_Client_RemoveAndApplyBundleItems_Params
{
public:
	TSoftObjectPtr<class UBundleShrineConfig>    bundleConfigPtr;                                   // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SubBundleId;                                       // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2421[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x38(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x68(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EValeriaFuncResult                OutResult;                                         // 0x6C(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x6D(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2425[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.BundlesComponent.Client_InitializeBundle
struct UBundlesComponent_Client_InitializeBundle_Params
{
public:
	class UBundleShrineConfig*                   BundleConfig;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.BundlesComponent.Client_GrantSubBundleRewards
struct UBundlesComponent_Client_GrantSubBundleRewards_Params
{
public:
	TSoftObjectPtr<class UBundleShrineConfig>    bundleConfigPtr;                                   // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SubBundleId;                                       // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EValeriaFuncResult                OutResult;                                         // 0x34(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x35(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2457[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// Function Palia.BundlesComponent.Client_GrantBundleRewards
struct UBundlesComponent_Client_GrantBundleRewards_Params
{
public:
	TSoftObjectPtr<class UBundleShrineConfig>    bundleConfigPtr;                                   // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EValeriaFuncResult                OutResult;                                         // 0x30(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x31(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_246C[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function Palia.BundleVaultComponent.OnServerInteract
struct UBundleVaultComponent_OnServerInteract_Params
{
public:
	class UInteractableComponent*                Interactable;                                      // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaCharacter*                     Character;                                         // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractEventParams                  EventParams;                                       // 0x10(0x18)(Parm, NativeAccessSpecifierPublic)
	struct FServerUseEventResult                 ReturnValue;                                       // 0x28(0x2)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_2492[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// Function Palia.BundleVaultComponent.OnClientInteract
struct UBundleVaultComponent_OnClientInteract_Params
{
public:
	class UInteractableComponent*                Interactable;                                      // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaPlayerController*              Player;                                            // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractEventParams                  EventParams;                                       // 0x10(0x18)(Parm, NativeAccessSpecifierPublic)
	struct FUseEventResult                       ReturnValue;                                       // 0x28(0x10)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Palia.BundleVaultComponent.IsInteractable
struct UBundleVaultComponent_IsInteractable_Params
{
public:
	class AValeriaCharacter*                     Character;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractEventParams                  EventParams;                                       // 0x8(0x18)(Parm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24A0[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x68 (0x68 - 0x0)
// Function Palia.BundleVaultComponent.GetText
struct UBundleVaultComponent_GetText_Params
{
public:
	class AValeriaCharacter*                     Character;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInteractEventIndex               EventIndex;                                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24A3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGetTextParams                        Params;                                            // 0x10(0x50)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x60(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24A5[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function Palia.BurstNetSpeedComponent.DisableBurstOfNetSpeed
struct UBurstNetSpeedComponent_DisableBurstOfNetSpeed_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function Palia.CameraTargetComponent.GetTarget
struct UCameraTargetComponent_GetTarget_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.CameraTargetComponent.Client_TurnAtRate
struct UCameraTargetComponent_Client_TurnAtRate_Params
{
public:
	float                                        Rate;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.CameraTargetComponent.Client_Turn
struct UCameraTargetComponent_Client_Turn_Params
{
public:
	float                                        Rate;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.CameraTargetComponent.Client_LookUpAtRate
struct UCameraTargetComponent_Client_LookUpAtRate_Params
{
public:
	float                                        Rate;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.CameraTargetComponent.Client_LookUp
struct UCameraTargetComponent_Client_LookUp_Params
{
public:
	float                                        Rate;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CapsuleCollisionOverrideComponent.OnReplicatedNotify
struct UCapsuleCollisionOverrideComponent_OnReplicatedNotify_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChallengesSubsystem.GetTimeTillExpiration
struct UChallengesSubsystem_GetTimeTillExpiration_Params
{
public:
	class UObject*                               Context;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                             ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.ChallengesSubsystem.GetDisplayInfo
struct UChallengesSubsystem_GetDisplayInfo_Params
{
public:
	class AValeriaCharacter*                     Character;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChallengeDisplayInfo>         Infos;                                             // 0x8(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.ChapaaChaseManager.TryDropCreatures
struct AChapaaChaseManager_TryDropCreatures_Params
{
public:
	class AValeriaPlayerController*              Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChapaaChaseManager.Stop
struct AChapaaChaseManager_Stop_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChapaaChaseManager.Start
struct AChapaaChaseManager_Start_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChapaaChaseManager.SetState
struct AChapaaChaseManager_SetState_Params
{
public:
	enum class EChappaChaseState                 NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChapaaChaseManager.SetEnableSpawning
struct AChapaaChaseManager_SetEnableSpawning_Params
{
public:
	bool                                         bEnable;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.ChapaaChaseManager.PickUpCreature
struct AChapaaChaseManager_PickUpCreature_Params
{
public:
	class AValeriaPlayerController*              Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACreatureCharacter*                    Creature;                                          // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2510[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChapaaChaseManager.OnRep_CurrentState
struct AChapaaChaseManager_OnRep_CurrentState_Params
{
public:
	enum class EChappaChaseState                 OldState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.ChapaaChaseManager.OnRep_CurrentParticipantInfo
struct AChapaaChaseManager_OnRep_CurrentParticipantInfo_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.ChapaaChaseManager.OnRep_CurrentGameInfo
struct AChapaaChaseManager_OnRep_CurrentGameInfo_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChapaaChaseManager.IsReadyToPlay
struct AChapaaChaseManager_IsReadyToPlay_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Palia.ChapaaChaseManager.IsPlayerParticipating
struct AChapaaChaseManager_IsPlayerParticipating_Params
{
public:
	struct FChapaaChaseParticipant               Player;                                            // 0x0(0x40)(Parm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x40(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2522[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChapaaChaseManager.IsInProgress
struct AChapaaChaseManager_IsInProgress_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.ChapaaChaseManager.Initialize
struct AChapaaChaseManager_Initialize_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function Palia.ChapaaChaseManager.HandleParticipationBoxEndOverlap
struct AChapaaChaseManager_HandleParticipationBoxEndOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComponent;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2532[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x108 (0x108 - 0x0)
// Function Palia.ChapaaChaseManager.HandleParticipationBoxBeginOverlap
struct AChapaaChaseManager_HandleParticipationBoxBeginOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComponent;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFromSweep;                                        // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2543[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            SweepResult;                                       // 0x20(0xE8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.ChapaaChaseManager.HandleCreatureDestroyed
struct AChapaaChaseManager_HandleCreatureDestroyed_Params
{
public:
	class AActor*                                DestroyedActor;                                    // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChapaaChaseManager.GetState
struct AChapaaChaseManager_GetState_Params
{
public:
	enum class EChappaChaseState                 ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChapaaChaseManager.GetPreviousGameSuccess
struct AChapaaChaseManager_GetPreviousGameSuccess_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function Palia.ChapaaChaseManager.GetParticipantInfo
struct AChapaaChaseManager_GetParticipantInfo_Params
{
public:
	class AValeriaPlayerController*              Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChapaaChaseParticipant               OutParticipantInfo;                                // 0x8(0x40)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x48(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2557[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChapaaChaseManager.GetParticipantCreatureHeldCount
struct AChapaaChaseManager_GetParticipantCreatureHeldCount_Params
{
public:
	class AValeriaPlayerController*              InPlayer;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2560[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function Palia.ChapaaChaseManager.GetCurrentGameScore
struct AChapaaChaseManager_GetCurrentGameScore_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.ChapaaChaseManager.GetCurrentGameCaptureGoal
struct AChapaaChaseManager_GetCurrentGameCaptureGoal_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.ChapaaChaseManager.GetCurrentGameCaptureCount
struct AChapaaChaseManager_GetCurrentGameCaptureCount_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChapaaChaseManager.GetCreatureCaptureValue
struct AChapaaChaseManager_GetCreatureCaptureValue_Params
{
public:
	TSubclassOf<class ACreatureCharacter>        InCreatureClass;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2571[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChapaaChaseManager.GetAllParticipantsSorted
struct AChapaaChaseManager_GetAllParticipantsSorted_Params
{
public:
	TArray<struct FChapaaChaseParticipant>       ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChapaaChaseManager.GetAllParticipants
struct AChapaaChaseManager_GetAllParticipants_Params
{
public:
	TArray<struct FChapaaChaseParticipant>       ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChapaaChaseManager.CaptureCreatures
struct AChapaaChaseManager_CaptureCreatures_Params
{
public:
	class AValeriaPlayerController*              Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_257A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Palia.ChapaaChaseManager.CanPickUpCreature
struct AChapaaChaseManager_CanPickUpCreature_Params
{
public:
	class AValeriaPlayerController*              Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACreatureCharacter*                    Creature;                                          // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_257F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// Function Palia.ValeriaItemConfigBlueprintFunctions.FromTorsoConfig
struct UValeriaItemConfigBlueprintFunctions_FromTorsoConfig_Params
{
public:
	class UObject*                               Context;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterCustomizationTorsoConfig    TorsoConfig;                                       // 0x8(0x28)(Parm, NativeAccessSpecifierPublic)
	class UCharacterCustomizationItemConfig*     ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function Palia.ValeriaItemConfigBlueprintFunctions.FromLegsConfig
struct UValeriaItemConfigBlueprintFunctions_FromLegsConfig_Params
{
public:
	class UObject*                               Context;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterCustomizationLegsConfig     LegsConfig;                                        // 0x8(0x30)(Parm, NativeAccessSpecifierPublic)
	class UCharacterCustomizationItemConfig*     ReturnValue;                                       // 0x38(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Palia.ValeriaItemConfigBlueprintFunctions.FromFullBodyConfig
struct UValeriaItemConfigBlueprintFunctions_FromFullBodyConfig_Params
{
public:
	class UObject*                               Context;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterCustomizationFullBodyConfig FullBodyConfig;                                    // 0x8(0x38)(Parm, NativeAccessSpecifierPublic)
	class UCharacterCustomizationItemConfig*     ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x718 (0x718 - 0x0)
// Function Palia.CharacterCustomManager.UpdateCharacter
struct UCharacterCustomManager_UpdateCharacter_Params
{
public:
	struct FVALDTOS_MetaCharacterFormat          CharacterData;                                     // 0x0(0x718)(Parm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.CharacterCustomManager.TryGetAllOurCharacters
struct UCharacterCustomManager_TryGetAllOurCharacters_Params
{
public:
	TArray<struct FVALDTOS_MetaCharacterFormat>  OutOurCharacters;                                  // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25D7[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Palia.CharacterCustomManager.OnRegisterCharacter_Successful__DelegateSignature
struct UCharacterCustomManager_OnRegisterCharacter_Successful__DelegateSignature_Params
{
public:
	class FString                                CharacterName;                                     // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Palia.CharacterCustomManager.OnRegisterCharacter_Failure__DelegateSignature
struct UCharacterCustomManager_OnRegisterCharacter_Failure__DelegateSignature_Params
{
public:
	class FText                                  ErrorMessage;                                      // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	int32                                        ErrorCode;                                         // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25DF[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Palia.CharacterCustomManager.OnRefreshedAllOurCharacters__DelegateSignature
struct UCharacterCustomManager_OnRefreshedAllOurCharacters__DelegateSignature_Params
{
public:
	class UCharacterCustomManager*               CharacterCustomManager;                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Palia.CharacterCustomManager.OnCharacterRenderStudioRegistered__DelegateSignature
struct UCharacterCustomManager_OnCharacterRenderStudioRegistered__DelegateSignature_Params
{
public:
	class AVAL_CharacterRenderStudio*            Studio;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CharacterCustomManager.GetColorsDataAsset
struct UCharacterCustomManager_GetColorsDataAsset_Params
{
public:
	class UVAL_CharacterCustomization_ColorsDataAsset* ReturnValue;                                       // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CharacterCustomManager.GetCharacterRenderStudio
struct UCharacterCustomManager_GetCharacterRenderStudio_Params
{
public:
	class AVAL_CharacterRenderStudio*            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.TimedBaseComponent.UpdateLastResetTimestamp
struct UTimedBaseComponent_UpdateLastResetTimestamp_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.TimedBaseComponent.Server_UpdateLastResetTimestamp
struct UTimedBaseComponent_Server_UpdateLastResetTimestamp_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.TimedBaseComponent.OnRep_bCooldownComplete
struct UTimedBaseComponent_OnRep_bCooldownComplete_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.TimedBaseComponent.IsCooldownComplete
struct UTimedBaseComponent_IsCooldownComplete_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.TimedBaseComponent.GetLastResetTimestamp
struct UTimedBaseComponent_GetLastResetTimestamp_Params
{
public:
	int64                                        ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.TimedBaseComponent.GetCooldownTimeRemainingMs
struct UTimedBaseComponent_GetCooldownTimeRemainingMs_Params
{
public:
	int64                                        ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CharacterRespecComponent.SetCharacterCustomizationComponent
struct UCharacterRespecComponent_SetCharacterCustomizationComponent_Params
{
public:
	class UVAL_CharacterCustomizationComponent*  CharCustComp;                                      // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CharacterRespecComponent.OnRep_CharacterCustomizationComponentSet
struct UCharacterRespecComponent_OnRep_CharacterCustomizationComponentSet_Params
{
public:
};

// 0x30 (0x30 - 0x0)
// Function Palia.CharacterStateChangeInteraction.OnServerInteract
struct UCharacterStateChangeInteraction_OnServerInteract_Params
{
public:
	class UInteractableComponent*                Interactable;                                      // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaCharacter*                     Character;                                         // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractEventParams                  EventParams;                                       // 0x10(0x18)(Parm, NativeAccessSpecifierPublic)
	struct FServerUseEventResult                 ReturnValue;                                       // 0x28(0x2)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_2644[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function Palia.CharacterStateChangeInteraction.IsInteractable
struct UCharacterStateChangeInteraction_IsInteractable_Params
{
public:
	class AValeriaCharacter*                     Character;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractEventParams                  EventParams;                                       // 0x8(0x18)(Parm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2649[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function Palia.CharacterStateChangeInteraction.InteractPriority
struct UCharacterStateChangeInteraction_InteractPriority_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function Palia.CharacterStateChangeInteraction.GetText
struct UCharacterStateChangeInteraction_GetText_Params
{
public:
	class AValeriaCharacter*                     Character;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInteractEventIndex               EventIndex;                                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_264F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGetTextParams                        Params;                                            // 0x10(0x50)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x60(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2651[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.CharacterStateChangeInteraction.CheckCanGather
struct UCharacterStateChangeInteraction_CheckCanGather_Params
{
public:
	class AValeriaCharacter*                     Character;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2659[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x3 (0x3 - 0x0)
// Function Palia.CharacterStateMachineComponent.UseEquippedInputEnabled
struct UCharacterStateMachineComponent_UseEquippedInputEnabled_Params
{
public:
	bool                                         Inward;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Pressed;                                           // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x2(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1E8 (0x1E8 - 0x0)
// Function Palia.CharacterStateMachineComponent.ToggleState
struct UCharacterStateMachineComponent_ToggleState_Params
{
public:
	enum class ECharacterState                   StateTypeToToggle;                                 // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2672[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterStateChangeParams           Params;                                            // 0x8(0x1E0)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.StartPlacementInputIsEnabled
struct UCharacterStateMachineComponent_StartPlacementInputIsEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.ShouldHideInventoryToolbar
struct UCharacterStateMachineComponent_ShouldHideInventoryToolbar_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.RpcServer_ChangeMovementMode
struct UCharacterStateMachineComponent_RpcServer_ChangeMovementMode_Params
{
public:
	enum class ECharacterMoveMode                Mode;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1E8 (0x1E8 - 0x0)
// Function Palia.CharacterStateMachineComponent.RpcClient_ToggleState
struct UCharacterStateMachineComponent_RpcClient_ToggleState_Params
{
public:
	enum class ECharacterState                   State;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2695[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterStateChangeParams           Params;                                            // 0x8(0x1E0)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CharacterStateMachineComponent.RpcClient_RevertToWorldState
struct UCharacterStateMachineComponent_RpcClient_RevertToWorldState_Params
{
public:
};

// 0x1E8 (0x1E8 - 0x0)
// Function Palia.CharacterStateMachineComponent.RpcClient_EndState
struct UCharacterStateMachineComponent_RpcClient_EndState_Params
{
public:
	enum class ECharacterState                   State;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26A0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterStateChangeParams           Params;                                            // 0x8(0x1E0)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x1E8 (0x1E8 - 0x0)
// Function Palia.CharacterStateMachineComponent.RpcClient_ChangeState
struct UCharacterStateMachineComponent_RpcClient_ChangeState_Params
{
public:
	enum class ECharacterState                   State;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26AE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterStateChangeParams           Params;                                            // 0x8(0x1E0)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CharacterStateMachineComponent.RevertToWorldState
struct UCharacterStateMachineComponent_RevertToWorldState_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.PlacementInputIsEnabled
struct UCharacterStateMachineComponent_PlacementInputIsEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1F0 (0x1F0 - 0x0)
// DelegateFunction Palia.CharacterStateMachineComponent.OnExitingCharacterState__DelegateSignature
struct UCharacterStateMachineComponent_OnExitingCharacterState__DelegateSignature_Params
{
public:
	class UCharacterStateMachineComponent*       Csm;                                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterStateChangeParams           Params;                                            // 0x8(0x1E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	enum class ECharacterState                   StateBeingExited;                                  // 0x1E8(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECharacterState                   StateBeingEntered;                                 // 0x1E9(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26C5[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x200 (0x200 - 0x0)
// DelegateFunction Palia.CharacterStateMachineComponent.OnEnteredCharacterState__DelegateSignature
struct UCharacterStateMachineComponent_OnEnteredCharacterState__DelegateSignature_Params
{
public:
	class UCharacterStateMachineComponent*       Csm;                                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterStateChangeParams           Params;                                            // 0x8(0x1E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<enum class ECharacterState>           StatesExited;                                      // 0x1E8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	enum class ECharacterState                   StateEntered;                                      // 0x1F8(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_26DF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.CharacterStateMachineComponent.OnControllerAttachedToCharacter
struct UCharacterStateMachineComponent_OnControllerAttachedToCharacter_Params
{
public:
	class AValeriaPlayerController*              Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaCharacter*                     Character;                                         // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.MovementRelativeTo
struct UCharacterStateMachineComponent_MovementRelativeTo_Params
{
public:
	enum class EMovementRelativeTo               ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.MovementByInputIsEnabled
struct UCharacterStateMachineComponent_MovementByInputIsEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.JumpByInputIsEnabled
struct UCharacterStateMachineComponent_JumpByInputIsEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Palia.CharacterStateMachineComponent.IsOnStack
struct UCharacterStateMachineComponent_IsOnStack_Params
{
public:
	enum class ECharacterState                   State;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.IsEquippedHidden
struct UCharacterStateMachineComponent_IsEquippedHidden_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.GetCurrentStateType
struct UCharacterStateMachineComponent_GetCurrentStateType_Params
{
public:
	enum class ECharacterState                   ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.FishingInputIsEnabled
struct UCharacterStateMachineComponent_FishingInputIsEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1E8 (0x1E8 - 0x0)
// Function Palia.CharacterStateMachineComponent.EndState
struct UCharacterStateMachineComponent_EndState_Params
{
public:
	enum class ECharacterState                   StateTypeToEnd;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2735[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterStateChangeParams           Params;                                            // 0x8(0x1E0)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.CustomCameraControl
struct UCharacterStateMachineComponent_CustomCameraControl_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1F0 (0x1F0 - 0x0)
// Function Palia.CharacterStateMachineComponent.ChangeState
struct UCharacterStateMachineComponent_ChangeState_Params
{
public:
	enum class ECharacterState                   NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_273D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterStateChangeParams           Params;                                            // 0x8(0x1E0)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1E8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_273F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.CanTriggerAbility
struct UCharacterStateMachineComponent_CanTriggerAbility_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Palia.CharacterStateMachineComponent.CanTransitionTo
struct UCharacterStateMachineComponent_CanTransitionTo_Params
{
public:
	enum class ECharacterState                   State;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.CanSprint
struct UCharacterStateMachineComponent_CanSprint_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.CanChangeActionBar
struct UCharacterStateMachineComponent_CanChangeActionBar_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CharacterStateMachineComponent.AllowDashCancelling
struct UCharacterStateMachineComponent_AllowDashCancelling_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Palia.ChatManager.ValChat_OnDisplayReconnectChat__DelegateSignature
struct UChatManager_ValChat_OnDisplayReconnectChat__DelegateSignature_Params
{
public:
	bool                                         bReconnecting;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2779[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ErrorMsg;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChatManager.SessionConnectionFailureHandler
struct UChatManager_SessionConnectionFailureHandler_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.ChatManager.SendValeriagram
struct UChatManager_SendValeriagram_Params
{
public:
	class UVAL_ValeriagramPost*                  ValeriagramPost;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function Palia.ChatManager.SendValeriaChatMessage
struct UChatManager_SendValeriaChatMessage_Params
{
public:
	struct FValeriaChatMessage                   ChatMessage;                                       // 0x0(0x68)(Parm, NativeAccessSpecifierPublic)
};

// 0x98 (0x98 - 0x0)
// Function Palia.ChatManager.SendControlMessage
struct UChatManager_SendControlMessage_Params
{
public:
	struct FMessageTarget                        MessageTarget;                                     // 0x0(0x28)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FControlMessage                       ControlMessage;                                    // 0x28(0x70)(Parm, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.ChatManager.SendChatNotification
struct UChatManager_SendChatNotification_Params
{
public:
	struct FMessageTarget                        MessageTarget;                                     // 0x0(0x28)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                NotificationContent;                               // 0x28(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.ChatManager.SendChatMessage
struct UChatManager_SendChatMessage_Params
{
public:
	struct FMessageTarget                        MessageTarget;                                     // 0x0(0x28)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                HumanMessage;                                      // 0x28(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Palia.ChatManager.SendChatImage
struct UChatManager_SendChatImage_Params
{
public:
	struct FMessageTarget                        MessageTarget;                                     // 0x0(0x28)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                ImageTexture;                                      // 0x28(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Palia.ChatManager.RequestOpenChannel
struct UChatManager_RequestOpenChannel_Params
{
public:
	struct FMessageTarget                        MessageTarget;                                     // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Palia.ChatManager.RequestMuteUser_New
struct UChatManager_RequestMuteUser_New_Params
{
public:
	bool                                         bMute;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_279E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FUniqueNetIdRepl                      PlayerNetId;                                       // 0x8(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CharacterName;                                     // 0x38(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.ChatManager.RequestMuteUser
struct UChatManager_RequestMuteUser_Params
{
public:
	bool                                         bMute;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27A1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  CharacterName;                                     // 0x4(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChatManager.RemoveChatPermission
struct UChatManager_RemoveChatPermission_Params
{
public:
	enum class EVAL_ChatPermissions              Permission;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// DelegateFunction Palia.ChatManager.OnRequestOpenChannel__DelegateSignature
struct UChatManager_OnRequestOpenChannel__DelegateSignature_Params
{
public:
	struct FMessageTarget                        MessageTarget;                                     // 0x0(0x28)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Palia.ChatManager.OnRequestInputBarInsertText__DelegateSignature
struct UChatManager_OnRequestInputBarInsertText__DelegateSignature_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// DelegateFunction Palia.ChatManager.OnRequestInputBarChangeMessageTarget__DelegateSignature
struct UChatManager_OnRequestInputBarChangeMessageTarget__DelegateSignature_Params
{
public:
	struct FMessageTarget                        MessageTarget;                                     // 0x0(0x28)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction Palia.ChatManager.OnRequestInactivateChat__DelegateSignature
struct UChatManager_OnRequestInactivateChat__DelegateSignature_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Palia.ChatManager.OnRequestDisplayChatUnreachable__DelegateSignature
struct UChatManager_OnRequestDisplayChatUnreachable__DelegateSignature_Params
{
public:
	class FText                                  ErrorText;                                         // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Palia.ChatManager.OnRequestDisplayChatRetryLogin__DelegateSignature
struct UChatManager_OnRequestDisplayChatRetryLogin__DelegateSignature_Params
{
public:
	class FText                                  ErrorText;                                         // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Palia.ChatManager.OnRequestDisplayChatErrorMessage__DelegateSignature
struct UChatManager_OnRequestDisplayChatErrorMessage__DelegateSignature_Params
{
public:
	class FText                                  ErrorText;                                         // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// DelegateFunction Palia.ChatManager.OnRequestActivateChat__DelegateSignature
struct UChatManager_OnRequestActivateChat__DelegateSignature_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// DelegateFunction Palia.ChatManager.OnPlayerMuted__DelegateSignature
struct UChatManager_OnPlayerMuted__DelegateSignature_Params
{
public:
	struct FUniqueNetIdRepl                      PlayerNetId;                                       // 0x0(0x30)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMuted;                                            // 0x30(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27B8[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// DelegateFunction Palia.ChatManager.OnChatPermissionsChanged__DelegateSignature
struct UChatManager_OnChatPermissionsChanged__DelegateSignature_Params
{
public:
	enum class EVAL_ChatPermissions              Permissions;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// DelegateFunction Palia.ChatManager.OnCharacterMuted__DelegateSignature
struct UChatManager_OnCharacterMuted__DelegateSignature_Params
{
public:
	class FName                                  CharacterName;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMuted;                                            // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27BD[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function Palia.ChatManager.MaximumCharacterLimit
struct UChatManager_MaximumCharacterLimit_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.ChatManager.IsUserMuted_New
struct UChatManager_IsUserMuted_New_Params
{
public:
	struct FUniqueNetIdRepl                      PlayerNetId;                                       // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x30(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27BE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Palia.ChatManager.IsUserMuted
struct UChatManager_IsUserMuted_Params
{
public:
	class FName                                  CharacterName;                                     // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27C0[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChatManager.IsReconnectingToChat
struct UChatManager_IsReconnectingToChat_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChatManager.IsConnected
struct UChatManager_IsConnected_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Palia.ChatManager.HasChatPermission
struct UChatManager_HasChatPermission_Params
{
public:
	enum class EVAL_ChatPermissions              Permission;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.ChatManager.HandlePlayerGuildChanged
struct UChatManager_HandlePlayerGuildChanged_Params
{
public:
	class UVAL_PlayerGuildSubsystem*             PlayerGuildSubsystem;                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 NewGuildId;                                        // 0x8(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.ChatManager.HandleOnVivoxLoginFailed
struct UChatManager_HandleOnVivoxLoginFailed_Params
{
public:
	int32                                        ErrorCode;                                         // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27CB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ErrorMsg;                                          // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.ChatManager.HandleOnVivoxLoggedIn
struct UChatManager_HandleOnVivoxLoggedIn_Params
{
public:
};

// 0x28 (0x28 - 0x0)
// Function Palia.ChatManager.HandleOnSignedInAsCharacter
struct UChatManager_HandleOnSignedInAsCharacter_Params
{
public:
	class FString                                CharacterName;                                     // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LocalUserNum;                                      // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 CharacterId;                                       // 0x14(0x10)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27CE[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChatManager.HandleOnServerIdChanged
struct UChatManager_HandleOnServerIdChanged_Params
{
public:
	class FString                                ID;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.ChatManager.HandleOnPawnChanged
struct UChatManager_HandleOnPawnChanged_Params
{
public:
	class APawn*                                 Pawn;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChatManager.HandleOnPartyStateChanged
struct UChatManager_HandleOnPartyStateChanged_Params
{
public:
	enum class EVAL_PartyManagerState            State;                                             // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// Function Palia.ChatManager.HandleOnDirectMsgReceived
struct UChatManager_HandleOnDirectMsgReceived_Params
{
public:
	struct FS6Vivox_TextMsg                      Msg;                                               // 0x0(0xC8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Palia.ChatManager.HandleOnChannelMsgReceived
struct UChatManager_HandleOnChannelMsgReceived_Params
{
public:
	struct FS6Vivox_ChannelTextMsg               Msg;                                               // 0x0(0xD8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChatManager.GetServerName
struct UChatManager_GetServerName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChatManager.GetPlayersInChatProximity
struct UChatManager_GetPlayersInChatProximity_Params
{
public:
	TArray<struct FVAL_ChatProximityEntity>      ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChatManager.GetChatPermissionFlags
struct UChatManager_GetChatPermissionFlags_Params
{
public:
	enum class EVAL_ChatPermissions              ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChatManager.GetChatErrorMsg
struct UChatManager_GetChatErrorMsg_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function Palia.ChatManager.EchoValeriaChatMessage
struct UChatManager_EchoValeriaChatMessage_Params
{
public:
	struct FValeriaChatMessage                   ChatMessage;                                       // 0x0(0x68)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ChatManager.EchoChatNotificationToSelf
struct UChatManager_EchoChatNotificationToSelf_Params
{
public:
	class FString                                Message;                                           // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.ChatManager.EchoChatNotification
struct UChatManager_EchoChatNotification_Params
{
public:
	struct FMessageTarget                        MessageTarget;                                     // 0x0(0x28)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                NotificationContent;                               // 0x28(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.ChatManager.ChatSessionReadyHandler
struct UChatManager_ChatSessionReadyHandler_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function Palia.ChatManager.ChatImageTextureFromBufferString
struct UChatManager_ChatImageTextureFromBufferString_Params
{
public:
	class FString                                ImageData;                                         // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ChatManager.AddChatPermission
struct UChatManager_AddChatPermission_Params
{
public:
	enum class EVAL_ChatPermissions              Permission;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CinematicManagerComponent.TryPlayCinematic
struct UCinematicManagerComponent_TryPlayCinematic_Params
{
public:
	class UCinematicSequenceConfig*              CinConfig;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CinematicManagerComponent.RpcServer_HidePlayerOnRemoteClients
struct UCinematicManagerComponent_RpcServer_HidePlayerOnRemoteClients_Params
{
public:
	bool                                         Hide;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CinematicManagerComponent.PrimeCinematicMode
struct UCinematicManagerComponent_PrimeCinematicMode_Params
{
public:
	class UCinematicSequenceConfig*              CinConfig;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CinematicManagerComponent.LoadCinematicLevel
struct UCinematicManagerComponent_LoadCinematicLevel_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.CinematicManagerComponent.HidePlayerOnClientInCinematicMode
struct UCinematicManagerComponent_HidePlayerOnClientInCinematicMode_Params
{
public:
	bool                                         bHidePlayer;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CinematicManagerComponent.HandleWorldPartitionAreaLoaded
struct UCinematicManagerComponent_HandleWorldPartitionAreaLoaded_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.CinematicManagerComponent.HandleCinematicLevelUnloaded
struct UCinematicManagerComponent_HandleCinematicLevelUnloaded_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.CinematicManagerComponent.HandleCinematicLevelShown
struct UCinematicManagerComponent_HandleCinematicLevelShown_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Palia.CinematicManagerComponent.HandleCinematicLevelLoaded
struct UCinematicManagerComponent_HandleCinematicLevelLoaded_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function Palia.CinematicManagerComponent.GetCurrentSubtitleText
struct UCinematicManagerComponent_GetCurrentSubtitleText_Params
{
public:
	float                                        CurrentPlaybackTimeSeconds;                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2815[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CinematicManagerComponent.ConcludeCinematicMode
struct UCinematicManagerComponent_ConcludeCinematicMode_Params
{
public:
	class UCinematicSequenceConfig*              CinConfig;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ConfigurableTriggerVolume.ActorEndOverlap
struct UConfigurableTriggerVolume_ActorEndOverlap_Params
{
public:
	class AActor*                                MyActor;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ConfigurableTriggerVolume.ActorBeginOverlap
struct UConfigurableTriggerVolume_ActorBeginOverlap_Params
{
public:
	class AActor*                                MyActor;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.ConvertibleActor.GetClassForConversion
struct IConvertibleActor_GetClassForConversion_Params
{
public:
	enum class EActorConversionType              ConversionType;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_282A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Palia.ConvertibleActor.CanConvert
struct IConvertibleActor_CanConvert_Params
{
public:
	enum class EActorConversionType              ConversionType;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.ConvertibleActor.ApplyConversion
struct IConvertibleActor_ApplyConversion_Params
{
public:
	enum class EActorConversionType              ConversionType;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CookingSubsystem.SetRecipeOption_UseStarQualityItems
struct UCookingSubsystem_SetRecipeOption_UseStarQualityItems_Params
{
public:
	bool                                         UseStarQuality;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.CookingSubsystem.SetRecipeOption_CraftMultiplier
struct UCookingSubsystem_SetRecipeOption_CraftMultiplier_Params
{
public:
	int32                                        Multiplier;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.CookingSubsystem.RemoveRecipeOption_IngredientOverrideMappingForIndex
struct UCookingSubsystem_RemoveRecipeOption_IngredientOverrideMappingForIndex_Params
{
public:
	int32                                        SimpleIngredientIndex;                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x90 (0x90 - 0x0)
// DelegateFunction Palia.CookingSubsystem.RecipeEvent__DelegateSignature
struct UCookingSubsystem_RecipeEvent__DelegateSignature_Params
{
public:
	struct FComplexRecipeRecord                  ComplexState;                                      // 0x0(0x70)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FComplexRecipeCrafter                 CrafterState;                                      // 0x70(0x18)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                        RecipeIndex;                                       // 0x88(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_283C[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Palia.CookingSubsystem.GetRecipeOptions
struct UCookingSubsystem_GetRecipeOptions_Params
{
public:
	struct FRecipePlayerOptions                  ReturnValue;                                       // 0x0(0x18)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CookingSubsystem.GetRecipeOption_UseStarQualityItems
struct UCookingSubsystem_GetRecipeOption_UseStarQualityItems_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Palia.CookingSubsystem.GetRecipeOption_IngredientOverrideMappingForIndex
struct UCookingSubsystem_GetRecipeOption_IngredientOverrideMappingForIndex_Params
{
public:
	int32                                        SimpleIngredientIndex;                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2843[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRecipePlayerOptionMapping            OutMapping;                                        // 0x8(0x38)(Parm, OutParm, NativeAccessSpecifierPublic)
	enum class EValeriaFuncResult                OutResult;                                         // 0x40(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x41(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2844[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function Palia.CookingSubsystem.GetCookingRecipeCueStateForIngredient
struct UCookingSubsystem_GetCookingRecipeCueStateForIngredient_Params
{
public:
	class UCrafterComponent*                     CrafterComponent;                                  // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRecipe_RequireItem                   RequireItem;                                       // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        IngredientIndex;                                   // 0x20(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EComplexRecipeCueState            ReturnValue;                                       // 0x24(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_284D[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function Palia.CookingSubsystem.GetCookingRecipeCueStateForHUD
struct UCookingSubsystem_GetCookingRecipeCueStateForHUD_Params
{
public:
	int32                                        CrafterPersistId;                                  // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2851[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRecipe_RequireItem                   RequireItem;                                       // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	enum class EComplexRecipeCueState            ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2852[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function Palia.CookingSubsystem.GetCookingRecipeCueStateForCrafter
struct UCookingSubsystem_GetCookingRecipeCueStateForCrafter_Params
{
public:
	class UCrafterComponent*                     CrafterComponent;                                  // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRecipe_RequireItem                   RequireItem;                                       // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	enum class EComplexRecipeCueState            ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2859[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// DelegateFunction Palia.CookingSubsystem.CookingSubsystemEvent__DelegateSignature
struct UCookingSubsystem_CookingSubsystemEvent__DelegateSignature_Params
{
public:
};

// 0x158 (0x158 - 0x0)
// DelegateFunction Palia.CookingSubsystem.ComplexRecipeStartEvent__DelegateSignature
struct UCookingSubsystem_ComplexRecipeStartEvent__DelegateSignature_Params
{
public:
	struct FCrafterConfig                        MainCrafterConfig;                                 // 0x0(0xE8)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FComplexRecipeRecord                  RecipeRecord;                                      // 0xE8(0x70)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// DelegateFunction Palia.CookingSubsystem.ComplexRecipeEvent__DelegateSignature
struct UCookingSubsystem_ComplexRecipeEvent__DelegateSignature_Params
{
public:
	struct FComplexRecipeRecord                  RecipeRecord;                                      // 0x0(0x70)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CookingSubsystem.Client_UpdateLocalPlayerInCrafterCamera
struct UCookingSubsystem_Client_UpdateLocalPlayerInCrafterCamera_Params
{
public:
	bool                                         NewIsLocalPlayerInCrafterCamera;                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.CookingSubsystem.Client_GetLocalPlayerInCrafterCamera
struct UCookingSubsystem_Client_GetLocalPlayerInCrafterCamera_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CookingSubsystem.ClearRecipeOption_IngredientOverrideMappings
struct UCookingSubsystem_ClearRecipeOption_IngredientOverrideMappings_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function Palia.CookingSubsystem.AddRecipeOption_IngredientOverrideMapping
struct UCookingSubsystem_AddRecipeOption_IngredientOverrideMapping_Params
{
public:
	struct FRecipePlayerOptionMapping            MapPing;                                           // 0x0(0x38)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.InventoryComponent.ShouldBlockGathering
struct UInventoryComponent_ShouldBlockGathering_Params
{
public:
	class AValeriaCharacter*                     Character;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNotification                         ReturnValue;                                       // 0x8(0x30)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.InventoryComponent.SetActiveActionBarIndex
struct UInventoryComponent_SetActiveActionBarIndex_Params
{
public:
	int32                                        RowIndex;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColsPerRow;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.InventoryComponent.RpcServer_SetActiveActionBarIndex
struct UInventoryComponent_RpcServer_SetActiveActionBarIndex_Params
{
public:
	int32                                        RowIndex;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColsPerRow;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.InventoryComponent.RpcServer_RemoveAllItems
struct UInventoryComponent_RpcServer_RemoveAllItems_Params
{
public:
	bool                                         bIncludeTools;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.InventoryComponent.RpcServer_MoveItemToBagGroup
struct UInventoryComponent_RpcServer_MoveItemToBagGroup_Params
{
public:
	struct FBagSlotLocation                      OriginalItemLocation;                              // 0x0(0x8)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	enum class EVAL_BagGroup                     InBagGroup;                                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28A8[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x60 (0x60 - 0x0)
// Function Palia.InventoryComponent.RpcClient_ItemAdded
struct UInventoryComponent_RpcClient_ItemAdded_Params
{
public:
	struct FValeriaItem                          Item;                                              // 0x0(0x60)(Parm, NativeAccessSpecifierPublic)
};

// 0x98 (0x98 - 0x0)
// Function Palia.InventoryComponent.RemoveItemByType
struct UInventoryComponent_RemoveItemByType_Params
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28AD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FValeriaItem                          ReturnValue;                                       // 0x38(0x60)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Palia.InventoryComponent.RemoveItem
struct UInventoryComponent_RemoveItem_Params
{
public:
	struct FInventory_RemoveContext              RemoveContext;                                     // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28B2[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function Palia.InventoryComponent.OnRep_Bags
struct UInventoryComponent_OnRep_Bags_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function Palia.InventoryComponent.OnClientUsedEquippedOnMe
struct UInventoryComponent_OnClientUsedEquippedOnMe_Params
{
public:
	class AValeriaPlayerController*              Player;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUseEventParams                       Params;                                            // 0x8(0x20)(Parm, NativeAccessSpecifierPublic)
	struct FUseEventResult                       ReturnValue;                                       // 0x28(0x10)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.InventoryComponent.NotifyInventoryUpgraded
struct UInventoryComponent_NotifyInventoryUpgraded_Params
{
public:
	class FText                                  NotificationText;                                  // 0x0(0x18)(ConstParm, Parm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.InventoryComponent.NotifyInventoryFull
struct UInventoryComponent_NotifyInventoryFull_Params
{
public:
	class FText                                  NotificationText;                                  // 0x0(0x18)(ConstParm, Parm, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function Palia.InventoryComponent.K2_GetItemAmountByType
struct UInventoryComponent_K2_GetItemAmountByType_Params
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStarQualityConstraint                StarQualityConstraint;                             // 0x30(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x38(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28C4[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x14 - 0x0)
// Function Palia.InventoryComponent.K2_GetItemAmountByTag
struct UInventoryComponent_K2_GetItemAmountByTag_Params
{
public:
	struct FGameplayTag                          IngredientTag;                                     // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStarQualityConstraint                StarQualityConstraint;                             // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x10(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.InventoryComponent.IsShippingBin
struct UInventoryComponent_IsShippingBin_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.InventoryComponent.IsLocationInActiveActionBar
struct UInventoryComponent_IsLocationInActiveActionBar_Params
{
public:
	struct FBagSlotLocation                      Location;                                          // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28CF[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.InventoryComponent.IsBagInActionBar
struct UInventoryComponent_IsBagInActionBar_Params
{
public:
	int32                                        BagIndex;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28D1[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.InventoryComponent.GetTotalMaxSlotsInBag
struct UInventoryComponent_GetTotalMaxSlotsInBag_Params
{
public:
	int32                                        BagIndex;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.InventoryComponent.GetTotalMaxSlotsForActionBar
struct UInventoryComponent_GetTotalMaxSlotsForActionBar_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.InventoryComponent.GetTotalMaxSlots
struct UInventoryComponent_GetTotalMaxSlots_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Palia.InventoryComponent.GetToolsForToolWheel
struct UInventoryComponent_GetToolsForToolWheel_Params
{
public:
	TArray<struct FBagSlotLocation>              ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.InventoryComponent.GetStorageComponent
struct UInventoryComponent_GetStorageComponent_Params
{
public:
	class UStorageComponent*                     ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Palia.InventoryComponent.GetNumberOfOverflowSlots
struct UInventoryComponent_GetNumberOfOverflowSlots_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.InventoryComponent.GetNumberOfActionBarRows
struct UInventoryComponent_GetNumberOfActionBarRows_Params
{
public:
	int32                                        ColsPerRow;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// Function Palia.InventoryComponent.GetNextValidItemInRowFromActionBarIndex
struct UInventoryComponent_GetNextValidItemInRowFromActionBarIndex_Params
{
public:
	int32                                        RowIndex;                                          // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StartingColumnIndex;                               // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColsPerRow;                                        // 0x8(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanWrapAround;                                    // 0xC(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForwardIterate;                                   // 0xD(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28DF[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        OutColumnIndexFound;                               // 0x10(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28E0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FValeriaItem                          OutItemFound;                                      // 0x18(0x60)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// Function Palia.InventoryComponent.GetLocationAtActionBarIndex
struct UInventoryComponent_GetLocationAtActionBarIndex_Params
{
public:
	int32                                        RowIndex;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColumnIndex;                                       // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColsPerRow;                                        // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBagSlotLocation                      ReturnValue;                                       // 0xC(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function Palia.InventoryComponent.GetItemAtActionBarIndex
struct UInventoryComponent_GetItemAtActionBarIndex_Params
{
public:
	int32                                        RowIndex;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColumnIndex;                                       // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColsPerRow;                                        // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28E3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FValeriaItem                          ReturnValue;                                       // 0x10(0x60)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function Palia.InventoryComponent.GetItemAt
struct UInventoryComponent_GetItemAt_Params
{
public:
	struct FBagSlotLocation                      Location;                                          // 0x0(0x8)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FValeriaItem                          ReturnValue;                                       // 0x8(0x60)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.InventoryComponent.GetBagTypeForBagIndex
struct UInventoryComponent_GetBagTypeForBagIndex_Params
{
public:
	int32                                        BagIndex;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ReturnValue;                                       // 0x4(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// Function Palia.InventoryComponent.GetBagTypeAtActionBarIndex
struct UInventoryComponent_GetBagTypeAtActionBarIndex_Params
{
public:
	int32                                        RowIndex;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColumnIndex;                                       // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColsPerRow;                                        // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ReturnValue;                                       // 0xC(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Palia.InventoryComponent.GetBagIndicesMatchingBagTypes
struct UInventoryComponent_GetBagIndicesMatchingBagTypes_Params
{
public:
	TArray<struct FGameplayTag>                  InBagTypes;                                        // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                ReturnValue;                                       // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.InventoryComponent.GetBagIndexForGamePlayTag
struct UInventoryComponent_GetBagIndexForGamePlayTag_Params
{
public:
	struct FGameplayTag                          GameplayTag;                                       // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// Function Palia.InventoryComponent.GetAllPlaceableItemsInBag
struct UInventoryComponent_GetAllPlaceableItemsInBag_Params
{
public:
	struct FGameplayTagContainer                 IncludeTag;                                        // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 ExcludeTag;                                        // 0x20(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FValeriaItem>                  ReturnValue;                                       // 0x40(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Palia.InventoryComponent.FindItemByTypeInBag
struct UInventoryComponent_FindItemByTypeInBag_Params
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          BagTag;                                            // 0x30(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRequireStarQuality;                               // 0x38(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28E8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBagSlotLocation                      ReturnValue;                                       // 0x3C(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_28E9[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// Function Palia.InventoryComponent.FindItemByTypeAndVariant
struct UInventoryComponent_FindItemByTypeAndVariant_Params
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TintPersistID;                                     // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRequireStarQuality;                               // 0x34(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28EB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBagSlotLocation                      ReturnValue;                                       // 0x38(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function Palia.InventoryComponent.FindItemByType
struct UInventoryComponent_FindItemByType_Params
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRequireStarQuality;                               // 0x30(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28EC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBagSlotLocation                      ReturnValue;                                       // 0x34(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_28ED[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1C (0x1C - 0x0)
// Function Palia.InventoryComponent.FindItemByTagInBag
struct UInventoryComponent_FindItemByTagInBag_Params
{
public:
	struct FGameplayTag                          ItemTag;                                           // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          BagTag;                                            // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRequireStarQuality;                               // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28F4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBagSlotLocation                      ReturnValue;                                       // 0x14(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// Function Palia.InventoryComponent.FindItemByTag
struct UInventoryComponent_FindItemByTag_Params
{
public:
	struct FGameplayTag                          ItemTag;                                           // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRequireStarQuality;                               // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28F6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBagSlotLocation                      ReturnValue;                                       // 0xC(0x8)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Palia.InventoryComponent.ContainsItemByTypeOrTag
struct UInventoryComponent_ContainsItemByTypeOrTag_Params
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          IngredientTag;                                     // 0x30(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x38(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          BagType;                                           // 0x3C(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x44(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28FA[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// Function Palia.InventoryComponent.ContainsItemByType
struct UInventoryComponent_ContainsItemByType_Params
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x34(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28FB[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function Palia.InventoryComponent.ContainsItemByTag
struct UInventoryComponent_ContainsItemByTag_Params
{
public:
	struct FGameplayTag                          Tag;                                               // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_28FC[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x2 (0x2 - 0x0)
// Function Palia.InventoryComponent.ContainsItemByCategory
struct UInventoryComponent_ContainsItemByCategory_Params
{
public:
	enum class EItemCategory                     ItemCategory;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Palia.InventoryComponent.CanMoveItemToBagGroup
struct UInventoryComponent_CanMoveItemToBagGroup_Params
{
public:
	struct FBagSlotLocation                      OriginalItemLocation;                              // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	enum class EVAL_BagGroup                     InBagGroup;                                        // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x9(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2901[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// Function Palia.InventoryComponent.CanAddItemTypeHere
struct UInventoryComponent_CanAddItemTypeHere_Params
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x30(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2902[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Palia.InventoryComponent.CanAddItemsFully
struct UInventoryComponent_CanAddItemsFully_Params
{
public:
	TArray<struct FValeriaItem>                  Items;                                             // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2904[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x68 (0x68 - 0x0)
// Function Palia.InventoryComponent.CanAddItemFully
struct UInventoryComponent_CanAddItemFully_Params
{
public:
	struct FValeriaItem                          Item;                                              // 0x0(0x60)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x60(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2907[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x2 (0x2 - 0x0)
// Function Palia.InventoryComponent.AreStorageSlotsFull
struct UInventoryComponent_AreStorageSlotsFull_Params
{
public:
	bool                                         bShouldCountOverflowSlots;                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.InventoryComponent.AreSlotsFull
struct UInventoryComponent_AreSlotsFull_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Palia.InventoryComponent.AreInventorySlotsFull
struct UInventoryComponent_AreInventorySlotsFull_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function Palia.InventoryComponent.AddItemToBag
struct UInventoryComponent_AddItemToBag_Params
{
public:
	struct FValeriaItem                          ItemToAdd;                                         // 0x0(0x60)(Parm, NativeAccessSpecifierPublic)
	enum class EInventoryAddItemFlags            Flags;                                             // 0x60(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_290B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          BagType;                                           // 0x64(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x6C(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function Palia.InventoryComponent.AddItem
struct UInventoryComponent_AddItem_Params
{
public:
	struct FValeriaItem                          ItemToAdd;                                         // 0x0(0x60)(Parm, NativeAccessSpecifierPublic)
	enum class EInventoryAddItemFlags            Flags;                                             // 0x60(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_290D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0x64(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CrafterAutomaticInventoryComponent.GetInventoryComponent
struct UCrafterAutomaticInventoryComponent_GetInventoryComponent_Params
{
public:
	class UCrafterComponent_Automatic*           ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Palia.CrafterComponent.WasRequestStepStarted
struct UCrafterComponent_WasRequestStepStarted_Params
{
public:
	int32                                        RequestIndex;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2929[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function Palia.CrafterComponent.TryGetBurnTimes
struct UCrafterComponent_TryGetBurnTimes_Params
{
public:
	int64                                        StartTime;                                         // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        EndTime;                                           // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_292C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.CrafterComponent.StarQualityItemsConsumedByRecipe
struct UCrafterComponent_StarQualityItemsConsumedByRecipe_Params
{
public:
	class AValeriaCharacter*                     VC;                                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RecipeConfigId;                                    // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0xC(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Palia.CrafterComponent.ShouldBlockGathering
struct UCrafterComponent_ShouldBlockGathering_Params
{
public:
	class AValeriaCharacter*                     Character;                                         // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNotification                         ReturnValue;                                       // 0x8(0x30)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Palia.CrafterComponent.SetIsEngaging
struct UCrafterComponent_SetIsEngaging_Params
{
public:
	bool                                         bShouldEngage;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2937[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AValeriaPlayerController*              Vpc;                                               // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceUnlock;                                      // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECrafterEngageResult              ReturnValue;                                       // 0x11(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2938[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.CrafterComponent.Server_Collect
struct UCrafterComponent_Server_Collect_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_293A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.CrafterComponent.RpcMulticast_SuccessfullInput
struct UCrafterComponent_RpcMulticast_SuccessfullInput_Params
{
public:
	class AValeriaCharacter*                     VC;                                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CrafterComponent.RpcMulticast_RecipeRequests_OnBurned
struct UCrafterComponent_RpcMulticast_RecipeRequests_OnBurned_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function Palia.CrafterComponent.RpcMulticast_MistimedInput
struct UCrafterComponent_RpcMulticast_MistimedInput_Params
{
public:
	class AValeriaCharacter*                     VC;                                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CrafterComponent.RpcMulticast_CraftingCancelled
struct UCrafterComponent_RpcMulticast_CraftingCancelled_Params
{
public:
};

// 0x30 (0x30 - 0x0)
// Function Palia.CrafterComponent.OnServerInteract
struct UCrafterComponent_OnServerInteract_Params
{
public:
	class UInteractableComponent*                Interactable;                                      // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaCharacter*                     VC;                                                // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractEventParams                  EventParams;                                       // 0x10(0x18)(Parm, NativeAccessSpecifierPublic)
	struct FServerUseEventResult                 ReturnValue;                                       // 0x28(0x2)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_2940[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function Palia.CrafterComponent.OnReplicatedAndShouldNotify
struct UCrafterComponent_OnReplicatedAndShouldNotify_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Palia.CrafterComponent.OnReplicated_PropPhase
struct UCrafterComponent_OnReplicated_PropPhase_Params
{
public:
	enum class ERecipePropPhase                  OldPropPhase;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CrafterComponent.OnRep_Steps
struct UCrafterComponent_OnRep_Steps_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function Palia.CrafterComponent.OnRep_CrafterState
struct UCrafterComponent_OnRep_CrafterState_Params
{
public:
	struct FCrafterRecipeState                   OldState;                                          // 0x0(0x38)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function Palia.CrafterComponent.OnPostCraftBurnTimer
struct UCrafterComponent_OnPostCraftBurnTimer_Params
{
public:
};

// 0x38 (0x38 - 0x0)
// Function Palia.CrafterComponent.OnClientInteract
struct UCrafterComponent_OnClientInteract_Params
{
public:
	class UInteractableComponent*                Interactable;                                      // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValeriaPlayerController*              Vpc;                                               // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractEventParams                  EventParams;                                       // 0x10(0x18)(Parm, NativeAccessSpecifierPublic)
	struct FUseEventResult                       ReturnValue;                                       // 0x28(0x10)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// Function Palia.CrafterComponent.K2_GetComplexState
struct UCrafterComponent_K2_GetComplexState_Params
{
public:
	struct FComplexRecipeRecord                  OutRecipeRecord;                                   // 0x0(0x70)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x70(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_294E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.CrafterComponent.IsRequestStepExpired
struct UCrafterComponent_IsRequestStepExpired_Params
{
public:
	int32                                        RequestIndex;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_294F[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.CrafterComponent.IsRequestStepDone
struct UCrafterComponent_IsRequestStepDone_Params
{
public:
	int32                                        RequestIndex;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2962[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.CrafterComponent.IsRequestStepActive
struct UCrafterComponent_IsRequestStepActive_Params
{
public:
	int32                                        RequestIndex;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2969[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function Palia.CrafterComponent.IsPlateVisible
struct UCrafterComponent_IsPlateVisible_Params
{
public:
	class AActor*                                InteractingActor;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_296E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function Palia.CrafterComponent.IsInteractingMode
struct UCrafterComponent_IsInteractingMode_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Palia.CrafterComponent.IsInteractable
struct UCrafterComponent_IsInteractable_Params
{
public:
	class AValeriaCharacter*                     VC;                                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractEventParams                  EventParams;                                       // 0x8(0x18)(Parm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2974[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function Palia.CrafterComponent.IsIngredientFullyAdded
struct UCrafterComponent_IsIngredientFullyAdded_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
