#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------

enum class EVAL_CharacterBodyType : uint8
{
	EVAL_CharacterBodyType__Male   = 0,
	EVAL_CharacterBodyType__Female = 1,
	EVAL_CharacterBodyType__ValerianMale = 2,
	EVAL_CharacterBodyType__ValerianFemale = 3,
	EVAL_CharacterBodyType__EVAL_MAX = 4,
};

enum class EVAL_CharacterRenderStudioState : uint8
{
	EVAL_CharacterRenderStudioState__Idle = 0,
	EVAL_CharacterRenderStudioState__LoadingLevel = 1,
	EVAL_CharacterRenderStudioState__PresentingLevel = 2,
	EVAL_CharacterRenderStudioState__ClosingStudio = 3,
	EVAL_CharacterRenderStudioState__Closed = 4,
	EVAL_CharacterRenderStudioState__EVAL_MAX = 5,
};

enum class ENotificationSpecialType : uint8
{
	ENotificationSpecialType__General = 0,
	ENotificationSpecialType__InventoryFull = 1,
	ENotificationSpecialType__Error = 2,
	ENotificationSpecialType__ENotificationSpecialType_MAX = 3,
};

enum class ETimeOfDayPeriod : uint8
{
	ETimeOfDayPeriod__Morning      = 0,
	ETimeOfDayPeriod__Day          = 1,
	ETimeOfDayPeriod__Evening      = 2,
	ETimeOfDayPeriod__Night        = 3,
	ETimeOfDayPeriod__Custom       = 4,
	ETimeOfDayPeriod__ETimeOfDayPeriod_MAX = 5,
};

enum class ETravelDestinationType : uint8
{
	ETravelDestinationType__None   = 0,
	ETravelDestinationType__Home   = 1,
	ETravelDestinationType__Stable = 2,
	ETravelDestinationType__PrivateSpace = 3,
	ETravelDestinationType__SpecificLocation = 4,
	ETravelDestinationType__ETravelDestinationType_MAX = 5,
};

enum class EStoragePoolType : uint8
{
	EStoragePoolType__None         = 0,
	EStoragePoolType__Primary      = 1,
	EStoragePoolType__Lockbox      = 2,
	EStoragePoolType__Max          = 3,
};

enum class EVillagerGiftRewardLevel : uint8
{
	EVillagerGiftRewardLevel__Love = 0,
	EVillagerGiftRewardLevel__Like = 1,
	EVillagerGiftRewardLevel__Neutral = 2,
	EVillagerGiftRewardLevel__Dislike = 3,
	EVillagerGiftRewardLevel__Hate = 4,
	EVillagerGiftRewardLevel__INVALID = 5,
	EVillagerGiftRewardLevel__EVillagerGiftRewardLevel_MAX = 6,
};

enum class ERomanceState : uint8
{
	ERomanceState__Inactive        = 0,
	ERomanceState__Dating          = 1,
	ERomanceState__ERomanceState_MAX = 2,
};

enum class EHousingSlotType : uint8
{
	EHousingSlotType__PlayerOwned  = 0,
	EHousingSlotType__PlayerPurchased = 1,
	EHousingSlotType__EHousingSlotType_MAX = 2,
};

enum class ENumericalOperation : uint8
{
	ENumericalOperation__Set       = 0,
	ENumericalOperation__Add       = 1,
	ENumericalOperation__Subtract  = 2,
	ENumericalOperation__ENumericalOperation_MAX = 3,
};

enum class ESkillType : uint8
{
	ESkillType__None               = 0,
	ESkillType__Fishing            = 1,
	ESkillType__Cooking            = 2,
	ESkillType__Alchemy            = 3,
	ESkillType__Gardening          = 4,
	ESkillType__Blacksmithing      = 5,
	ESkillType__AnimalHusbandry    = 6,
	ESkillType__Mining             = 7,
	ESkillType__Hunting            = 8,
	ESkillType__Combat             = 9,
	ESkillType__BugCatching        = 10,
	ESkillType__Lumberjacking      = 11,
	ESkillType__Master             = 12,
	ESkillType__Foraging           = 13,
	ESkillType__FurnitureMaking    = 14,
	ESkillType__Num                = 15,
	ESkillType__ESkillType_MAX     = 16,
};

enum class ERomanceStateChange : uint8
{
	ERomanceStateChange__None      = 0,
	ERomanceStateChange__StartDating = 1,
	ERomanceStateChange__BreakUp   = 7,
	ERomanceStateChange__ERomanceStateChange_MAX = 8,
};

enum class EVitalType : uint8
{
	EVitalType__None               = 0,
	EVitalType__Coins              = 1,
	EVitalType__CommunityPoints    = 2,
	EVitalType__Stamina            = 3,
	EVitalType__Health             = 4,
	EVitalType__PremiumCurrency    = 5,
	EVitalType__MedalFishing       = 6,
	EVitalType__Focus              = 7,
	EVitalType__RestedFocus        = 8,
	EVitalType__Num                = 9,
	EVitalType__EVitalType_MAX     = 10,
};

enum class EVAL_QuestNeedsResetReason : uint8
{
	EVAL_QuestNeedsResetReason__InvalidResult = -2,
	EVAL_QuestNeedsResetReason__NoResetNeeded = 0,
	EVAL_QuestNeedsResetReason__VersionMismatch = 1,
	EVAL_QuestNeedsResetReason__QuestDeleted = 2,
	EVAL_QuestNeedsResetReason__Cheat = 3,
	EVAL_QuestNeedsResetReason__StateError = 4,
	EVAL_QuestNeedsResetReason__StateMismatch = 5,
	EVAL_QuestNeedsResetReason__EVAL_MAX = 6,
};

enum class EVAL_QuestPlayerStateChangeType : uint8
{
	EVAL_QuestPlayerStateChangeType__Invalid = 0,
	EVAL_QuestPlayerStateChangeType__Reward = 1,
	EVAL_QuestPlayerStateChangeType__Deduction = 2,
	EVAL_QuestPlayerStateChangeType__DialogueViewed = 3,
	EVAL_QuestPlayerStateChangeType__VisitStarted = 4,
	EVAL_QuestPlayerStateChangeType__VisitCompleted = 5,
	EVAL_QuestPlayerStateChangeType__QuestReset = 6,
	EVAL_QuestPlayerStateChangeType__EVAL_MAX = 7,
};

enum class EVAL_QuestBranchingGoalChoiceStatus : uint8
{
	EVAL_QuestBranchingGoalChoiceStatus__Undecided = 0,
	EVAL_QuestBranchingGoalChoiceStatus__Rejected = 1,
	EVAL_QuestBranchingGoalChoiceStatus__Chosen = 2,
	EVAL_QuestBranchingGoalChoiceStatus__EVAL_MAX = 3,
};

enum class EVitalPersistType : uint8
{
	EVitalPersistType__None        = 0,
	EVitalPersistType__Coins       = 1,
	EVitalPersistType__CommunityPoints = 2,
	EVitalPersistType__Stamina     = 3,
	EVitalPersistType__Health      = 4,
	EVitalPersistType__PremiumCurrency = 5,
	EVitalPersistType__MedalFishing = 6,
	EVitalPersistType__Focus       = 7,
	EVitalPersistType__RestedFocus = 8,
	EVitalPersistType__Num         = 9,
	EVitalPersistType__EVitalPersistType_MAX = 10,
};

enum class EHousingPermissionLevel : uint8
{
	EHousingPermissionLevel__Owner = 0,
	EHousingPermissionLevel__CoOwner = 1,
	EHousingPermissionLevel__Companion = 2,
	EHousingPermissionLevel__BFF   = 3,
	EHousingPermissionLevel__Editor = 4,
	EHousingPermissionLevel__Contractor = 5,
	EHousingPermissionLevel__NoEntry = 6,
	EHousingPermissionLevel__Default = 7,
	EHousingPermissionLevel__Unknown = 8,
	EHousingPermissionLevel__EHousingPermissionLevel_MAX = 9,
};

enum class EInventoryAmount : uint8
{
	EInventoryAmount__FullStack    = 0,
	EInventoryAmount__SplitStack   = 1,
	EInventoryAmount__EInventoryAmount_MAX = 2,
};

enum class EDebugCheatStatType : uint8
{
	EDebugCheatStatType__Bool      = 0,
	EDebugCheatStatType__Int       = 1,
	EDebugCheatStatType__Float     = 2,
	EDebugCheatStatType__Double    = 3,
	EDebugCheatStatType__EDebugCheatStatType_MAX = 4,
};

enum class EVAL_PartyManagerState : uint8
{
	EVAL_PartyManagerState__Idle   = 0,
	EVAL_PartyManagerState__AwaitingPartyCreation = 1,
	EVAL_PartyManagerState__InParty = 2,
	EVAL_PartyManagerState__EVAL_MAX = 3,
};

enum class EGardenActionType : uint8
{
	EGardenActionType__None        = 0,
	EGardenActionType__Plant       = 1,
	EGardenActionType__Harvest     = 2,
	EGardenActionType__Water       = 3,
	EGardenActionType__Fertilize   = 4,
	EGardenActionType__TillPartial = 5,
	EGardenActionType__Till        = 6,
	EGardenActionType__Weed        = 7,
	EGardenActionType__MaxActionType = 8,
	EGardenActionType__EGardenActionType_MAX = 9,
};

enum class EHousingVisitationState : uint8
{
	EHousingVisitationState__Friends = 0,
	EHousingVisitationState__Closed = 1,
	EHousingVisitationState__Request = 2,
	EHousingVisitationState__Open  = 3,
	EHousingVisitationState__EHousingVisitationState_MAX = 4,
};

enum class EHousingSlotAction : uint8
{
	EHousingSlotAction__Activate   = 0,
	EHousingSlotAction__Rename     = 1,
	EHousingSlotAction__Purchase   = 2,
	EHousingSlotAction__Delete     = 3,
	EHousingSlotAction__VisitationChange = 4,
	EHousingSlotAction__Add        = 5,
	EHousingSlotAction__EHousingSlotAction_MAX = 6,
};

enum class EVAL_ShrineType : uint8
{
	EVAL_ShrineType__Phoenix       = 0,
	EVAL_ShrineType__Dragon        = 1,
	EVAL_ShrineType__EVAL_MAX      = 2,
};

enum class EVillagerQuestStatus : uint8
{
	EVillagerQuestStatus__NotStarted = 0,
	EVillagerQuestStatus__InProgress = 1,
	EVillagerQuestStatus__Completed = 2,
	EVillagerQuestStatus__Expired  = 3,
	EVillagerQuestStatus__Invalid  = 4,
	EVillagerQuestStatus__EVillagerQuestStatus_MAX = 5,
};

enum class EChappaChaseState : uint8
{
	EChappaChaseState__UnInitialized = 0,
	EChappaChaseState__ReadyToPlay = 1,
	EChappaChaseState__InProgress  = 2,
	EChappaChaseState__EChappaChaseState_MAX = 3,
};

enum class EValeriaCharacterEvent : uint8
{
	EValeriaCharacterEvent__Deserialized = 0,
	EValeriaCharacterEvent__NewCharacter = 1,
	EValeriaCharacterEvent__Replicated = 2,
	EValeriaCharacterEvent__EValeriaCharacterEvent_MAX = 3,
};

enum class EWorldLocationContext : uint8
{
	EWorldLocationContext__Default = 0,
	EWorldLocationContext__LimitedEvent = 1,
	EWorldLocationContext__Visit   = 2,
	EWorldLocationContext__PrivateSpace = 3,
	EWorldLocationContext__EWS     = 4,
	EWorldLocationContext__DialogueRoom = 5,
	EWorldLocationContext__EWorldLocationContext_MAX = 6,
};

enum class EValeriaClimbDashDirection : uint8
{
	EValeriaClimbDashDirection__Invalid = 0,
	EValeriaClimbDashDirection__Left = 1,
	EValeriaClimbDashDirection__UpAndLeft = 2,
	EValeriaClimbDashDirection__Up = 3,
	EValeriaClimbDashDirection__UpAndRight = 4,
	EValeriaClimbDashDirection__Right = 5,
	EValeriaClimbDashDirection__EValeriaClimbDashDirection_MAX = 6,
};

enum class EPlayerInfoState : uint8
{
	EPlayerInfoState__NotSpecified = 0,
	EPlayerInfoState__Cheats       = 1,
	EPlayerInfoState__Currencies   = 2,
	EPlayerInfoState__Map          = 3,
	EPlayerInfoState__Quests       = 4,
	EPlayerInfoState__Recipes      = 5,
	EPlayerInfoState__Relationships = 6,
	EPlayerInfoState__Skills       = 7,
	EPlayerInfoState__EPlayerInfoState_MAX = 8,
};

enum class ECrafterState : uint8
{
	ECrafterState__Invalid         = 0,
	ECrafterState__SelectingRecipe = 1,
	ECrafterState__ActionsRequired = 2,
	ECrafterState__Crafting        = 3,
	ECrafterState__FinalCook       = 4,
	ECrafterState__CollectionReady = 5,
	ECrafterState__ECrafterState_MAX = 6,
};

enum class EComplexRecipeProducerAllProductState : uint8
{
	EComplexRecipeProducerAllProductState__None = 0,
	EComplexRecipeProducerAllProductState__Needs = 1,
	EComplexRecipeProducerAllProductState__Complete = 5,
	EComplexRecipeProducerAllProductState__EComplexRecipeProducerAllProductState_MAX = 6,
};

enum class EComplexRecipeCrafterCurrentProductState : uint8
{
	EComplexRecipeCrafterCurrentProductState__None = 0,
	EComplexRecipeCrafterCurrentProductState__Complete = 5,
	EComplexRecipeCrafterCurrentProductState__Fail = 2,
	EComplexRecipeCrafterCurrentProductState__InProgress = 4,
	EComplexRecipeCrafterCurrentProductState__EComplexRecipeCrafterCurrentProductState_MAX = 6,
};

enum class ERecipeStepStartType : uint8
{
	ERecipeStepStartType__PreviousStepFinish = 0,
	ERecipeStepStartType__PreviousStepStart = 1,
	ERecipeStepStartType__ParentStepStart = 2,
	ERecipeStepStartType__RecipeStart = 3,
	ERecipeStepStartType__SpecificStepsFinished = 4,
	ERecipeStepStartType__ERecipeStepStartType_MAX = 5,
};

enum class ERecipeStepType : uint8
{
	ERecipeStepType__None          = 0,
	ERecipeStepType__RequireItem   = 1,
	ERecipeStepType__RequireInteraction = 2,
	ERecipeStepType__ERecipeStepType_MAX = 3,
};

enum class EInventoryRequestStatus : uint8
{
	EInventoryRequestStatus__Open  = 0,
	EInventoryRequestStatus__Filled = 1,
	EInventoryRequestStatus__Claimed = 2,
	EInventoryRequestStatus__EInventoryRequestStatus_MAX = 3,
};

enum class EEquipmentType : uint8
{
	EEquipmentType__Invalid        = 0,
	EEquipmentType__Gear           = 1,
	EEquipmentType__Tool           = 2,
	EEquipmentType__Primary        = 3,
	EEquipmentType__Temporary      = 4,
	EEquipmentType__EEquipmentType_MAX = 5,
};

enum class EAnimStateFish : uint8
{
	EAnimStateFish__None           = 0,
	EAnimStateFish__Idle           = 1,
	EAnimStateFish__Bite           = 2,
	EAnimStateFish__Hooked         = 3,
	EAnimStateFish__Caught         = 4,
	EAnimStateFish__StraightJump   = 5,
	EAnimStateFish__EAnimStateFish_MAX = 6,
};

enum class EFishingMiniGameResult : uint8
{
	EFishingMiniGameResult__None   = 0,
	EFishingMiniGameResult__Success = 1,
	EFishingMiniGameResult__Failure = 2,
	EFishingMiniGameResult__Cancelled = 3,
	EFishingMiniGameResult__CancelledCast = 4,
	EFishingMiniGameResult__EmptyHanded = 5,
	EFishingMiniGameResult__EFishingMiniGameResult_MAX = 6,
};

enum class EFishingNibbleLevel : uint8
{
	EFishingNibbleLevel__Aggressive = 0,
	EFishingNibbleLevel__Cautious  = 1,
	EFishingNibbleLevel__Normal    = 2,
	EFishingNibbleLevel__Strategic = 3,
	EFishingNibbleLevel__Uncertain = 4,
	EFishingNibbleLevel__EFishingNibbleLevel_MAX = 5,
};

enum class EFishingMiniGameState : uint8
{
	EFishingMiniGameState__Inactive = 0,
	EFishingMiniGameState__AimingCast = 1,
	EFishingMiniGameState__CancellingCast = 2,
	EFishingMiniGameState__DeployingCast = 3,
	EFishingMiniGameState__SelectingLoot = 4,
	EFishingMiniGameState__Waiting = 5,
	EFishingMiniGameState__Nibbling = 6,
	EFishingMiniGameState__Biting  = 7,
	EFishingMiniGameState__Reeling = 8,
	EFishingMiniGameState__Finished = 9,
	EFishingMiniGameState__Catching = 10,
	EFishingMiniGameState__EFishingMiniGameState_MAX = 11,
};

enum class EPlantingState : uint8
{
	EPlantingState__None           = 0,
	EPlantingState__Open           = 1,
	EPlantingState__NotAvailable   = 2,
	EPlantingState__Preview        = 3,
	EPlantingState__EPlantingState_MAX = 4,
};

enum class ECharacterAttachPoint : uint8
{
	ECharacterAttachPoint__None    = 0,
	ECharacterAttachPoint__LeftHand = 1,
	ECharacterAttachPoint__RightHand = 2,
	ECharacterAttachPoint__ECharacterAttachPoint_MAX = 3,
};

enum class ETrackedItemType : uint8
{
	ETrackedItemType__Default      = 0,
	ETrackedItemType__LocalPlayer  = 1,
	ETrackedItemType__RemotePlayer = 2,
	ETrackedItemType__NPC          = 3,
	ETrackedItemType__MapActor     = 4,
	ETrackedItemType__Waypoint     = 5,
	ETrackedItemType__QuestMarker  = 6,
	ETrackedItemType__ETrackedItemType_MAX = 7,
};

enum class EMinigameState : uint8
{
	EMinigameState__None           = 0,
	EMinigameState__WaitingToStart = 1,
	EMinigameState__WaitingForRelease = 2,
	EMinigameState__WaitingForPress = 3,
	EMinigameState__Start          = 4,
	EMinigameState__Running        = 5,
	EMinigameState__Penalty        = 6,
	EMinigameState__Failure        = 7,
	EMinigameState__Success        = 8,
	EMinigameState__EMinigameState_MAX = 9,
};

enum class ESubgameResult : uint8
{
	ESubgameResult__None           = 0,
	ESubgameResult__Failure        = 1,
	ESubgameResult__Success        = 2,
	ESubgameResult__ESubgameResult_MAX = 3,
};

enum class EVitalChangeFlags : uint8
{
	EVitalChangeFlags__None        = 0,
	EVitalChangeFlags__NotifyItemCarousel = 1,
	EVitalChangeFlags__TrackStat   = 2,
	EVitalChangeFlags__CreateShippingBinNotification = 4,
	EVitalChangeFlags__NotifyCarouselAndTrackStat = 3,
	EVitalChangeFlags__NotifyCarouselWithShippingBinNotificationAndTrackStat = 7,
	EVitalChangeFlags__EVitalChangeFlags_MAX = 8,
};

enum class EItemCategory : uint8
{
	EItemCategory__NotSpecified    = 0,
	EItemCategory__Consumable      = 1,
	EItemCategory__Material        = 2,
	EItemCategory__Equipment       = 3,
	EItemCategory__Customization   = 4,
	EItemCategory__Vegetable       = 5,
	EItemCategory__Fruit           = 6,
	EItemCategory__Fish            = 7,
	EItemCategory__Meat            = 8,
	EItemCategory__Spice           = 9,
	EItemCategory__Ingredient      = 10,
	EItemCategory__Storage         = 11,
	EItemCategory__Tool            = 12,
	EItemCategory__Crafter         = 13,
	EItemCategory__Junk            = 14,
	EItemCategory__Book            = 15,
	EItemCategory__Fertilizer      = 16,
	EItemCategory__Bug             = 17,
	EItemCategory__Seed            = 18,
	EItemCategory__Product         = 19,
	EItemCategory__Crop            = 20,
	EItemCategory__Gatherable      = 21,
	EItemCategory__Wallpaper       = 22,
	EItemCategory__FloorTiling     = 23,
	EItemCategory__ExteriorWallpaper = 24,
	EItemCategory__Quest           = 25,
	EItemCategory__Instrument      = 26,
	EItemCategory__EItemCategory_MAX = 27,
};

enum class EMailSenderType : uint8
{
	EMailSenderType__Player        = 0,
	EMailSenderType__Character     = 1,
	EMailSenderType__EMailSenderType_MAX = 2,
};

enum class EActionableState : uint8
{
	EActionableState__Unactionable = 0,
	EActionableState__Actionable   = 1,
	EActionableState__InAction     = 2,
	EActionableState__ActionComplete = 3,
	EActionableState__EActionableState_MAX = 4,
};

enum class EReadStatus : uint8
{
	EReadStatus__New               = 0,
	EReadStatus__Opened            = 1,
	EReadStatus__Archived          = 2,
	EReadStatus__Deleted           = 3,
	EReadStatus__EReadStatus_MAX   = 4,
};

enum class EMailType : uint8
{
	EMailType__Unknown             = 0,
	EMailType__Text                = 1,
	EMailType__Reward              = 2,
	EMailType__Gift                = 3,
	EMailType__EMailType_MAX       = 4,
};

enum class EInputType : uint8
{
	EInputType__Keyboard           = 0,
	EInputType__Gamepad            = 1,
	EInputType__Touch              = 2,
	EInputType__EInputType_MAX     = 3,
};

enum class EMessageTargetType : uint8
{
	EMessageTargetType__Server     = 0,
	EMessageTargetType__Direct     = 1,
	EMessageTargetType__Group      = 2,
	EMessageTargetType__Party      = 3,
	EMessageTargetType__PlayerGuild = 4,
	EMessageTargetType__Development = 5,
	EMessageTargetType__EMessageTargetType_MAX = 6,
};

enum class EChatMessageType : uint8
{
	EChatMessageType__Text         = 0,
	EChatMessageType__Image        = 1,
	EChatMessageType__Notification = 2,
	EChatMessageType__Valeriagram  = 3,
	EChatMessageType__EChatMessageType_MAX = 4,
};

enum class EControlMessageType : uint8
{
	EControlMessageType__Informational = 0,
	EControlMessageType__ServerInvite = 1,
	EControlMessageType__Party     = 2,
	EControlMessageType__JoinSession = 3,
	EControlMessageType__PlayerGuild = 4,
	EControlMessageType__Friend    = 5,
	EControlMessageType__InventoryRequests = 6,
	EControlMessageType__EControlMessageType_MAX = 7,
};

enum class EVAL_PresenceStatus : uint8
{
	EVAL_PresenceStatus__Online    = 0,
	EVAL_PresenceStatus__Offline   = 1,
	EVAL_PresenceStatus__Away      = 2,
	EVAL_PresenceStatus__ExtendedAway = 3,
	EVAL_PresenceStatus__DoNotDisturb = 4,
	EVAL_PresenceStatus__Chat      = 5,
	EVAL_PresenceStatus__EVAL_MAX  = 6,
};

enum class ETravelManagerStatus : uint8
{
	ETravelManagerStatus__None     = 0,
	ETravelManagerStatus__FindingSessions = 1,
	ETravelManagerStatus__WaitingForReservation = 2,
	ETravelManagerStatus__JoiningSession = 3,
	ETravelManagerStatus__PreparingForTravel = 4,
	ETravelManagerStatus__TravelFailure = 5,
	ETravelManagerStatus__ReservationFailed = 6,
	ETravelManagerStatus__NoSessionsFound = 7,
	ETravelManagerStatus__JoinSessionFailed = 8,
	ETravelManagerStatus__ConnectionFailure = 9,
	ETravelManagerStatus__UnknownFailure = 10,
	ETravelManagerStatus__ETravelManagerStatus_MAX = 11,
};

enum class EVAL_ValidateLoadoutErrorType : uint8
{
	EVAL_ValidateLoadoutErrorType__DisabledItem = 0,
	EVAL_ValidateLoadoutErrorType__InvalidVariantChannel = 1,
	EVAL_ValidateLoadoutErrorType__MissingVariantOption = 2,
	EVAL_ValidateLoadoutErrorType__BodyTypeIncompatibility = 3,
	EVAL_ValidateLoadoutErrorType__NullInMandatorySlot = 4,
	EVAL_ValidateLoadoutErrorType__EVAL_MAX = 5,
};

enum class EShaderBasedAnimEventEdge : uint8
{
	EShaderBasedAnimEventEdge__Triggered = 0,
	EShaderBasedAnimEventEdge__Started = 1,
	EShaderBasedAnimEventEdge__Ended = 2,
	EShaderBasedAnimEventEdge__EShaderBasedAnimEventEdge_MAX = 3,
};

enum class ECharacterState : uint8
{
	ECharacterState__Empty         = 0,
	ECharacterState__World         = 1,
	ECharacterState__Fishing       = 2,
	ECharacterState__Placement     = 3,
	ECharacterState__Aiming        = 5,
	ECharacterState__HousingUpgrades = 13,
	ECharacterState__Strafing      = 17,
	ECharacterState__GardenPlanting = 18,
	ECharacterState__Minigame      = 19,
	ECharacterState__MinigameTouch = 20,
	ECharacterState__Subgame       = 54,
	ECharacterState__BowAiming     = 33,
	ECharacterState__SwingReady    = 34,
	ECharacterState__Watering      = 35,
	ECharacterState__WaterRefill   = 36,
	ECharacterState__GardenFertilizing = 40,
	ECharacterState__Arcade        = 41,
	ECharacterState__Carrying      = 42,
	ECharacterState__Teleporting   = 43,
	ECharacterState__TakingPhotos  = 45,
	ECharacterState__FlowSprite    = 51,
	ECharacterState__PlayingInstrument = 52,
	ECharacterState__GardenTilling = 53,
	ECharacterState__SwingingTool  = 56,
	ECharacterState__Dialogue      = 9,
	ECharacterState__SocialPanel   = 22,
	ECharacterState__GiveGift      = 32,
	ECharacterState__ECharacterState_MAX = 57,
};

enum class EAudioMixProfiles : uint8
{
	EAudioMixProfiles__Default     = 0,
	EAudioMixProfiles__Midnight    = 1,
	EAudioMixProfiles__Studio      = 2,
	EAudioMixProfiles__EAudioMixProfiles_MAX = 3,
};

enum class ETeleportTravelType : uint8
{
	ETeleportTravelType__Default   = 0,
	ETeleportTravelType__PrivateSpace = 1,
	ETeleportTravelType__HomePlot  = 2,
	ETeleportTravelType__VisitingPlot = 3,
	ETeleportTravelType__SpecificLocation = 4,
	ETeleportTravelType__LimitedEvent = 5,
	ETeleportTravelType__ETeleportTravelType_MAX = 6,
};

enum class ESprintType : uint8
{
	ESprintType__Undefined         = 0,
	ESprintType__HoldToSprint      = 1,
	ESprintType__TapToSprint       = 2,
	ESprintType__ToggleSprint      = 3,
	ESprintType__ESprintType_MAX   = 4,
};

enum class EVAL_QuestCategory : uint8
{
	EVAL_QuestCategory__Default    = 0,
	EVAL_QuestCategory__Mastery    = 1,
	EVAL_QuestCategory__Skills     = 2,
	EVAL_QuestCategory__Villager   = 3,
	EVAL_QuestCategory__Event      = 4,
	EVAL_QuestCategory__Main       = 5,
	EVAL_QuestCategory__Pinned     = 255,
	EVAL_QuestCategory__EVAL_MAX   = 256,
};

enum class EVillagerActivityStatus : uint8
{
	EVillagerActivityStatus__Traveling = 0,
	EVillagerActivityStatus__Action = 1,
	EVillagerActivityStatus__EVillagerActivityStatus_MAX = 2,
};

enum class ERelationshipType : uint8
{
	ERelationshipType__INVALID     = 0,
	ERelationshipType__Friendship  = 1,
	ERelationshipType__Romance     = 2,
	ERelationshipType__ERelationshipType_MAX = 3,
};

enum class EMovementRelativeTo : uint8
{
	EMovementRelativeTo__Camera    = 0,
	EMovementRelativeTo__ControlRotation = 1,
	EMovementRelativeTo__EMovementRelativeTo_MAX = 2,
};

enum class ECharacterMoveMode : uint8
{
	ECharacterMoveMode__Custom     = 0,
	ECharacterMoveMode__Normal     = 1,
	ECharacterMoveMode__Strafe     = 2,
	ECharacterMoveMode__StrafeWalk = 3,
	ECharacterMoveMode__ECharacterMoveMode_MAX = 4,
};

enum class EVAL_ChatPermissions : uint8
{
	EVAL_ChatPermissions__None     = 0,
	EVAL_ChatPermissions__AllowedToSendMessages = 1,
	EVAL_ChatPermissions__ChatPanelVisible = 2,
	EVAL_ChatPermissions__All      = 3,
	EVAL_ChatPermissions__EVAL_MAX = 4,
};

enum class EComplexRecipeState : uint8
{
	EComplexRecipeState__Invalid   = 0,
	EComplexRecipeState__Active    = 1,
	EComplexRecipeState__Ended     = 2,
	EComplexRecipeState__EComplexRecipeState_MAX = 3,
};

enum class ECrafterMode : uint8
{
	ECrafterMode__None             = 0,
	ECrafterMode__AutoCraft        = 1,
	ECrafterMode__SemiAuto         = 2,
	ECrafterMode__Manual           = 3,
	ECrafterMode__ECrafterMode_MAX = 4,
};

enum class EComplexRecipeCueState : uint8
{
	EComplexRecipeCueState__None   = 0,
	EComplexRecipeCueState__Needs  = 1,
	EComplexRecipeCueState__Fail   = 2,
	EComplexRecipeCueState__Browsing = 3,
	EComplexRecipeCueState__InProgress = 4,
	EComplexRecipeCueState__Complete = 5,
	EComplexRecipeCueState__Holding = 6,
	EComplexRecipeCueState__EComplexRecipeCueState_MAX = 7,
};

enum class EValeriaFuncResult : uint8
{
	EValeriaFuncResult__Success    = 0,
	EValeriaFuncResult__Failure    = 1,
	EValeriaFuncResult__EValeriaFuncResult_MAX = 2,
};

enum class EInvitationFailureReason : uint8
{
	EInvitationFailureReason__AlreadyOnServer = 0,
	EInvitationFailureReason__DifferentMap = 1,
	EInvitationFailureReason__EInvitationFailureReason_MAX = 2,
};

enum class EPaliaScreenState : uint8
{
	EPaliaScreenState__Down        = 0,
	EPaliaScreenState__DownToBlack = 1,
	EPaliaScreenState__Black       = 2,
	EPaliaScreenState__BlackToDown = 3,
	EPaliaScreenState__BlackToLoadingScreen = 4,
	EPaliaScreenState__LoadingScreen = 5,
	EPaliaScreenState__LoadingScreenToBlack = 6,
	EPaliaScreenState__EPaliaScreenState_MAX = 7,
};

enum class EVAL_ServerSpaceType : uint8
{
	EVAL_ServerSpaceType__Invalid  = 0,
	EVAL_ServerSpaceType__HousingPlot = 1,
	EVAL_ServerSpaceType__CommunityCenter = 2,
	EVAL_ServerSpaceType__EVAL_MAX = 3,
};

enum class EContentReportType : uint8
{
	EContentReportType__Chat       = 0,
	EContentReportType__Image      = 1,
	EContentReportType__EContentReportType_MAX = 2,
};

enum class EUserReportType : uint8
{
	EUserReportType__Neutral       = 0,
	EUserReportType__Positive      = 1,
	EUserReportType__Negative      = 2,
	EUserReportType__EUserReportType_MAX = 3,
};

enum class EMapTravelReason : uint8
{
	MAP_TRAVEL_UNKNOWN             = 0,
	MAP_TRAVEL_PORTAL              = 1,
	MAP_TRAVEL_STABLES             = 2,
	MAP_TRAVEL_HOUSE               = 3,
	MAP_TRAVEL_LOBBY               = 4,
	MAP_TRAVEL_CHEATS              = 5,
	MAP_TRAVEL_MAX                 = 6,
};

enum class EVAL_ApplyCustomizationToActorContext : uint8
{
	EVAL_ApplyCustomizationToActorContext__None = 0,
	EVAL_ApplyCustomizationToActorContext__OpeningWardrobe = 1,
	EVAL_ApplyCustomizationToActorContext__ChangingWardrobeItem = 2,
	EVAL_ApplyCustomizationToActorContext__FinishCharacterCreation = 3,
	EVAL_ApplyCustomizationToActorContext__ChangeCharacterPreview = 4,
	EVAL_ApplyCustomizationToActorContext__ChangeItemPremiumStore = 5,
	EVAL_ApplyCustomizationToActorContext__SelectCharacter = 6,
	EVAL_ApplyCustomizationToActorContext__PreOpeningCinematic = 7,
	EVAL_ApplyCustomizationToActorContext__RandomizeCharacter = 8,
	EVAL_ApplyCustomizationToActorContext__ChangeBodyType = 9,
	EVAL_ApplyCustomizationToActorContext__RenderRequestsForUI = 10,
	EVAL_ApplyCustomizationToActorContext__EVAL_MAX = 11,
};

enum class EVAL_UpdateSpawnedPetContext : uint8
{
	EVAL_UpdateSpawnedPetContext__LoadoutChanged = 0,
	EVAL_UpdateSpawnedPetContext__PostTeleport = 1,
	EVAL_UpdateSpawnedPetContext__EVAL_MAX = 2,
};

enum class EVAL_SocialBlockError : uint8
{
	EVAL_SocialBlockError__None    = 0,
	EVAL_SocialBlockError__AlreadyBlocked = 1,
	EVAL_SocialBlockError__NotBlocked = 2,
	EVAL_SocialBlockError__BlockYourself = 3,
	EVAL_SocialBlockError__MiscFail = 4,
	EVAL_SocialBlockError__EVAL_MAX = 5,
};

enum class EVAL_PlayerGuildQuestRarity : uint8
{
	EVAL_PlayerGuildQuestRarity__Common = 0,
	EVAL_PlayerGuildQuestRarity__Uncommon = 1,
	EVAL_PlayerGuildQuestRarity__Rare = 2,
	EVAL_PlayerGuildQuestRarity__Num = 3,
	EVAL_PlayerGuildQuestRarity__EVAL_MAX = 4,
};

enum class EVAL_PlayerGuildQuestSize : uint8
{
	EVAL_PlayerGuildQuestSize__Small = 0,
	EVAL_PlayerGuildQuestSize__Medium = 1,
	EVAL_PlayerGuildQuestSize__Large = 2,
	EVAL_PlayerGuildQuestSize__EVAL_MAX = 3,
};

enum class EVAL_PlayerGuildMemberRole : uint8
{
	EVAL_PlayerGuildMemberRole__Member = 0,
	EVAL_PlayerGuildMemberRole__Officer = 1,
	EVAL_PlayerGuildMemberRole__Leader = 2,
	EVAL_PlayerGuildMemberRole__EVAL_MAX = 3,
};

enum class EVAL_PlayerGuildInvitationPolicy : uint8
{
	EVAL_PlayerGuildInvitationPolicy__LeaderInviteOnly = 0,
	EVAL_PlayerGuildInvitationPolicy__OfficerInviteOnly = 1,
	EVAL_PlayerGuildInvitationPolicy__Open = 2,
	EVAL_PlayerGuildInvitationPolicy__EVAL_MAX = 3,
};

enum class EVAL_PlayerGuildApplicationPolicy : uint8
{
	EVAL_PlayerGuildApplicationPolicy__Closed = 0,
	EVAL_PlayerGuildApplicationPolicy__LeaderApprovalRequired = 1,
	EVAL_PlayerGuildApplicationPolicy__OfficerApprovalRequired = 2,
	EVAL_PlayerGuildApplicationPolicy__Open = 3,
	EVAL_PlayerGuildApplicationPolicy__EVAL_MAX = 4,
};

enum class EPlantSize : uint8
{
	EPlantSize__Default            = 0,
	EPlantSize__TwoByTwo           = 1,
	EPlantSize__ThreeByThree       = 2,
	EPlantSize__EPlantSize_MAX     = 3,
};

enum class EItemStorageCategory : uint8
{
	EItemStorageCategory__NotSpecified = 0,
	EItemStorageCategory__Alchemy  = 1,
	EItemStorageCategory__All      = 2,
	EItemStorageCategory__Bugs     = 3,
	EItemStorageCategory__Cooking  = 4,
	EItemStorageCategory__Crops    = 5,
	EItemStorageCategory__Decor    = 6,
	EItemStorageCategory__Equipment = 7,
	EItemStorageCategory__Fish     = 8,
	EItemStorageCategory__Gatherable = 9,
	EItemStorageCategory__Materials = 10,
	EItemStorageCategory__Products = 11,
	EItemStorageCategory__Seeds    = 12,
	EItemStorageCategory__Sorted   = 13,
	EItemStorageCategory__EItemStorageCategory_MAX = 14,
};

enum class EItemQuality : uint8
{
	EItemQuality__NotSpecified     = 0,
	EItemQuality__Simple           = 1,
	EItemQuality__Standard         = 2,
	EItemQuality__Fine             = 3,
	EItemQuality__Exquisite        = 4,
	EItemQuality__Impeccable       = 5,
	EItemQuality__Perfect          = 6,
	EItemQuality__EItemQuality_MAX = 7,
};

enum class EItemRarity : uint8
{
	EItemRarity__NotSpecified      = 0,
	EItemRarity__Abundant          = 1,
	EItemRarity__Common            = 2,
	EItemRarity__Uncommon          = 3,
	EItemRarity__Rare              = 4,
	EItemRarity__Epic              = 5,
	EItemRarity__Legendary         = 6,
	EItemRarity__EItemRarity_MAX   = 7,
};

enum class EFencePlacementType : uint8
{
	EFencePlacementType__NotAFence = 0,
	EFencePlacementType__Fence     = 1,
	EFencePlacementType__FenceColumn = 2,
	EFencePlacementType__FenceGate = 3,
	EFencePlacementType__EFencePlacementType_MAX = 4,
};

enum class EValeriaGameAction : uint8
{
	EValeriaGameAction__TillSoil   = 0,
	EValeriaGameAction__WaterTile  = 1,
	EValeriaGameAction__PullWeed   = 2,
	EValeriaGameAction__EValeriaGameAction_MAX = 3,
};

enum class EVillagerQuestBranchingCategory : uint8
{
	EVillagerQuestBranchingCategory__Mandatory = 0,
	EVillagerQuestBranchingCategory__BranchingCategory1 = 1,
	EVillagerQuestBranchingCategory__BranchingCategory2 = 2,
	EVillagerQuestBranchingCategory__BranchingCategory3 = 3,
	EVillagerQuestBranchingCategory__EVillagerQuestBranchingCategory_MAX = 4,
};

enum class EVillagerQuestRequirementType : uint8
{
	EVillagerQuestRequirementType__Item = 0,
	EVillagerQuestRequirementType__MeetVillager = 1,
	EVillagerQuestRequirementType__CatchFish = 2,
	EVillagerQuestRequirementType__CraftItem = 3,
	EVillagerQuestRequirementType__CompleteBillboard = 4,
	EVillagerQuestRequirementType__HasSeenDialogue = 5,
	EVillagerQuestRequirementType__Vital = 6,
	EVillagerQuestRequirementType__LearnRecipe = 7,
	EVillagerQuestRequirementType__GiftAVillager = 8,
	EVillagerQuestRequirementType__AcquireHouseStructure = 9,
	EVillagerQuestRequirementType__AcquireSkillLevel = 10,
	EVillagerQuestRequirementType__GatherItem = 11,
	EVillagerQuestRequirementType__Purchase = 12,
	EVillagerQuestRequirementType__Sell = 13,
	EVillagerQuestRequirementType__Harvest = 14,
	EVillagerQuestRequirementType__ViewMail = 15,
	EVillagerQuestRequirementType__PlayerTag = 16,
	EVillagerQuestRequirementType__Kill = 17,
	EVillagerQuestRequirementType__ContributeToBillboard = 18,
	EVillagerQuestRequirementType__DiscoverVillagerGiftPreference = 19,
	EVillagerQuestRequirementType__UseItem = 20,
	EVillagerQuestRequirementType__Loot = 21,
	EVillagerQuestRequirementType__Acquire = 22,
	EVillagerQuestRequirementType__Currency = 23,
	EVillagerQuestRequirementType__Spend = 24,
	EVillagerQuestRequirementType__PlotValue = 25,
	EVillagerQuestRequirementType__GameAction = 26,
	EVillagerQuestRequirementType__StatReached = 27,
	EVillagerQuestRequirementType__EVillagerQuestRequirementType_MAX = 28,
};

enum class EQuestIconToUse : uint8
{
	EQuestIconToUse__None          = 0,
	EQuestIconToUse__VillagerIcon  = 1,
	EQuestIconToUse__CustomIcon    = 2,
	EQuestIconToUse__EQuestIconToUse_MAX = 3,
};

enum class EBuffStackingRule : uint8
{
	EBuffStackingRule__NotSpecified = 0,
	EBuffStackingRule__Infinite    = 1,
	EBuffStackingRule__Unique      = 3,
	EBuffStackingRule__UniqueReplace = 4,
	EBuffStackingRule__Stacks      = 6,
	EBuffStackingRule__ReplaceIfInSameGroup = 7,
	EBuffStackingRule__StrongestInGroupReplacesOrRefreshes = 8,
	EBuffStackingRule__EBuffStackingRule_MAX = 9,
};

enum class EBuffEffect : uint8
{
	EBuffEffect__NotSpecified      = 0,
	EBuffEffect__HealthMax         = 5,
	EBuffEffect__MovementAcceleration = 6,
	EBuffEffect__MovementRotation  = 7,
	EBuffEffect__MovementSpeed     = 8,
	EBuffEffect__FocusBonusExperiencePercent = 11,
	EBuffEffect__ClimbingSpeed     = 12,
	EBuffEffect__GlideSpeed        = 13,
	EBuffEffect__EBuffEffect_MAX   = 14,
};

enum class EBuffDisplayType : uint8
{
	EBuffDisplayType__NotSpecified = 0,
	EBuffDisplayType__Buff         = 1,
	EBuffDisplayType__Debuff       = 2,
	EBuffDisplayType__Appetite     = 3,
	EBuffDisplayType__EBuffDisplayType_MAX = 4,
};

enum class EShopCostScalingType : uint8
{
	EShopCostScalingType__None     = 0,
	EShopCostScalingType__NumberPurchased = 1,
	EShopCostScalingType__EShopCostScalingType_MAX = 2,
};

enum class EScalingRewardType : uint8
{
	EScalingRewardType__Disabled   = 0,
	EScalingRewardType__AddVital   = 1,
	EScalingRewardType__AddVitalMax = 2,
	EScalingRewardType__Currency   = 3,
	EScalingRewardType__EScalingRewardType_MAX = 4,
};

enum class ESkillCategory : uint8
{
	ESkillCategory__None           = 0,
	ESkillCategory__Gathering      = 1,
	ESkillCategory__Crafting       = 2,
	ESkillCategory__ESkillCategory_MAX = 3,
};

enum class ERelationshipDifficulty : uint8
{
	ERelationshipDifficulty__Easy  = 0,
	ERelationshipDifficulty__Medium = 1,
	ERelationshipDifficulty__Hard  = 2,
	ERelationshipDifficulty__ERelationshipDifficulty_MAX = 3,
};

enum class EVillagerGiftDifficultyGrouping : uint8
{
	EVillagerGiftDifficultyGrouping__Unspecified = 0,
	EVillagerGiftDifficultyGrouping__Difficulty1 = 1,
	EVillagerGiftDifficultyGrouping__Difficulty2 = 2,
	EVillagerGiftDifficultyGrouping__Difficulty3 = 3,
	EVillagerGiftDifficultyGrouping__Difficulty4 = 4,
	EVillagerGiftDifficultyGrouping__EVillagerGiftDifficultyGrouping_MAX = 5,
};

enum class EValeriaPersonalityElement : uint8
{
	EValeriaPersonalityElement__None = 0,
	EValeriaPersonalityElement__Air = 1,
	EValeriaPersonalityElement__Earth = 2,
	EValeriaPersonalityElement__Fire = 3,
	EValeriaPersonalityElement__Water = 4,
	EValeriaPersonalityElement__EValeriaPersonalityElement_MAX = 5,
};

enum class EModificationCostType : uint8
{
	EModificationCostType__Vital   = 0,
	EModificationCostType__Currency = 1,
	EModificationCostType__Item    = 2,
	EModificationCostType__Num     = 3,
	EModificationCostType__EModificationCostType_MAX = 4,
};

enum class EAmmoType : uint8
{
	EAmmoType__None                = 0,
	EAmmoType__FishingBait         = 1,
	EAmmoType__HuntingAmmo         = 2,
	EAmmoType__InsectBall          = 3,
	EAmmoType__COUNT               = 4,
	EAmmoType__EAmmoType_MAX       = 5,
};

enum class EDialogueType : uint8
{
	EDialogueType__Default         = 0,
	EDialogueType__FirstMeeting    = 1,
	EDialogueType__Greeting        = 2,
	EDialogueType__Dismiss         = 3,
	EDialogueType__ChoiceResponse  = 4,
	EDialogueType__GiftResponse    = 5,
	EDialogueType__Chat            = 6,
	EDialogueType__Flirt           = 7,
	EDialogueType__GiftHint        = 9,
	EDialogueType__QuestStart      = 20,
	EDialogueType__QuestHint       = 21,
	EDialogueType__QuestGoal       = 22,
	EDialogueType__QuestTurnIn     = 23,
	EDialogueType__QuestComplete   = 24,
	EDialogueType__ImportantDialogue = 30,
	EDialogueType__EDialogueType_MAX = 31,
};

enum class EQuestDurationType : uint8
{
	EQuestDurationType__TimeBased  = 0,
	EQuestDurationType__ThruAvailability = 1,
	EQuestDurationType__EQuestDurationType_MAX = 2,
};

enum class EQuestRequirementType : uint8
{
	EQuestRequirementType__None    = 0,
	EQuestRequirementType__Item    = 1,
	EQuestRequirementType__EQuestRequirementType_MAX = 2,
};

enum class EQuestRewardType : uint8
{
	EQuestRewardType__None         = 0,
	EQuestRewardType__Item         = 1,
	EQuestRewardType__Vital        = 2,
	EQuestRewardType__Relationship = 3,
	EQuestRewardType__Recipe       = 4,
	EQuestRewardType__Buff         = 5,
	EQuestRewardType__Skill        = 6,
	EQuestRewardType__ItemUse      = 7,
	EQuestRewardType__BagUpgrade   = 8,
	EQuestRewardType__TriggerQuest = 9,
	EQuestRewardType__Misc         = 10,
	EQuestRewardType__Mail         = 11,
	EQuestRewardType__GiftPreference = 12,
	EQuestRewardType__PlayerTag    = 13,
	EQuestRewardType__Visit        = 15,
	EQuestRewardType__Currency     = 16,
	EQuestRewardType__EQuestRewardType_MAX = 17,
};

enum class EItemSortType : uint8
{
	EItemSortType__NotSpecified    = 0,
	EItemSortType__Alphabetical    = 1,
	EItemSortType__EItemSortType_MAX = 2,
};

enum class EPlacementHoverType : uint8
{
	EPlacementHoverType__None      = 0,
	EPlacementHoverType__HousingPlotUnlock = 1,
	EPlacementHoverType__Actor     = 2,
	EPlacementHoverType__Alteration = 3,
	EPlacementHoverType__EPlacementHoverType_MAX = 4,
};

enum class EVillagerScheduleActivityType : uint8
{
	EVillagerScheduleActivityType__None = 0,
	EVillagerScheduleActivityType__Work = 1,
	EVillagerScheduleActivityType__FreeTime = 2,
	EVillagerScheduleActivityType__Follow = 3,
	EVillagerScheduleActivityType__PrivateSpace = 4,
	EVillagerScheduleActivityType__Absent = 5,
	EVillagerScheduleActivityType__EVillagerScheduleActivityType_MAX = 6,
};

enum class ELootFilterResult : uint8
{
	ELootFilterResult__Success     = 0,
	ELootFilterResult__GenericFail = 1,
	ELootFilterResult__AlreadyOwns = 2,
	ELootFilterResult__IncorrectTimeOfDay = 3,
	ELootFilterResult__IncorrectWeather = 4,
	ELootFilterResult__DoesntMeetFriendshipReq = 5,
	ELootFilterResult__DoesntMeetRomanceReq = 6,
	ELootFilterResult__TooManyForTagReq = 7,
	ELootFilterResult__TooFewForTagReq = 8,
	ELootFilterResult__QuestFilterFail = 9,
	ELootFilterResult__MissingRequiredItems = 10,
	ELootFilterResult__MissingRequiredVitals = 11,
	ELootFilterResult__MissingRequiredAccomplishments = 12,
	ELootFilterResult__MissingRequiredRecipes = 13,
	ELootFilterResult__ELootFilterResult_MAX = 14,
};

enum class EVAL_TeleportCompFlags : uint8
{
	EVAL_TeleportCompFlags__None   = 0,
	EVAL_TeleportCompFlags__LockedControl = 1,
	EVAL_TeleportCompFlags__EVAL_MAX = 2,
};

enum class EValeriaStatModificationType : uint8
{
	EValeriaStatModificationType__None = 0,
	EValeriaStatModificationType__Smallest = 1,
	EValeriaStatModificationType__Largest = 2,
	EValeriaStatModificationType__Increment = 3,
	EValeriaStatModificationType__Decrement = 4,
	EValeriaStatModificationType__Set = 5,
	EValeriaStatModificationType__EValeriaStatModificationType_MAX = 6,
};

enum class EAimingState : uint8
{
	EAimingState__ZoomingIn        = 0,
	EAimingState__ZoomedIn         = 1,
	EAimingState__ZoomingOut       = 2,
	EAimingState__ZoomedOut        = 3,
	EAimingState__INVALID          = 4,
	EAimingState__EAimingState_MAX = 5,
};

enum class EAimingAnimationAimOffset : uint8
{
	EAimingAnimationAimOffset__Unspecified = 0,
	EAimingAnimationAimOffset__BowFiring = 1,
	EAimingAnimationAimOffset__Throwing = 2,
	EAimingAnimationAimOffset__Slot3 = 3,
	EAimingAnimationAimOffset__Slot4 = 4,
	EAimingAnimationAimOffset__Slot5 = 5,
	EAimingAnimationAimOffset__Slot6 = 6,
	EAimingAnimationAimOffset__Slot7 = 7,
	EAimingAnimationAimOffset__EAimingAnimationAimOffset_MAX = 8,
};

enum class EValeriaNoiseEventVolume : uint8
{
	EValeriaNoiseEventVolume__Undefined = 0,
	EValeriaNoiseEventVolume__Quiet = 1,
	EValeriaNoiseEventVolume__Normal = 2,
	EValeriaNoiseEventVolume__Loud = 3,
	EValeriaNoiseEventVolume__EValeriaNoiseEventVolume_MAX = 4,
};

enum class EValeriaNoiseStealthType : uint8
{
	EValeriaNoiseStealthType__SmokeCandle = 0,
	EValeriaNoiseStealthType__EValeriaNoiseStealthType_MAX = 1,
};

enum class EAnimMappingCachePolicy : uint8
{
	NoCaching                      = 0,
	TryToStore                     = 1,
	TryToUseCached                 = 2,
	EAnimMappingCachePolicy_MAX    = 3,
};

enum class EBuffClientActionType : uint8
{
	EBuffClientActionType__None    = 0,
	EBuffClientActionType__Remove  = 1,
	EBuffClientActionType__EBuffClientActionType_MAX = 2,
};

enum class EBundleType : uint8
{
	BundleType__Unspecified        = 0,
	BundleType__Water              = 1,
	BundleType__Fire               = 2,
	BundleType__Air                = 3,
	BundleType__Earth              = 4,
	BundleType__BundleType_MAX     = 5,
};

enum class ECameraTargetMode : uint8
{
	CameraTargetMode__HardLock     = 0,
	CameraTargetMode__HardLockRotate = 1,
	CameraTargetMode__FreeLook     = 2,
	CameraTargetMode__CameraTargetMode_MAX = 3,
};

enum class ECharacterCreationHairColor : uint8
{
	ECharacterCreationHairColor__Black = 0,
	ECharacterCreationHairColor__Blonde = 1,
	ECharacterCreationHairColor__Blue = 2,
	ECharacterCreationHairColor__Brown = 3,
	ECharacterCreationHairColor__Green = 4,
	ECharacterCreationHairColor__Red = 5,
	ECharacterCreationHairColor__White = 6,
	ECharacterCreationHairColor__ECharacterCreationHairColor_MAX = 7,
};

enum class ECustomizationItemSlot : uint8
{
	ECustomizationItemSlot__FullBody = 0,
	ECustomizationItemSlot__Torso  = 1,
	ECustomizationItemSlot__Legs   = 2,
	ECustomizationItemSlot__ECustomizationItemSlot_MAX = 3,
};

enum class EMouseControlMode : uint8
{
	EMouseControlMode__GameOnly    = 0,
	EMouseControlMode__UiOnly      = 1,
	EMouseControlMode__UiAndGame   = 2,
	EMouseControlMode__EMouseControlMode_MAX = 3,
};

enum class ECrafterEngageResult : uint8
{
	ECrafterEngageResult__None     = 0,
	ECrafterEngageResult__Ok       = 1,
	ECrafterEngageResult__Ok_MatchesDesiredState = 2,
	ECrafterEngageResult__Fail_TooFarAway = 3,
	ECrafterEngageResult__Fail_OtherPlayerEngaging = 4,
	ECrafterEngageResult__ECrafterEngageResult_MAX = 5,
};

enum class ECrafterStepState : uint8
{
	ECrafterStepState__NotStarted  = 0,
	ECrafterStepState__InProgress  = 1,
	ECrafterStepState__Paused      = 2,
	ECrafterStepState__Completed   = 4,
	ECrafterStepState__Expired     = 8,
	ECrafterStepState__Done        = 12,
	ECrafterStepState__ECrafterStepState_MAX = 13,
};

enum class EComplexRecipeIngredientState : uint8
{
	EComplexRecipeIngredientState__None = 0,
	EComplexRecipeIngredientState__Browsing = 3,
	EComplexRecipeIngredientState__Holding = 6,
	EComplexRecipeIngredientState__EComplexRecipeIngredientState_MAX = 7,
};

enum class ECraftingRequestItemMode : uint8
{
	ECraftingRequestItemMode__None = 0,
	ECraftingRequestItemMode__AutoFetch = 1,
	ECraftingRequestItemMode__Manual = 2,
	ECraftingRequestItemMode__ECraftingRequestItemMode_MAX = 3,
};

enum class EValeriaNoiseEventType : uint8
{
	EValeriaNoiseEventType__NetSwing = 0,
	EValeriaNoiseEventType__SprintFootstep = 1,
	EValeriaNoiseEventType__RunFootstep = 2,
	EValeriaNoiseEventType__WalkFootstep = 3,
	EValeriaNoiseEventType__JumpLanding = 4,
	EValeriaNoiseEventType__AxeHit = 5,
	EValeriaNoiseEventType__PickaxeHit = 6,
	EValeriaNoiseEventType__EValeriaNoiseEventType_MAX = 7,
};

enum class ECurrentBehavior : uint8
{
	ECurrentBehavior__INVALID      = 0,
	ECurrentBehavior__Wander       = 1,
	ECurrentBehavior__BecomeAware  = 2,
	ECurrentBehavior__Flee         = 3,
	ECurrentBehavior__Death        = 4,
	ECurrentBehavior__Despawn      = 5,
	ECurrentBehavior__HitReact     = 6,
	ECurrentBehavior__Stunned      = 7,
	ECurrentBehavior__FallIntoPit  = 8,
	ECurrentBehavior__ECurrentBehavior_MAX = 9,
};

enum class EErrorMessageType : uint8
{
	EErrorMessageType__Error       = 0,
	EErrorMessageType__Info        = 1,
	EErrorMessageType__Success     = 2,
	EErrorMessageType__EErrorMessageType_MAX = 3,
};

enum class EFactionRelationshipType : uint8
{
	EFactionRelationshipType__Ally = 0,
	EFactionRelationshipType__Enemy = 1,
	EFactionRelationshipType__Neutral = 2,
	EFactionRelationshipType__Ignore = 3,
	EFactionRelationshipType__EFactionRelationshipType_MAX = 4,
};

enum class EFenceMeshType : uint8
{
	EFenceMeshType__FenceStartPost = 0,
	EFenceMeshType__FenceEndPost   = 1,
	EFenceMeshType__FenceSpan      = 2,
	EFenceMeshType__GateStartPost  = 3,
	EFenceMeshType__GateEndPost    = 4,
	EFenceMeshType__Gate           = 5,
	EFenceMeshType__Column         = 6,
	EFenceMeshType__EFenceMeshType_MAX = 7,
};

enum class EFishingCastIndicatorStatus : uint8
{
	EFishingCastIndicatorStatus__UnfishableGround = 0,
	EFishingCastIndicatorStatus__FishableWater = 1,
	EFishingCastIndicatorStatus__EFishingCastIndicatorStatus_MAX = 2,
};

enum class EFishingState_NEW : uint8
{
	EFishingState_NEW__None        = 0,
	EFishingState_NEW__Aiming      = 1,
	EFishingState_NEW__CastInProgress = 2,
	EFishingState_NEW__WaitingForBite = 3,
	EFishingState_NEW__Bite        = 4,
	EFishingState_NEW__Reeling     = 5,
	EFishingState_NEW__FishCaught  = 6,
	EFishingState_NEW__Celebration = 7,
	EFishingState_NEW__EFishingState_MAX = 8,
};

enum class EFishingCelebrationTier : uint8
{
	EFishingCelebrationTier__None  = 0,
	EFishingCelebrationTier__Basic = 1,
	EFishingCelebrationTier__Medium = 2,
	EFishingCelebrationTier__High  = 3,
	EFishingCelebrationTier__EFishingCelebrationTier_MAX = 4,
};

enum class EFishingState_OLD : uint8
{
	EFishingState_OLD__None        = 0,
	EFishingState_OLD__AimingCast  = 1,
	EFishingState_OLD__RotatingToCast = 2,
	EFishingState_OLD__DeployingCast = 3,
	EFishingState_OLD__PlayingMiniGame = 4,
	EFishingState_OLD__EFishingState_MAX = 5,
};

enum class EFFishingLevelSegmentActionType : uint8
{
	FFishingLevelSegmentActionType__MoveTo = 0,
	FFishingLevelSegmentActionType__JumpTo = 1,
	FFishingLevelSegmentActionType__FFishingLevelSegmentActionType_MAX = 2,
};

enum class EFishingViewStatePhase : uint8
{
	EFishingViewStatePhase__Idle   = 0,
	EFishingViewStatePhase__Active = 1,
	EFishingViewStatePhase__Ended  = 2,
	EFishingViewStatePhase__EFishingViewStatePhase_MAX = 3,
};

enum class EFishingSafeTier : uint8
{
	EFishingSafeTier__Safe         = 0,
	EFishingSafeTier__Caution      = 1,
	EFishingSafeTier__Danger       = 2,
	EFishingSafeTier__EFishingSafeTier_MAX = 3,
};

enum class EFishingBobberHitSomethingResult : uint8
{
	EFishingBobberHitSomethingResult__FishableWater = 0,
	EFishingBobberHitSomethingResult__UnfishableWater = 1,
	EFishingBobberHitSomethingResult__TooShallowOrTooLowWater = 2,
	EFishingBobberHitSomethingResult__Other = 3,
	EFishingBobberHitSomethingResult__EFishingBobberHitSomethingResult_MAX = 4,
};

enum class EFriendStatus : uint8
{
	EFriendStatus__Unknown         = 0,
	EFriendStatus__Accepted        = 1,
	EFriendStatus__PendingInbound  = 2,
	EFriendStatus__PendingOutbound = 3,
	EFriendStatus__Blocked         = 4,
	EFriendStatus__Suggested       = 5,
	EFriendStatus__EFriendStatus_MAX = 6,
};

enum class EQuestProgressConditionStatus : uint8
{
	EQuestProgressConditionStatus__NotStarted = 0,
	EQuestProgressConditionStatus__InProgress = 1,
	EQuestProgressConditionStatus__Completed = 2,
	EQuestProgressConditionStatus__Expired = 3,
	EQuestProgressConditionStatus__EQuestProgressConditionStatus_MAX = 4,
};

enum class EVAL_GameplayEventSourceTargetType : uint8
{
	EVAL_GameplayEventSourceTargetType__Any = 0,
	EVAL_GameplayEventSourceTargetType__Player = 1,
	EVAL_GameplayEventSourceTargetType__Villager = 2,
	EVAL_GameplayEventSourceTargetType__Creature = 3,
	EVAL_GameplayEventSourceTargetType__EVAL_MAX = 4,
};

enum class EVAL_GameplayEventPlayerRelationship : uint8
{
	EVAL_GameplayEventPlayerRelationship__Any = 0,
	EVAL_GameplayEventPlayerRelationship__Self = 1,
	EVAL_GameplayEventPlayerRelationship__EVAL_MAX = 2,
};

enum class EVAL_GE_AcquireItem_Method : uint8
{
	EVAL_GE_AcquireItem_Method__Any = 0,
	EVAL_GE_AcquireItem_Method__Gather = 1,
	EVAL_GE_AcquireItem_Method__Craft = 2,
	EVAL_GE_AcquireItem_Method__Loot = 4,
	EVAL_GE_AcquireItem_Method__Harvest = 8,
	EVAL_GE_AcquireItem_Method__Purchase = 16,
	EVAL_GE_AcquireItem_Method__Mail = 32,
	EVAL_GE_AcquireItem_Method__EVAL_GE_AcquireItem_MAX = 33,
};

enum class EVAL_GE_ReleaseItem_Method : uint8
{
	EVAL_GE_ReleaseItem_Method__Any = 0,
	EVAL_GE_ReleaseItem_Method__Discard = 1,
	EVAL_GE_ReleaseItem_Method__Sell = 2,
	EVAL_GE_ReleaseItem_Method__Use = 4,
	EVAL_GE_ReleaseItem_Method__FulfillRequest = 8,
	EVAL_GE_ReleaseItem_Method__EVAL_GE_ReleaseItem_MAX = 9,
};

enum class EGardenTileDirection : uint8
{
	EGardenTileDirection__N        = 0,
	EGardenTileDirection__NE       = 1,
	EGardenTileDirection__E        = 2,
	EGardenTileDirection__SE       = 3,
	EGardenTileDirection__S        = 4,
	EGardenTileDirection__SW       = 5,
	EGardenTileDirection__W        = 6,
	EGardenTileDirection__NW       = 7,
	EGardenTileDirection__EGardenTileDirection_MAX = 8,
};

enum class EGardenTileNeighborAdjacency : uint8
{
	EGardenTileNeighborAdjacency__Invalid = 0,
	EGardenTileNeighborAdjacency__Border = 1,
	EGardenTileNeighborAdjacency__Corner = 2,
	EGardenTileNeighborAdjacency__BorderAndCorner = 3,
	EGardenTileNeighborAdjacency__EGardenTileNeighborAdjacency_MAX = 4,
};

enum class EGardeningWeedingMinigameInteractStyle : uint8
{
	EGardeningWeedingMinigameInteractStyle__None = 0,
	EGardeningWeedingMinigameInteractStyle__PressToWeed = 1,
	EGardeningWeedingMinigameInteractStyle__HoldToRelease = 2,
	EGardeningWeedingMinigameInteractStyle__HoldToReleaseRetry = 3,
	EGardeningWeedingMinigameInteractStyle__Default = 1,
	EGardeningWeedingMinigameInteractStyle__EGardeningWeedingMinigameInteractStyle_MAX = 4,
};

enum class EGearChangeResult : uint8
{
	EGearChangeResult__Success     = 0,
	EGearChangeResult__Failure     = 1,
	EGearChangeResult__NotEnoughInventorySpace = 2,
	EGearChangeResult__ItemToAddNotAGear = 3,
	EGearChangeResult__RomancePinSlotOnCooldown = 4,
	EGearChangeResult__EGearChangeResult_MAX = 5,
};

enum class EUseEventType : uint8
{
	EUseEventType__None            = 0,
	EUseEventType__Pressed         = 1,
	EUseEventType__Released        = 2,
	EUseEventType__EUseEventType_MAX = 3,
};

enum class EInteractEventType : uint8
{
	EInteractEventType__None       = 0,
	EInteractEventType__Pressed    = 1,
	EInteractEventType__Released   = 3,
	EInteractEventType__EInteractEventType_MAX = 4,
};

enum class EInteractEventIndex : uint8
{
	EInteractEventIndex__Primary   = 0,
	EInteractEventIndex__Secondary = 1,
	EInteractEventIndex__MousePrimary = 2,
	EInteractEventIndex__MouseSecondary = 3,
	EInteractEventIndex__EInteractEventIndex_MAX = 4,
};

enum class ESubgameState : uint8
{
	ESubgameState__None            = 0,
	ESubgameState__WaitingToStart  = 1,
	ESubgameState__Active          = 2,
	ESubgameState__Complete        = 3,
	ESubgameState__ESubgameState_MAX = 4,
};

enum class ERpcMontageAction : uint8
{
	ERpcMontageAction__None        = 0,
	ERpcMontageAction__Start       = 1,
	ERpcMontageAction__Stop        = 2,
	ERpcMontageAction__ERpcMontageAction_MAX = 3,
};

enum class ERpcAction : uint8
{
	ERpcAction__None               = 0,
	ERpcAction__Default            = 1,
	ERpcAction__Synchronous        = 2,
	ERpcAction__ClientToServer     = 3,
	ERpcAction__ServerToClient     = 4,
	ERpcAction__ServerMulticast    = 5,
	ERpcAction__ServerMulticastRemote = 6,
	ERpcAction__ERpcAction_MAX     = 7,
};

enum class ERequirementType : uint8
{
	ERequirementType__Default      = 0,
	ERequirementType__ItemUse      = 1,
	ERequirementType__PlayerActionUse = 2,
	ERequirementType__ERequirementType_MAX = 3,
};

enum class EHitReactionType : uint8
{
	EHitReactionType__None         = 0,
	EHitReactionType__Flinch       = 1,
	EHitReactionType__Stagger      = 2,
	EHitReactionType__Knockback    = 3,
	EHitReactionType__EHitReactionType_MAX = 4,
};

enum class ETeleportState : uint8
{
	ETeleportState__Inactive       = 0,
	ETeleportState__Preparing      = 1,
	ETeleportState__CoolingDown    = 2,
	ETeleportState__Disrupted      = 3,
	ETeleportState__ETeleportState_MAX = 4,
};

enum class EInstrumentType : uint8
{
	EInstrumentType__Invalid       = 0,
	EInstrumentType__Wind          = 1,
	EInstrumentType__EInstrumentType_MAX = 2,
};

enum class EInteractablePlateVerticalOffsetDirection : uint8
{
	EInteractablePlateVerticalOffsetDirection__Up = 0,
	EInteractablePlateVerticalOffsetDirection__Down = 1,
	EInteractablePlateVerticalOffsetDirection__EInteractablePlateVerticalOffsetDirection_MAX = 2,
};

enum class EVAL_InteractorOperation : uint8
{
	EVAL_InteractorOperation__UnlockPlayer = 0,
	EVAL_InteractorOperation__LockPlayer = 1,
	EVAL_InteractorOperation__EVAL_MAX = 2,
};

enum class EInventoryAddItemFlags : uint8
{
	EInventoryAddItemFlags__None   = 0,
	EInventoryAddItemFlags__NotifyItemCarousel = 1,
	EInventoryAddItemFlags__AllowOverflow = 2,
	EInventoryAddItemFlags__Carry  = 4,
	EInventoryAddItemFlags__TrackStat = 8,
	EInventoryAddItemFlags__AllowPickupRewards = 16,
	EInventoryAddItemFlags__SendOverflowToStorage = 32,
	EInventoryAddItemFlags__NotifyCarouselAndAllowOverflow = 3,
	EInventoryAddItemFlags__NorifyCarouselAndSendOverflowToStorage = 33,
	EInventoryAddItemFlags__NotifyCarouselAndTrackStat = 9,
	EInventoryAddItemFlags__NotifyCarouselAndTrackStatWithOverflow = 11,
	EInventoryAddItemFlags__NotifyCarouselAndTrackStatAndSendOverflowToStorage = 41,
	EInventoryAddItemFlags__NotifyCarouselAndTrackStatAndAllowOverflowWithPickupRewards = 27,
	EInventoryAddItemFlags__NotifyCarouselAndTrackStatAndSendOverflowToStorageWithPickupRewards = 57,
	EInventoryAddItemFlags__EInventoryAddItemFlags_MAX = 58,
};

enum class EInventoryOperation : uint8
{
	EInventoryOperation__None      = 0,
	EInventoryOperation__Add       = 1,
	EInventoryOperation__Remove    = 2,
	EInventoryOperation__AddRemove = 3,
	EInventoryOperation__EInventoryOperation_MAX = 4,
};

enum class EGardenBuffEffectType : uint8
{
	EGardenBuffEffectType__None    = 0,
	EGardenBuffEffectType__PreventWeedGrowth = 1,
	EGardenBuffEffectType__HarvestBooster = 2,
	EGardenBuffEffectType__IncreaseOutputQuality = 3,
	EGardenBuffEffectType__RetainWater = 4,
	EGardenBuffEffectType__DoubleGrowthRate = 5,
	EGardenBuffEffectType__MaxEffectType = 6,
	EGardenBuffEffectType__EGardenBuffEffectType_MAX = 7,
};

enum class EWateringTilePattern : uint8
{
	EWateringTilePattern__SingleTile = 0,
	EWateringTilePattern__BorderTiles = 1,
	EWateringTilePattern__BorderAndCornerTiles = 2,
	EWateringTilePattern__EWateringTilePattern_MAX = 3,
};

enum class EValeriaStorageType : uint8
{
	EValeriaStorageType__None      = 0,
	EValeriaStorageType__Carried   = 1,
	EValeriaStorageType__CraftingShelved = 2,
	EValeriaStorageType__Inventory = 4,
	EValeriaStorageType__PlayerStorage = 8,
	EValeriaStorageType__All       = 255,
	EValeriaStorageType__EValeriaStorageType_MAX = 256,
};

enum class EIOMode : uint8
{
	EIOMode__ReadOnly              = 0,
	EIOMode__ReadWrite             = 1,
	EIOMode__EIOMode_MAX           = 2,
};

enum class ELootAchievementCreditType : uint8
{
	ELootAchievementCreditType__None = 0,
	ELootAchievementCreditType__Hunting = 1,
	ELootAchievementCreditType__Mining = 2,
	ELootAchievementCreditType__BugCatching = 3,
	ELootAchievementCreditType__TreeChopping = 4,
	ELootAchievementCreditType__ELootAchievementCreditType_MAX = 5,
};

enum class ELootType : uint8
{
	ELootType__None                = 0,
	ELootType__LootActor           = 1,
	ELootType__LootPerVitalChange  = 2,
	ELootType__LootPerVitalChangeBanked = 3,
	ELootType__ELootType_MAX       = 4,
};

enum class EMeleeAttackType : uint8
{
	EMeleeAttackType__INVALID      = 0,
	EMeleeAttackType__LightAttack1 = 1,
	EMeleeAttackType__LightAttack2 = 2,
	EMeleeAttackType__LightAttack3 = 3,
	EMeleeAttackType__HeavyAttack  = 4,
	EMeleeAttackType__AttackWindup = 5,
	EMeleeAttackType__EMeleeAttackType_MAX = 6,
};

enum class EMinigameQTEStyle : uint8
{
	EMinigameQTEStyle__Hold        = 0,
	EMinigameQTEStyle__PressAndReleaseCycle = 1,
	EMinigameQTEStyle__Mash        = 2,
	EMinigameQTEStyle__Beat        = 3,
	EMinigameQTEStyle__BeatPingPong = 4,
	EMinigameQTEStyle__EMinigameQTEStyle_MAX = 5,
};

enum class ENotificationType : uint8
{
	ENotificationType__Informational = 0,
	ENotificationType__Presence    = 1,
	ENotificationType__Invite      = 2,
	ENotificationType__Party       = 3,
	ENotificationType__ENotificationType_MAX = 4,
};

enum class ELightingModificationType : uint8
{
	NoModification                 = 0,
	AdditiveBlend                  = 1,
	OverrideBlend                  = 2,
	Modification                   = 3,
	ELightingModificationType_MAX  = 4,
};

enum class EPaliaScreenStateRequest : uint8
{
	EPaliaScreenStateRequest__DesiredScreenState_None = 0,
	EPaliaScreenStateRequest__DesiredScreenState_PutUp = 1,
	EPaliaScreenStateRequest__DesiredScreenState_MAX = 2,
};

enum class EPaliaScreenTypeRequest : uint8
{
	EPaliaScreenTypeRequest__DesiredScreenType_None = 0,
	EPaliaScreenTypeRequest__DesiredScreenType_SimpleBlack = 1,
	EPaliaScreenTypeRequest__DesiredScreenType_FullLoading = 2,
	EPaliaScreenTypeRequest__DesiredScreenType_MAX = 3,
};

enum class EPaliaTargetState : uint8
{
	EPaliaTargetState__TargetState_Down = 0,
	EPaliaTargetState__TargetState_Black = 1,
	EPaliaTargetState__TargetState_LoadingScreen = 2,
	EPaliaTargetState__TargetState_MAX = 3,
};

enum class EVillagerMarkerStatus : uint8
{
	EVillagerMarkerStatus__None    = 0,
	EVillagerMarkerStatus__ImportantDialogue = 1,
	EVillagerMarkerStatus__TrackedDialogue = 2,
	EVillagerMarkerStatus__DailyChatDialogue = 6,
	EVillagerMarkerStatus__AvailableQuest = 10,
	EVillagerMarkerStatus__CompletableQuest = 11,
	EVillagerMarkerStatus__EVillagerMarkerStatus_MAX = 12,
};

enum class EVillagerVisitOccurrence : uint8
{
	EVillagerVisitOccurrence__OneTime = 0,
	EVillagerVisitOccurrence__Repeatable = 1,
	EVillagerVisitOccurrence__EVillagerVisitOccurrence_MAX = 2,
};

enum class ECooldownTimerType : uint8
{
	ECooldownTimerType__Explicit   = 0,
	ECooldownTimerType__RealWorldDay = 1,
	ECooldownTimerType__PalianDay  = 2,
	ECooldownTimerType__ECooldownTimerType_MAX = 3,
};

enum class EPersistAnchorType : uint8
{
	EPersistAnchorType__None       = 0,
	EPersistAnchorType__Spawner    = 1,
	EPersistAnchorType__PlacementRegion = 2,
	EPersistAnchorType__EPersistAnchorType_MAX = 3,
};

enum class EItemToPlaceSource : uint8
{
	EItemToPlaceSource__None       = 0,
	EItemToPlaceSource__FromInventory = 1,
	EItemToPlaceSource__FromHouseInventory = 2,
	EItemToPlaceSource__FromStorage = 3,
	EItemToPlaceSource__MoveExistingStructure = 4,
	EItemToPlaceSource__EItemToPlaceSource_MAX = 5,
};

enum class EItemPlacementState : uint8
{
	EItemPlacementState__NotPlacing = 0,
	EItemPlacementState__SingleStage = 1,
	EItemPlacementState__FenceOriginStage = 2,
	EItemPlacementState__FenceExtentStage = 3,
	EItemPlacementState__EItemPlacementState_MAX = 4,
};

enum class EPlayerCompassMultipleSameTargetResolution : uint8
{
	EPlayerCompassMultipleSameTargetResolution__None = 0,
	EPlayerCompassMultipleSameTargetResolution__ShowOneClosest = 1,
	EPlayerCompassMultipleSameTargetResolution__EPlayerCompassMultipleSameTargetResolution_MAX = 2,
};

enum class EPlayerMapLayer : uint8
{
	EPlayerMapLayer__None          = 0,
	EPlayerMapLayer__DebugSpawning = 1,
	EPlayerMapLayer__EPlayerMapLayer_MAX = 2,
};

enum class EPrivateSpaceCharacterState : uint8
{
	EPrivateSpaceCharacterState__None = 0,
	EPrivateSpaceCharacterState__RequestingLoad = 1,
	EPrivateSpaceCharacterState__InPrivateSpace = 2,
	EPrivateSpaceCharacterState__RequestingUnload = 3,
	EPrivateSpaceCharacterState__EPrivateSpaceCharacterState_MAX = 4,
};

enum class EVAL_QuestShowGoalCount : uint8
{
	EVAL_QuestShowGoalCount__Default = 0,
	EVAL_QuestShowGoalCount__ForceShowCount = 1,
	EVAL_QuestShowGoalCount__ForceHideCount = 2,
	EVAL_QuestShowGoalCount__EVAL_MAX = 3,
};

enum class EQuestRewardSourceType : uint8
{
	EQuestRewardSourceType__Unspecified = 0,
	EQuestRewardSourceType__Crafted = 1,
	EQuestRewardSourceType__Gathered = 2,
	EQuestRewardSourceType__Consumption = 3,
	EQuestRewardSourceType__Quest  = 4,
	EQuestRewardSourceType__Dialogue = 5,
	EQuestRewardSourceType__Gift   = 6,
	EQuestRewardSourceType__Mail   = 7,
	EQuestRewardSourceType__Purchase = 8,
	EQuestRewardSourceType__Cheat  = 9,
	EQuestRewardSourceType__Book   = 10,
	EQuestRewardSourceType__Bundle = 11,
	EQuestRewardSourceType__Challenge = 12,
	EQuestRewardSourceType__Garden = 13,
	EQuestRewardSourceType__Subgame = 14,
	EQuestRewardSourceType__ItemPickup = 15,
	EQuestRewardSourceType__DataCorrection = 16,
	EQuestRewardSourceType__EQuestRewardSourceType_MAX = 17,
};

enum class ERecipeInteractionMode : uint8
{
	ERecipeInteractionMode__Wait   = 0,
	ERecipeInteractionMode__Minigame = 1,
	ERecipeInteractionMode__ERecipeInteractionMode_MAX = 2,
};

enum class ERecipePropPhase : uint8
{
	ERecipePropPhase__Start        = 0,
	ERecipePropPhase__Cooking      = 1,
	ERecipePropPhase__Burned       = 2,
	ERecipePropPhase__Cooked       = 3,
	ERecipePropPhase__CookedStale  = 4,
	ERecipePropPhase__Num          = 5,
	ERecipePropPhase__INVALID      = 255,
	ERecipePropPhase__ERecipePropPhase_MAX = 256,
};

enum class ERecipeAvailability : uint8
{
	ERecipeAvailability__Not       = 0,
	ERecipeAvailability__Restricted = 1,
	ERecipeAvailability__Available = 2,
	ERecipeAvailability__Recommended = 3,
	ERecipeAvailability__ERecipeAvailability_MAX = 4,
};

enum class ERecipePhaseRequirement : uint8
{
	ERecipePhaseRequirement__ToStart = 0,
	ERecipePhaseRequirement__AddDuring = 1,
	ERecipePhaseRequirement__ToCraft = 2,
	ERecipePhaseRequirement__ERecipePhaseRequirement_MAX = 3,
};

enum class ERecipeLearnedFromType : uint8
{
	ERecipeLearnedFromType__Unspecified = 0,
	ERecipeLearnedFromType__PurchasedAtVillagerStore = 1,
	ERecipeLearnedFromType__Cheats = 2,
	ERecipeLearnedFromType__QuestReward = 3,
	ERecipeLearnedFromType__Inspiration = 4,
	ERecipeLearnedFromType__LevelUp = 5,
	ERecipeLearnedFromType__ERecipeLearnedFromType_MAX = 6,
};

enum class EShaderBasedAnimPlaybackCycle : uint8
{
	EShaderBasedAnimPlaybackCycle__Looping = 0,
	EShaderBasedAnimPlaybackCycle__Once = 1,
	EShaderBasedAnimPlaybackCycle__Clamp = 2,
	EShaderBasedAnimPlaybackCycle__PingPong = 3,
	EShaderBasedAnimPlaybackCycle__EShaderBasedAnimPlaybackCycle_MAX = 4,
};

enum class EShaderBasedAnimPlaybackLayer : uint8
{
	EShaderBasedAnimPlaybackLayer__Normal = 0,
	EShaderBasedAnimPlaybackLayer__OneOff = 10,
	EShaderBasedAnimPlaybackLayer__EShaderBasedAnimPlaybackLayer_MAX = 11,
};

enum class ESpawnerMode : uint8
{
	ESpawnerMode__Radius           = 0,
	ESpawnerMode__SpawnPoints      = 1,
	ESpawnerMode__SpawnOnFoliage   = 2,
	ESpawnerMode__AttachedToOtherActor = 3,
	ESpawnerMode__ESpawnerMode_MAX = 4,
};

enum class ESpawnerKind : uint8
{
	ESpawnerKind__Weighted         = 0,
	ESpawnerKind__FixedAmount      = 1,
	ESpawnerKind__ESpawnerKind_MAX = 2,
};

enum class ESecondaryActorToSpawnMethod : uint8
{
	ESecondaryActorToSpawnMethod__Never = 0,
	ESecondaryActorToSpawnMethod__AfterPrimaryActorDestroyed = 1,
	ESecondaryActorToSpawnMethod__SpawnsWithPrimaryActor_Deprecated = 2,
	ESecondaryActorToSpawnMethod__ESecondaryActorToSpawnMethod_MAX = 3,
};

enum class EWhereToSpawnActors : uint8
{
	EWhereToSpawnActors__AtSpawnPoints = 0,
	EWhereToSpawnActors__AtSpawnPointsButDontOccupy = 1,
	EWhereToSpawnActors__OnNavMeshWithinRadius = 2,
	EWhereToSpawnActors__EWhereToSpawnActors_MAX = 3,
};

enum class EResourceSpawnedReason : uint8
{
	EResourceSpawnedReason__Unknown = 0,
	EResourceSpawnedReason__Spawner = 1,
	EResourceSpawnedReason__AfterActorDestroyed = 2,
	EResourceSpawnedReason__AroundAoe = 3,
	EResourceSpawnedReason__EResourceSpawnedReason_MAX = 4,
};

enum class ESpawnOnFoliageStatus : uint8
{
	ESpawnOnFoliageStatus__NotLoaded = 0,
	ESpawnOnFoliageStatus__Loading = 1,
	ESpawnOnFoliageStatus__Loaded  = 2,
	ESpawnOnFoliageStatus__ESpawnOnFoliageStatus_MAX = 3,
};

enum class EStorageUsageDisplayType : uint8
{
	EStorageUsageDisplayType__NotSpecified = 0,
	EStorageUsageDisplayType__StorageUsed = 1,
	EStorageUsageDisplayType__StorageFree = 2,
	EStorageUsageDisplayType__StorageCapacity = 3,
	EStorageUsageDisplayType__StorageMaxCapacity = 4,
	EStorageUsageDisplayType__EStorageUsageDisplayType_MAX = 5,
};

enum class ESlidingPuzzleCardinalDirections : uint8
{
	ESlidingPuzzleCardinalDirections__North = 0,
	ESlidingPuzzleCardinalDirections__South = 1,
	ESlidingPuzzleCardinalDirections__East = 2,
	ESlidingPuzzleCardinalDirections__West = 3,
	ESlidingPuzzleCardinalDirections__Invalid = 4,
	ESlidingPuzzleCardinalDirections__ESlidingPuzzleCardinalDirections_MAX = 5,
};

enum class ESlidingPuzzleOpenPieceSlot : uint8
{
	ESlidingPuzzleOpenPieceSlot__BottomRight = 0,
	ESlidingPuzzleOpenPieceSlot__TopRight = 1,
	ESlidingPuzzleOpenPieceSlot__TopLeft = 2,
	ESlidingPuzzleOpenPieceSlot__BottomLeft = 3,
	ESlidingPuzzleOpenPieceSlot__ESlidingPuzzleOpenPieceSlot_MAX = 4,
};

enum class EArcadeCommandType : uint8
{
	EArcadeCommandType__None       = 0,
	EArcadeCommandType__LockMachine = 1,
	EArcadeCommandType__UnlockMachine = 2,
	EArcadeCommandType__AddLeaderboardScore = 3,
	EArcadeCommandType__GetLeaderboardScores = 4,
	EArcadeCommandType__AddReplayFrame = 5,
	EArcadeCommandType__EArcadeCommandType_MAX = 6,
};

enum class EMontageEventResult : uint8
{
	EMontageEventResult__Completed = 0,
	EMontageEventResult__OnBlendOut = 1,
	EMontageEventResult__OnInterrupted = 2,
	EMontageEventResult__OnCancelled = 3,
	EMontageEventResult__EMontageEventResult_MAX = 4,
};

enum class ETeleportActorDestination : uint8
{
	ETeleportActorDestination__UseTeleportToComponent = 0,
	ETeleportActorDestination__UseTeleportWorldPoint = 1,
	ETeleportActorDestination__UseHousingLocation = 2,
	ETeleportActorDestination__UseMatchmaking = 3,
	ETeleportActorDestination__UseTeleportToPrivateSpace = 4,
	ETeleportActorDestination__UseTeleportLeavePrivateSpace = 5,
	ETeleportActorDestination__ETeleportActorDestination_MAX = 6,
};

enum class ECrossMapTracking : uint8
{
	ECrossMapTracking__None        = 0,
	ECrossMapTracking__Villager    = 1,
	ECrossMapTracking__QuestLocation = 2,
	ECrossMapTracking__Visit       = 3,
	ECrossMapTracking__All         = 255,
	ECrossMapTracking__ECrossMapTracking_MAX = 256,
};

enum class ETimeOfDayAudioBehavior : uint8
{
	ETimeOfDayAudioBehavior__AtActorLocation = 0,
	ETimeOfDayAudioBehavior__RandomLocation = 1,
	ETimeOfDayAudioBehavior__SpecificDirection = 2,
	ETimeOfDayAudioBehavior__DoNothing = 3,
	ETimeOfDayAudioBehavior__ETimeOfDayAudioBehavior_MAX = 4,
};

enum class EPlayerTrackingOn : uint8
{
	EPlayerTrackingOn__None        = 0,
	EPlayerTrackingOn__Compass     = 1,
	EPlayerTrackingOn__WorldMap    = 2,
	EPlayerTrackingOn__All         = 255,
	EPlayerTrackingOn__EPlayerTrackingOn_MAX = 256,
};

enum class EValeriaMoveSimulationFlag : uint8
{
	NO_FLAGS                       = 0,
	VALID_Position                 = 1,
	VALID_Rotation                 = 2,
	VALID_PositionAndRotation      = 3,
	SIM_Direct                     = 4,
	SIM_FaceVelocity               = 8,
	CONTROL_ServerAuthority        = 16,
	EValeriaMoveSimulationFlag_MAX = 17,
};

enum class EEmoteTargetType : uint8
{
	EEmoteTargetType__Invalid      = 0,
	EEmoteTargetType__Player       = 1,
	EEmoteTargetType__NPC          = 2,
	EEmoteTargetType__Creatures    = 3,
	EEmoteTargetType__EEmoteTargetType_MAX = 4,
};

enum class EValeriaErrorMsgId : uint8
{
	EValeriaErrorMsgId__None       = 0,
	EValeriaErrorMsgId__GenericDisconnect = 1,
	EValeriaErrorMsgId__InactivityDisconnect = 2,
	EValeriaErrorMsgId__EValeriaErrorMsgId_MAX = 3,
};

enum class EVAL_GameSessionFlags : uint8
{
	EVAL_GameSessionFlags__None    = 0,
	EVAL_GameSessionFlags__MarkedServerOnline = 1,
	EVAL_GameSessionFlags__EmptyPlayers = 2,
	EVAL_GameSessionFlags__AgonesReserveQueued = 4,
	EVAL_GameSessionFlags__AgonesAllocated = 8,
	EVAL_GameSessionFlags__EVAL_MAX = 9,
};

enum class EValeriaGASAbilityInputID : uint8
{
	ValeriaGASAbilityInputID__INVALID = 0,
	ValeriaGASAbilityInputID__LMBPress = 50,
	ValeriaGASAbilityInputID__RMBPress = 51,
	ValeriaGASAbilityInputID__Spacebar = 100,
	ValeriaGASAbilityInputID__AdditionalAbility1 = 201,
	ValeriaGASAbilityInputID__AdditionalAbility2 = 202,
	ValeriaGASAbilityInputID__AdditionalAbility3 = 203,
	ValeriaGASAbilityInputID__AdditionalAbility4 = 204,
	ValeriaGASAbilityInputID__AdditionalAbility5 = 205,
	ValeriaGASAbilityInputID__ValeriaGASAbilityInputID_MAX = 206,
};

enum class EValeriaGASAbilityInput : uint8
{
	ValeriaGASAbilityInput__GASUseActiveAbility1 = 0,
	ValeriaGASAbilityInput__GASUseActiveAbility2 = 1,
	ValeriaGASAbilityInput__GASUseActiveAbility3 = 2,
	ValeriaGASAbilityInput__GASUseActiveAbility4 = 3,
	ValeriaGASAbilityInput__ValeriaGASAbilityInput_MAX = 4,
};

enum class EValeriaReplicationPolicy : uint8
{
	EValeriaReplicationPolicy__NotRouted = 0,
	EValeriaReplicationPolicy__AlwaysRelevant = 1,
	EValeriaReplicationPolicy__AlwaysRelevantToConnection = 2,
	EValeriaReplicationPolicy__Grid_Static = 3,
	EValeriaReplicationPolicy__Grid_Dynamic = 4,
	EValeriaReplicationPolicy__Grid_Dormant = 5,
	EValeriaReplicationPolicy__HousingPlot = 6,
	EValeriaReplicationPolicy__ImportantActors = 7,
	EValeriaReplicationPolicy__GameplayDebugger = 8,
	EValeriaReplicationPolicy__EValeriaReplicationPolicy_MAX = 9,
};

enum class ESpatialVolumeType : uint8
{
	ESpatialVolumeType__Room       = 0,
	ESpatialVolumeType__Ambience   = 1,
	ESpatialVolumeType__Reverb     = 2,
	ESpatialVolumeType__ReverbOverride = 3,
	ESpatialVolumeType__Trigger    = 4,
	ESpatialVolumeType__ESpatialVolumeType_MAX = 5,
};

enum class ESpatialVolumePriority : uint8
{
	ESpatialVolumePriority__Global = 0,
	ESpatialVolumePriority__ExteriorLow = 1,
	ESpatialVolumePriority__ExteriorHi = 2,
	ESpatialVolumePriority__InteriorLow = 3,
	ESpatialVolumePriority__InteriorMed = 4,
	ESpatialVolumePriority__InteriorHi = 5,
	ESpatialVolumePriority__SpecialLow = 6,
	ESpatialVolumePriority__SpecialMed = 7,
	ESpatialVolumePriority__SpecialHi = 8,
	ESpatialVolumePriority__Custom = 9,
	ESpatialVolumePriority__ESpatialVolumePriority_MAX = 10,
};

enum class EVillagerState : uint8
{
	EVillagerState__Activities     = 0,
	EVillagerState__Visiting       = 1,
	EVillagerState__PrivateSpace   = 2,
	EVillagerState__EVillagerState_MAX = 3,
};

enum class EVAL_ApplyCustomizationToActorState : uint8
{
	EVAL_ApplyCustomizationToActorState__Idle = 0,
	EVAL_ApplyCustomizationToActorState__PlayTransition = 1,
	EVAL_ApplyCustomizationToActorState__LoadPrimaryAssets = 2,
	EVAL_ApplyCustomizationToActorState__LoadSecondaryAssets = 3,
	EVAL_ApplyCustomizationToActorState__ApplyCustomizations = 4,
	EVAL_ApplyCustomizationToActorState__EVAL_MAX = 5,
};

enum class EVAL_ApplyCustomizationToActorOutcome : uint8
{
	EVAL_ApplyCustomizationToActorOutcome__Completed = 0,
	EVAL_ApplyCustomizationToActorOutcome__Failed = 1,
	EVAL_ApplyCustomizationToActorOutcome__Interrupted = 2,
	EVAL_ApplyCustomizationToActorOutcome__Stubbed = 3,
	EVAL_ApplyCustomizationToActorOutcome__EVAL_MAX = 4,
};

enum class EVAL_CharacterCustomizationHideSlotFlags : uint8
{
	EVAL_CharacterCustomizationHideSlotFlags__Invalid = 0,
	EVAL_CharacterCustomizationHideSlotFlags__Hair = 1,
	EVAL_CharacterCustomizationHideSlotFlags__Head = 2,
	EVAL_CharacterCustomizationHideSlotFlags__Torso = 3,
	EVAL_CharacterCustomizationHideSlotFlags__Legs = 4,
	EVAL_CharacterCustomizationHideSlotFlags__Hat = 5,
	EVAL_CharacterCustomizationHideSlotFlags__FaceMask = 6,
	EVAL_CharacterCustomizationHideSlotFlags__FacialHair = 7,
	EVAL_CharacterCustomizationHideSlotFlags__FaceTattoo = 8,
	EVAL_CharacterCustomizationHideSlotFlags__BodyTattoo = 9,
	EVAL_CharacterCustomizationHideSlotFlags__Makeup = 10,
	EVAL_CharacterCustomizationHideSlotFlags__FaceComplexion = 11,
	EVAL_CharacterCustomizationHideSlotFlags__BodyComplexion = 12,
	EVAL_CharacterCustomizationHideSlotFlags__Glider = 13,
	EVAL_CharacterCustomizationHideSlotFlags__Pet = 14,
	EVAL_CharacterCustomizationHideSlotFlags__EVAL_MAX = 15,
};

enum class EVAL_CharacterCustomization_CosmeticTagType : uint8
{
	EVAL_CharacterCustomization_CosmeticTagType__None = 0,
	EVAL_CharacterCustomization_CosmeticTagType__Set = 1,
	EVAL_CharacterCustomization_CosmeticTagType__Brand = 2,
	EVAL_CharacterCustomization_CosmeticTagType__Style = 3,
	EVAL_CharacterCustomization_CosmeticTagType__PerformanceComplexity = 4,
	EVAL_CharacterCustomization_CosmeticTagType__EVAL_CharacterCustomization_MAX = 5,
};

enum class EVAL_CharacterCustomization_MeshType : uint8
{
	EVAL_CharacterCustomization_MeshType__None = 0,
	EVAL_CharacterCustomization_MeshType__Hair = 1,
	EVAL_CharacterCustomization_MeshType__Head = 2,
	EVAL_CharacterCustomization_MeshType__Torso = 3,
	EVAL_CharacterCustomization_MeshType__Legs = 4,
	EVAL_CharacterCustomization_MeshType__Hat = 5,
	EVAL_CharacterCustomization_MeshType__FaceMask = 6,
	EVAL_CharacterCustomization_MeshType__FacialHair = 7,
	EVAL_CharacterCustomization_MeshType__EVAL_CharacterCustomization_MAX = 8,
};

enum class EVAL_CharacterCustomizationItemType : uint8
{
	EVAL_CharacterCustomizationItemType__Normal = 0,
	EVAL_CharacterCustomizationItemType__Premium = 1,
	EVAL_CharacterCustomizationItemType__EVAL_MAX = 2,
};

enum class EVAL_VariantOption_UIDisplayType : uint8
{
	EVAL_VariantOption_UIDisplayType__Icon = 0,
	EVAL_VariantOption_UIDisplayType__Color = 1,
	EVAL_VariantOption_UIDisplayType__ManualColor = 2,
	EVAL_VariantOption_UIDisplayType__EVAL_VariantOption_MAX = 3,
};

enum class EVAL_DirectMessageResult : uint8
{
	EVAL_DirectMessageResult__Sent = 0,
	EVAL_DirectMessageResult__MiscFail = 1,
	EVAL_DirectMessageResult__SendMessageToYourself = 2,
	EVAL_DirectMessageResult__CouldNotFindCharacterWithName = 3,
	EVAL_DirectMessageResult__CharacterOffline = 4,
	EVAL_DirectMessageResult__NotFriends = 5,
	EVAL_DirectMessageResult__EVAL_MAX = 6,
};

enum class EVAL_DirectMessageState : uint8
{
	EVAL_DirectMessageState__SearchCharacterByName = 0,
	EVAL_DirectMessageState__SearchPresence = 1,
	EVAL_DirectMessageState__EVAL_MAX = 2,
};

enum class EVAL_CollectionsTabState : uint8
{
	EVAL_CollectionsTabState__Emotes = 0,
	EVAL_CollectionsTabState__Pets = 1,
	EVAL_CollectionsTabState__EVAL_MAX = 2,
};

enum class EVAL_EntitlementStatus : uint8
{
	EVAL_EntitlementStatus__Success = 0,
	EVAL_EntitlementStatus__Failure = 1,
	EVAL_EntitlementStatus__EVAL_MAX = 2,
};

enum class EVAL_CharacterCustomizationMode : uint8
{
	EVAL_CharacterCustomizationMode__CharacterCreation = 0,
	EVAL_CharacterCustomizationMode__Wardrobe = 1,
	EVAL_CharacterCustomizationMode__EVAL_MAX = 2,
};

enum class EVAL_OpenStoreContext : uint8
{
	EVAL_OpenStoreContext__Wardrobe = 0,
	EVAL_OpenStoreContext__Menu    = 1,
	EVAL_OpenStoreContext__InteractableComponent = 2,
	EVAL_OpenStoreContext__EVAL_MAX = 3,
};

enum class EVAL_GameplayMenuMode : uint8
{
	EVAL_GameplayMenuMode__NotSpecified = 0,
	EVAL_GameplayMenuMode__Cheats  = 1,
	EVAL_GameplayMenuMode__Currencies = 2,
	EVAL_GameplayMenuMode__Map     = 3,
	EVAL_GameplayMenuMode__Quests  = 4,
	EVAL_GameplayMenuMode__Recipes = 5,
	EVAL_GameplayMenuMode__Relationships = 6,
	EVAL_GameplayMenuMode__Skills  = 7,
	EVAL_GameplayMenuMode__Guidebook = 8,
	EVAL_GameplayMenuMode__Inventory = 9,
	EVAL_GameplayMenuMode__Guild   = 10,
	EVAL_GameplayMenuMode__Store   = 11,
	EVAL_GameplayMenuMode__PlayerGuild = 12,
	EVAL_GameplayMenuMode__Accomplishments = 13,
	EVAL_GameplayMenuMode__Emotes  = 14,
	EVAL_GameplayMenuMode__Events  = 15,
	EVAL_GameplayMenuMode__NewsInbox = 16,
	EVAL_GameplayMenuMode__EVAL_MAX = 17,
};

enum class EVAL_DirectXVersion : uint8
{
	EVAL_DirectXVersion__DirectXVersion12 = 0,
	EVAL_DirectXVersion__DirectXVersion11 = 1,
	EVAL_DirectXVersion__Unknown   = 2,
	EVAL_DirectXVersion__EVAL_MAX  = 3,
};

enum class EVAL_TextComparisonLevel : uint8
{
	EVAL_TextComparisonLevel__Default = 0,
	EVAL_TextComparisonLevel__Primary = 1,
	EVAL_TextComparisonLevel__Secondary = 2,
	EVAL_TextComparisonLevel__Tertiary = 3,
	EVAL_TextComparisonLevel__Quaternary = 4,
	EVAL_TextComparisonLevel__Quinary = 5,
	EVAL_TextComparisonLevel__EVAL_MAX = 6,
};

enum class EVALItemType : uint8
{
	EVALItemType__CustomizationNormal = 0,
	EVALItemType__CustomizationPremium = 1,
	EVALItemType__CurrencyPremium  = 2,
	EVALItemType__Inventory        = 3,
	EVALItemType__EVALItemType_MAX = 4,
};

enum class EVAL_NewsInboxMessageType : uint8
{
	EVAL_NewsInboxMessageType__Invalid = 0,
	EVAL_NewsInboxMessageType__Generic = 1,
	EVAL_NewsInboxMessageType__Player_Support_Progression = 2,
	EVAL_NewsInboxMessageType__Promotion_Referral_Referrer = 3,
	EVAL_NewsInboxMessageType__Promotion_Referral_Referred = 4,
	EVAL_NewsInboxMessageType__Promotion_EarlyBird = 5,
	EVAL_NewsInboxMessageType__Apology_Downtime = 6,
	EVAL_NewsInboxMessageType__Feature_Pets = 7,
	EVAL_NewsInboxMessageType__EVAL_MAX = 8,
};

enum class EVAL_PlayerGuildQuestAction : uint8
{
	EVAL_PlayerGuildQuestAction__Collect = 0,
	EVAL_PlayerGuildQuestAction__EVAL_MAX = 1,
};

enum class EVAL_PlayerGuildQuest_SortType : uint8
{
	EVAL_PlayerGuildQuest_SortType__DateTime = 0,
	EVAL_PlayerGuildQuest_SortType__EVAL_PlayerGuildQuest_MAX = 1,
};

enum class EVAL_PremiumPaymentStatus : uint8
{
	EVAL_PremiumPaymentStatus__Created = 0,
	EVAL_PremiumPaymentStatus__Failed = 1,
	EVAL_PremiumPaymentStatus__Paid = 2,
	EVAL_PremiumPaymentStatus__Fulfilled = 3,
	EVAL_PremiumPaymentStatus__EVAL_MAX = 4,
};

enum class EVAL_ShrineReadiness : uint8
{
	EVAL_ShrineReadiness__CannotCommune = 0,
	EVAL_ShrineReadiness__FirstCommunionReady = 1,
	EVAL_ShrineReadiness__RepeatCommunionReady = 2,
	EVAL_ShrineReadiness__RepeatCommunionInsufficient = 3,
	EVAL_ShrineReadiness__RepeatCommunionMaxed = 4,
	EVAL_ShrineReadiness__EVAL_MAX = 5,
};

enum class ETransitiveDecorStimulusType : uint8
{
	ETransitiveDecorStimulusType__TimeSeconds = 0,
	ETransitiveDecorStimulusType__Water = 1,
	ETransitiveDecorStimulusType__Fertilizer = 2,
	ETransitiveDecorStimulusType__MAX = 3,
};

enum class EVAL_TravelLoadingScreenStateRequesterState : uint8
{
	EVAL_TravelLoadingScreenStateRequesterState__Idle = 0,
	EVAL_TravelLoadingScreenStateRequesterState__AwaitingPreloadMapStart = 1,
	EVAL_TravelLoadingScreenStateRequesterState__LoadingMap = 2,
	EVAL_TravelLoadingScreenStateRequesterState__WaitingForPawn = 3,
	EVAL_TravelLoadingScreenStateRequesterState__WaitingForCharacterTeleport = 4,
	EVAL_TravelLoadingScreenStateRequesterState__WaitingForAsyncLoading = 5,
	EVAL_TravelLoadingScreenStateRequesterState__EVAL_MAX = 6,
};

enum class EVillagerDialogueIcon : uint8
{
	EVillagerDialogueIcon__None    = 0,
	EVillagerDialogueIcon__Chat    = 1,
	EVillagerDialogueIcon__QuestBegin = 2,
	EVillagerDialogueIcon__QuestHint = 3,
	EVillagerDialogueIcon__QuestTurnIn = 4,
	EVillagerDialogueIcon__GiftHint = 5,
	EVillagerDialogueIcon__Flirt   = 6,
	EVillagerDialogueIcon__FirePersonalityIcon = 7,
	EVillagerDialogueIcon__WaterPersonalityIcon = 8,
	EVillagerDialogueIcon__EarthPersonalityIcon = 9,
	EVillagerDialogueIcon__AirPersonalityIcon = 10,
	EVillagerDialogueIcon__BasicResponse = 11,
	EVillagerDialogueIcon__QuestComplete = 12,
	EVillagerDialogueIcon__ImportantDialogue = 13,
	EVillagerDialogueIcon__EVillagerDialogueIcon_MAX = 14,
};

enum class EGiftPredictedResponse : uint8
{
	EGiftPredictedResponse__Unknown = 0,
	EGiftPredictedResponse__CantGift = 1,
	EGiftPredictedResponse__Love   = 2,
	EGiftPredictedResponse__Like   = 3,
	EGiftPredictedResponse__NoItem = 4,
	EGiftPredictedResponse__EGiftPredictedResponse_MAX = 5,
};

enum class EVillagerQuestCompleteResult : uint8
{
	EVillagerQuestCompleteResult__Failure = 0,
	EVillagerQuestCompleteResult__MovedToNextStep = 1,
	EVillagerQuestCompleteResult__Success = 2,
	EVillagerQuestCompleteResult__EVillagerQuestCompleteResult_MAX = 3,
};

enum class EStoreTab : uint8
{
	EStoreTab__Undefined           = 0,
	EStoreTab__Recipes             = 1,
	EStoreTab__Items               = 2,
	EStoreTab__EStoreTab_MAX       = 3,
};

enum class EVitalRelevance : uint8
{
	EVitalRelevance__All           = 0,
	EVitalRelevance__PlayerOnly    = 1,
	EVitalRelevance__SpecifiedOnly = 2,
	EVitalRelevance__EVitalRelevance_MAX = 3,
};

enum class EVAL_WaterFillType : uint8
{
	EVAL_WaterFillType__Empty      = 0,
	EVAL_WaterFillType__Partial    = 1,
	EVAL_WaterFillType__Full       = 2,
	EVAL_WaterFillType__EVAL_MAX   = 3,
};


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xD8 (0xD8 - 0x0)
// ScriptStruct Palia.VAL_RenderStudioLevelData
struct FVAL_RenderStudioLevelData
{
public:
	TSoftObjectPtr<class UWorld>                 MainLevel;                                         // 0x0(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelStreamingDynamic*                StreamingMainLevel;                                // 0x30(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UWorld>> SubLevels;                                         // 0x38(0x50)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, class ULevelStreamingDynamic*> StreamingSubLevels;                                // 0x88(0x50)(Transient, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Palia.Notification
struct FNotification
{
public:
	class UTexture2D*                            Icon;                                              // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Text;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                         SoundToPlay;                                       // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENotificationSpecialType          NotificationSpecialType;                           // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldNotificationPersist;                        // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A57[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.VAL_AsyncMessageKickPlayer
struct FVAL_AsyncMessageKickPlayer
{
public:
	uint8                                        Pad_3A58[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.PersistActorsToDestroyQueue_List
struct FPersistActorsToDestroyQueue_List
{
public:
	TArray<class UPersistComponent*>             Pending;                                           // 0x0(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Palia.PersistActorsToDestroyQueue
struct FPersistActorsToDestroyQueue
{
public:
	TMap<class FString, struct FPersistActorsToDestroyQueue_List> Queues;                                            // 0x0(0x50)(ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.TravelDestination
struct FTravelDestination
{
public:
	enum class ETravelDestinationType            Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A59[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ID;                                                // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.ItemTrackingEntryPersist
struct FItemTrackingEntryPersist
{
public:
	int32                                        ItemPersistId;                                     // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumberOfTimesPurchased;                            // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.ItemTrackingPersistBlock
struct FItemTrackingPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FItemTrackingEntryPersist>     Entries;                                           // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct Palia.VillagerQuestPersist
struct FVillagerQuestPersist
{
public:
	int32                                        VillagerQuestConfigId;                             // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A5B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        StartedAtMs;                                       // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        CompletedAtMs;                                     // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                ActionsCompleted;                                  // 0x18(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        CurrentStep;                                       // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsCompleteable;                                    // 0x2C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A5C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                GoalProgress;                                      // 0x30(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bHasPartiallyCompleted;                            // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A5D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x60 - 0x40)
// ScriptStruct Palia.QuestProgressPersistBlock
struct FQuestProgressPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVillagerQuestPersist>         CurrentQuests;                                     // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                CompletedQuestIds;                                 // 0x50(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.HouseOwnershipTitlePersist
struct FHouseOwnershipTitlePersist
{
public:
	struct FGuid                                 HouseId;                                           // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 OwnerId;                                           // 0x10(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHousingPermissionLevel           OwnershipLevel;                                    // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A5E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Slot;                                              // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x110 (0x150 - 0x40)
// ScriptStruct Palia.ValeriaCharacterBasePersistBlock
struct FValeriaCharacterBasePersistBlock : public FS6PersistBlock
{
public:
	class FString                                ContainerHash;                                     // 0x40(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemType;                                          // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A5F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint64                                       LastSavedAtMs;                                     // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CharacterName;                                     // 0x60(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        TimeLastLoggedOffMs;                               // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        UnstuckLastUsageTime;                              // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UnstuckCooldownSeconds;                            // 0x80(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHouseOwnershipTitlePersist           PrimaryHome;                                       // 0x84(0x28)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                        LastKnownPrimaryHousingPlotValue;                  // 0xAC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MapName;                                           // 0xB0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LastValidLocation;                                 // 0xC0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              LastValidRotation;                                 // 0xD8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        ReturnHomeLastUsageTime;                           // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnHomeCooldownSeconds;                         // 0xF8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowEatingWhenFull;                              // 0xFC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A61[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, int32>                           CorrectionsApplied;                                // 0x100(0x50)(NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.VitalPersist
struct FVitalPersist
{
public:
	enum class EVitalPersistType                 Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A62[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        StartAmount;                                       // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxAmount;                                         // 0x8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Partial;                                           // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AdditionalMaxAmount;                               // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.VitalsPersistBlock
struct FVitalsPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVitalPersist>                 Vitals;                                            // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        Health;                                            // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxHealth;                                         // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.VAL_GameplayConditionContextPersistEntry
struct FVAL_GameplayConditionContextPersistEntry
{
public:
	bool                                         bConditionMet;                                     // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A63[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ConditionValue;                                    // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConditionGoal;                                     // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A64[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                ChildIndexStack;                                   // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VAL_GameplayConditionContextPersist
struct FVAL_GameplayConditionContextPersist
{
public:
	TArray<struct FVAL_GameplayConditionContextPersistEntry> PersistEntries;                                    // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Palia.VAL_QuestGoalState
struct FVAL_QuestGoalState
{
public:
	int32                                        CurrentProgress;                                   // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        GoalAmount;                                        // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGoalMet;                                          // 0x8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsQuantityCondition;                              // 0x9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bActive;                                           // 0xA(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A66[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_QuestDef>          ParentQuestDef;                                    // 0x10(0x30)(Transient, RepSkip, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ParentStepIndex;                                   // 0x40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ParentGoalIndex;                                   // 0x44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               Owner;                                             // 0x48(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVAL_GameplayConditionContext*         Context;                                           // 0x50(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVAL_GameplayConditionContextPersist  PersistedConditionContext;                         // 0x58(0x10)(RepSkip, Protected, NativeAccessSpecifierProtected)
	bool                                         bIsBranchingGoal;                                  // 0x68(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3A67[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x78 (0x78 - 0x0)
// ScriptStruct Palia.VAL_QuestBranchingGoalState
struct FVAL_QuestBranchingGoalState
{
public:
	struct FVAL_QuestGoalState                   GoalState;                                         // 0x0(0x70)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	enum class EVAL_QuestBranchingGoalChoiceStatus ChoiceStatus;                                      // 0x70(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A68[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x78 (0x78 - 0x0)
// ScriptStruct Palia.VAL_QuestStepState
struct FVAL_QuestStepState
{
public:
	int64                                        StartedAtMs;                                       // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        CompletedAtMs;                                     // 0x8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestGoalState>           GoalStates;                                        // 0x10(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestBranchingGoalState>  BranchingGoalStates;                               // 0x20(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bCanBeCompleted;                                   // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A69[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_QuestDef>          ParentQuestDef;                                    // 0x38(0x30)(Transient, RepSkip, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                               Owner;                                             // 0x68(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        ParentStepIndex;                                   // 0x70(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3A6A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.VAL_QuestReset_SavedVisit
struct FVAL_QuestReset_SavedVisit
{
public:
	struct FGuid                                 VisitId;                                           // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 PrivateSpaceId;                                    // 0x10(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.PersistentTagFilter
struct FPersistentTagFilter
{
public:
	struct FGameplayTag                          TagToCheck;                                        // 0x0(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinimumAcceptedValue;                              // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaximumAcceptedValue;                              // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.HousingSlotGrant
struct FHousingSlotGrant
{
public:
	enum class EHousingSlotType                  Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A6C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.QuestCurrencyRewardPersist
struct FQuestCurrencyRewardPersist
{
public:
	struct FGuid                                 ConfigId;                                          // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.ItemMetaData
struct FItemMetaData
{
public:
	uint8                                        Level;                                             // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        QualityStars;                                      // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A6D[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        WaterAmount;                                       // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SellValueOfInputs;                                 // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        TintPersistID;                                     // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A6E[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Palia.ItemMetaData_UseLimit
struct FItemMetaData_UseLimit
{
public:
	int32                                        UseAmountLeft;                                     // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Palia.ValeriaItemPersist
struct FValeriaItemPersist
{
public:
	int32                                        Amount;                                            // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemPersistId;                                     // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemMetaData                         MetaData;                                          // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FItemMetaData_UseLimit                MetaDataUse;                                       // 0x18(0x4)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.ValeriaVital
struct FValeriaVital
{
public:
	enum class EVitalType                        VitalType;                                         // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A6F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        VitalAmount;                                       // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.ItemUseChangeConfig
struct FItemUseChangeConfig
{
public:
	int32                                        UseChange;                                         // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CurrentlyEquipped;                                 // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A70[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.VillagerGiftPreferenceInfo
struct FVillagerGiftPreferenceInfo
{
public:
	struct FDataTableRowHandle                   Villager;                                          // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   GiftPreference;                                    // 0x10(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.PersistentTagWriteback
struct FPersistentTagWriteback
{
public:
	struct FGameplayTag                          TagToModify;                                       // 0x0(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmountToApply;                                     // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENumericalOperation               OperationToApply;                                  // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A72[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x110 (0x110 - 0x0)
// ScriptStruct Palia.QuestReward
struct FQuestReward
{
public:
	TArray<struct FPersistentTagFilter>          PlayerTagRequirements;                             // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FValeriaItemPersist>           Items;                                             // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         DisallowItemsGrantingAccomplishmentProgress;       // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A73[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FValeriaVital>                 Vitals;                                            // 0x28(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FQuestCurrencyRewardPersist>   Currencies;                                        // 0x38(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        RelationshipVillagerId;                            // 0x48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RelationshipVillagerCoreId;                        // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FriendshipChange;                                  // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RomanceChange;                                     // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERomanceStateChange               RomanceStateChange;                                // 0x58(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AwardRecipesAsInspiration;                         // 0x59(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A74[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                RecipeConfigIds;                                   // 0x60(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        BuffConfigId;                                      // 0x70(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESkillType                        SkillType;                                         // 0x74(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A75[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SkillAmount;                                       // 0x78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemUseChangeConfig                  ItemUseChange;                                     // 0x7C(0x8)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                        MailMessageId;                                     // 0x84(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MailMessageToDeleteIfUnreadId;                     // 0x88(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A76[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVillagerGiftPreferenceInfo           GiftPreferenceRevealed;                            // 0x90(0x20)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FPersistentTagWriteback>       PlayerTagWriteback;                                // 0xB0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         GrantBagUpgrade;                                   // 0xC0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RecalcVitals;                                      // 0xC1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A77[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   QuestToTrigger_Deprecated;                         // 0xC8(0x10)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   QuestToDelete_Deprecated;                          // 0xD8(0x10)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	float                                        LanternFuelTime;                                   // 0xE8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A78[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FHousingSlotGrant>             GrantedHousingSlots;                               // 0xF0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        QuestIdToStart;                                    // 0x100(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A79[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        GeneratedTimestamp;                                // 0x108(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x24 (0x24 - 0x0)
// ScriptStruct Palia.VAL_ConditionDeductionRecord
struct FVAL_ConditionDeductionRecord
{
public:
	struct FValeriaItemPersist                   ItemsDeducted;                                     // 0x0(0x1C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FValeriaVital                         VitalsDeducted;                                    // 0x1C(0x8)(NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// ScriptStruct Palia.VAL_QuestPlayerStateChangeRecord
struct FVAL_QuestPlayerStateChangeRecord
{
public:
	enum class EVAL_QuestPlayerStateChangeType   StateChangeType;                                   // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A7A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        TimestampMs;                                       // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StepIdx;                                           // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FQuestReward>                  RewardsGranted;                                    // 0x18(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVAL_ConditionDeductionRecord> Deductions;                                        // 0x28(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        PreResetVersion;                                   // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PreResetStepIdx;                                   // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVAL_QuestNeedsResetReason        ResetReason;                                       // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A7B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FQuestReward>                  DeductionsRefunded;                                // 0x48(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FQuestReward>                  RewardsReturned;                                   // 0x58(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                DialoguesReset;                                    // 0x68(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestReset_SavedVisit>    SavedVisitsReset;                                  // 0x78(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                         CompletedVisitsReset;                              // 0x88(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        DialogueViewed;                                    // 0x98(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 VisitGuid;                                         // 0x9C(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 VisitPrivateSpaceGuid;                             // 0xAC(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A7D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA0 (0xA0 - 0x0)
// ScriptStruct Palia.VAL_QuestState
struct FVAL_QuestState
{
public:
	int32                                        PersistId;                                         // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_QuestDef>          QuestDef;                                          // 0x8(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, RepSkip, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        StartedAtMs;                                       // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        CompletedAtMs;                                     // 0x40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        ExpiredAtMs;                                       // 0x48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentStepIdx;                                    // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Pinned;                                            // 0x54(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A80[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AValeriaCharacter*                     VC;                                                // 0x58(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestStepState>           StepStates;                                        // 0x60(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestPlayerStateChangeRecord> PlayerStateChanges;                                // 0x70(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	class UVAL_QuestDef*                         CachedQuestDef;                                    // 0x80(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVAL_GameplayConditionContext*         ExpirationConditionContext;                        // 0x88(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVAL_GameplayConditionContextPersist  PersistedExpirationConditionContext;               // 0x90(0x10)(RepSkip, NativeAccessSpecifierPrivate)
};

// 0x60 (0xA0 - 0x40)
// ScriptStruct Palia.VAL_QuestProgressPersistBlock
struct FVAL_QuestProgressPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVAL_QuestState>               ActiveQuests;                                      // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                PendingStartQuestIds;                              // 0x50(0x10)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestState>               InactiveQuests;                                    // 0x60(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestState>               QuarantinedQuests;                                 // 0x70(0x10)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestState>               DeletedQuests;                                     // 0x80(0x10)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	TArray<int32>                                PendingDeleteQuestIds;                             // 0x90(0x10)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.SavedVillagerVisit
struct FSavedVillagerVisit
{
public:
	struct FGuid                                 Guid;                                              // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VisitStartRequirementsCompletedTimeSeconds;        // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Priority;                                          // 0x14(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDelayedVisit;                                     // 0x18(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A82[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DelayedVisitGameHours;                             // 0x1C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.SavedVillagerVisitArray
struct FSavedVillagerVisitArray
{
public:
	TArray<struct FSavedVillagerVisit>           Visits;                                            // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x70 (0xB0 - 0x40)
// ScriptStruct Palia.VillagerVisitsPersistBlock
struct FVillagerVisitsPersistBlock : public FS6PersistBlock
{
public:
	struct FSavedVillagerVisitArray              SavedHousingVillagerVisits;                        // 0x40(0x10)(NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FSavedVillagerVisitArray> SavedPrivateSpaceVillagerVisits;                   // 0x50(0x50)(NativeAccessSpecifierPublic)
	TArray<struct FGuid>                         CompletedVisits;                                   // 0xA0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.VALDATA_PremiumStoreEntitlements
struct FVALDATA_PremiumStoreEntitlements : public FS6PersistBlock
{
public:
	TArray<struct FGuid>                         EntitlementsNotSeen;                               // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.VALDATA_EmotePersistBlock
struct FVALDATA_EmotePersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FGuid>                         EmoteWheelAssignments;                             // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct Palia.SkillPersist
struct FSkillPersist
{
public:
	enum class ESkillType                        SkillType;                                         // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A83[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Level;                                             // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        XpGainedThisLevel;                                 // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.SkillsPersistBlock
struct FSkillsPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FSkillPersist>                 Skills;                                            // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	enum class ESkillType                        MostRecentlyProgressedSkill;                       // 0x50(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A84[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.FishingPersistBlock
struct FFishingPersistBlock : public FS6PersistBlock
{
public:
	TArray<int32>                                CaughtFishesIds;                                   // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        EquippedBaitId;                                    // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A85[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.ChallengeStatePersist
struct FChallengeStatePersist
{
public:
	struct FGuid                                 Guid;                                              // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                GoalsProgress;                                     // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bCompleted;                                        // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A86[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.ChallengeProgressPersistBlock
struct FChallengeProgressPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FChallengeStatePersist>        Entries;                                           // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int64                                        ExpirationTimestamp;                               // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.VillagerRelationship
struct FVillagerRelationship
{
public:
	int32                                        VillagerCoreId;                                    // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FriendshipValue;                                   // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RomanceValue;                                      // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERomanceState                     RomanceState;                                      // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         HasMetBefore;                                      // 0xD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A89[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        HighestFriendshipLevelReached;                     // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HighestRomanceLevelReached;                        // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.VillagerRelationshipsPersistBlock
struct FVillagerRelationshipsPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVillagerRelationship>         Entries;                                           // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct Palia.TagEntry
struct FTagEntry
{
public:
	struct FGameplayTag                          Tag;                                               // 0x0(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x60 - 0x40)
// ScriptStruct Palia.TagMapPersistBlock
struct FTagMapPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FTagEntry>                     Entries;                                           // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTagEntry>                     CachedPlaceableEntries;                            // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.VillagerMailMessage
struct FVillagerMailMessage
{
public:
	int32                                        PersistId;                                         // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A8D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        TimestampSentAt;                                   // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                RewardIndicesCollected;                            // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VillagerMailInbox
struct FVillagerMailInbox
{
public:
	TArray<struct FVillagerMailMessage>          Messages;                                          // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x60 - 0x40)
// ScriptStruct Palia.MailInboxPersistBlock
struct FMailInboxPersistBlock : public FS6PersistBlock
{
public:
	struct FVillagerMailInbox                    CurrentInbox;                                      // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVillagerMailInbox                    ArchivedInbox;                                     // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.CraftingHistoryEntry
struct FCraftingHistoryEntry
{
public:
	int32                                        RecipeConfigId;                                    // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumberOfTimesCrafted;                              // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.CraftingHistoryPersistBlock
struct FCraftingHistoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FCraftingHistoryEntry>         RecipesCrafted;                                    // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        MostRecentlyCraftedRecipeId;                       // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A90[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x60 - 0x40)
// ScriptStruct Palia.RecipeInventoryPersistBlock
struct FRecipeInventoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<int32>                                RecipesAvailable;                                  // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                UnusedInspirationRecipeIDs;                        // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.VillagerGiftHistoryPersist
struct FVillagerGiftHistoryPersist
{
public:
	int32                                        VillagerCoreId;                                    // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemPersistId;                                     // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        LastGiftedMs;                                      // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AssociatedPreferenceVersion;                       // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A91[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.GiftHistoryPersistBlock
struct FGiftHistoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVillagerGiftHistoryPersist>   History;                                           // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.DialogueHistoryEntry
struct FDialogueHistoryEntry
{
public:
	int64                                        TimestampMs;                                       // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DialogueConfigId;                                  // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DialogueRepetitionNumber;                          // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.DialogueHistoryPersistBlock
struct FDialogueHistoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FDialogueHistoryEntry>         Entries;                                           // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.VillagerGiftPreferences
struct FVillagerGiftPreferences
{
public:
	enum class EVillagerGiftRewardLevel          RewardLevel;                                       // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A92[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                KnownGiftPreferences;                              // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.TrackedGiftPreferences
struct FTrackedGiftPreferences
{
public:
	int32                                        VillagerCoreId;                                    // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A93[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVillagerGiftPreferences>      PreferencesForLevel;                               // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.GiftPreferencesPersistBlock
struct FGiftPreferencesPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FTrackedGiftPreferences>       Preferences;                                       // 0x40(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0x50(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A94[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x60 - 0x40)
// ScriptStruct Palia.StoragePersistBlock
struct FStoragePersistBlock : public FS6PersistBlock
{
public:
	enum class EStoragePoolType                  StoragePoolType;                                   // 0x40(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A95[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FValeriaItemPersist>           Items;                                             // 0x48(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ItemCapacity;                                      // 0x58(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemMax;                                           // 0x5C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.GearSlotMetadata
struct FGearSlotMetadata
{
public:
	int32                                        SlotTypePersistId;                                 // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SlotIndex;                                         // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        UnequipExpirationTimestamp;                        // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x70 - 0x40)
// ScriptStruct Palia.GearPersistBlock
struct FGearPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FValeriaItemPersist>           Items;                                             // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGearSlotMetadata>             EquippedGearSlots;                                 // 0x50(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGearSlotMetadata>             UnequippedGearSlots;                               // 0x60(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.DebugInfoPersistBlock
struct FDebugInfoPersistBlock : public FS6PersistBlock
{
public:
	bool                                         bCheatsEnabled;                                    // 0x40(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreGiftTimeRestriction;                        // 0x41(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreFriendLvlReqsForDynamicGiftPrefs;           // 0x42(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreDailyDialogueLimit;                         // 0x43(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowHiddenGearTypes;                              // 0x44(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowVillagerDebugInfo;                            // 0x45(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A97[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGuid>                         GivenCheatSets;                                    // 0x48(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.ReadBookData
struct FReadBookData
{
public:
	int32                                        bookConfigId;                                      // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HighestPageRead;                                   // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.BookReadingPersistBlock
struct FBookReadingPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FReadBookData>                 ReadBooks;                                         // 0x40(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Palia.BuffPersist
struct FBuffPersist
{
public:
	struct FGuid                                 AppliedByPlayer;                                   // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BuffConfigId;                                      // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A9A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        TimeStart;                                         // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        TimeEnd;                                           // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Instance;                                          // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Stacks;                                            // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.BuffPersistBlock
struct FBuffPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FBuffPersist>                  Buffs;                                             // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        NextInstanceId;                                    // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A9B[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.BagSlotLocation
struct FBagSlotLocation
{
public:
	int32                                        BagIndex;                                          // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SlotIndex;                                         // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.ProjectileFiringPersistBlock
struct FProjectileFiringPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FBagSlotLocation>              EquippedAmmoSlots;                                 // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.HouseInventoryItemPersist
struct FHouseInventoryItemPersist
{
public:
	int32                                        ItemPersistId;                                     // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Level;                                             // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.HouseInventoryPersistBlock
struct FHouseInventoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FHouseInventoryItemPersist>    Houses;                                            // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.WarpStonePersist
struct FWarpStonePersist
{
public:
	struct FGuid                                 WarpStoneId;                                       // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                FlowSpriteIds;                                     // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.WarpStonePersistBlock
struct FWarpStonePersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FWarpStonePersist>             WarpStones;                                        // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        NextUseTime;                                       // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A9E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.WorldPersistGatherableData
struct FWorldPersistGatherableData
{
public:
	int32                                        NumTimesGathered;                                  // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A9F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        GatheredTime;                                      // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x90 - 0x40)
// ScriptStruct Palia.PlayerWorldStatePersistBlock
struct FPlayerWorldStatePersistBlock : public FS6PersistBlock
{
public:
	TMap<struct FGameplayTag, struct FWorldPersistGatherableData> WorldPersistGatherableDatas;                       // 0x40(0x50)(NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.InventoryBagPersist
struct FInventoryBagPersist
{
public:
	int32                                        ItemPersistId;                                     // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AA2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FValeriaItemPersist>           Slots;                                             // 0x8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.InventoryPersistBlock
struct FInventoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FInventoryBagPersist>          Bags;                                              // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ItemsCollected;                                    // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AA3[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.CurrencyBagPersist
struct FCurrencyBagPersist
{
public:
	int32                                        Amount;                                            // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 PersistGuid;                                       // 0x4(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x68 - 0x58)
// ScriptStruct Palia.PlayerInventoryPersistBlock
struct FPlayerInventoryPersistBlock : public FInventoryPersistBlock
{
public:
	TArray<struct FCurrencyBagPersist>           Currencies;                                        // 0x58(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct Palia.SubBundleReqsData
struct FSubBundleReqsData
{
public:
	int32                                        RequirementConfigId;                               // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentValue;                                      // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCompleted;                                        // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AA5[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.SubBundleData
struct FSubBundleData
{
public:
	int32                                        SubBundleConfigId;                                 // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AA6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSubBundleReqsData>            SubBundleReqs;                                     // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bMiniRewardsGranted;                               // 0x18(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AA7[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.BundleData
struct FBundleData
{
public:
	int32                                        BundleConfigId;                                    // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AA8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSubBundleData>                SubBundles;                                        // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bBundleRewardsGranted;                             // 0x18(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AA9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.BundlePersistBlock
struct FBundlePersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FBundleData>                   Bundles;                                           // 0x40(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.VALDATA_PlayerGuildQuestPersist
struct FVALDATA_PlayerGuildQuestPersist
{
public:
	bool                                         bIsPinned;                                         // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AAA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 PersistGuid;                                       // 0x4(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.VALDATA_PlayerGuildQuestPersistBlock
struct FVALDATA_PlayerGuildQuestPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVALDATA_PlayerGuildQuestPersist> GuildQuests;                                       // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x40 - 0x40)
// ScriptStruct Palia.GardeningWeedingPersistBlock
struct FGardeningWeedingPersistBlock : public FS6PersistBlock
{
public:
};

// 0x0 (0x40 - 0x40)
// ScriptStruct Palia.SleepingPersistBlock
struct FSleepingPersistBlock : public FS6PersistBlock
{
public:
};

// 0xCA0 (0xCB8 - 0x18)
// ScriptStruct Palia.CharacterPersistContainer
struct FCharacterPersistContainer : public FS6PersistContainer
{
public:
	struct FValeriaCharacterBasePersistBlock     BaseCharacter;                                     // 0x18(0x150)(NativeAccessSpecifierPublic)
	struct FVitalsPersistBlock                   Vitals;                                            // 0x168(0x58)(NativeAccessSpecifierPublic)
	struct FVALDATA_PremiumStoreEntitlements     PremiumStoreEntitlements;                          // 0x1C0(0x50)(NativeAccessSpecifierPublic)
	struct FVALDATA_EmotePersistBlock            EmoteWheelAssignments;                             // 0x210(0x50)(NativeAccessSpecifierPublic)
	struct FSkillsPersistBlock                   Skills;                                            // 0x260(0x58)(NativeAccessSpecifierPublic)
	struct FQuestProgressPersistBlock            QuestProgress;                                     // 0x2B8(0x60)(NativeAccessSpecifierPublic)
	struct FVAL_QuestProgressPersistBlock        Quests;                                            // 0x318(0xA0)(NativeAccessSpecifierPublic)
	struct FChallengeProgressPersistBlock        ChallengeProgress;                                 // 0x3B8(0x58)(NativeAccessSpecifierPublic)
	struct FVillagerRelationshipsPersistBlock    VillagerRelationships;                             // 0x410(0x50)(NativeAccessSpecifierPublic)
	struct FTagMapPersistBlock                   TagMap;                                            // 0x460(0x60)(NativeAccessSpecifierPublic)
	struct FMailInboxPersistBlock                MailInbox;                                         // 0x4C0(0x60)(NativeAccessSpecifierPublic)
	struct FCraftingHistoryPersistBlock          CraftingHistory;                                   // 0x520(0x58)(NativeAccessSpecifierPublic)
	struct FRecipeInventoryPersistBlock          RecipeInventory;                                   // 0x578(0x60)(NativeAccessSpecifierPublic)
	struct FGiftHistoryPersistBlock              GiftHistory;                                       // 0x5D8(0x50)(NativeAccessSpecifierPublic)
	struct FDialogueHistoryPersistBlock          DialogueHistory;                                   // 0x628(0x50)(NativeAccessSpecifierPublic)
	struct FGiftPreferencesPersistBlock          GiftPreferences;                                   // 0x678(0x58)(NativeAccessSpecifierPublic)
	TArray<struct FStoragePersistBlock>          Storage;                                           // 0x6D0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGearPersistBlock                     Gear;                                              // 0x6E0(0x70)(NativeAccessSpecifierPublic)
	struct FDebugInfoPersistBlock                DebugInfo;                                         // 0x750(0x58)(NativeAccessSpecifierPublic)
	struct FBookReadingPersistBlock              BookReading;                                       // 0x7A8(0x50)(NativeAccessSpecifierPublic)
	struct FBuffPersistBlock                     Buffs;                                             // 0x7F8(0x58)(NativeAccessSpecifierPublic)
	struct FVillagerVisitsPersistBlock           VillagerVisits;                                    // 0x850(0xB0)(NativeAccessSpecifierPublic)
	struct FProjectileFiringPersistBlock         ProjectileFiring;                                  // 0x900(0x50)(NativeAccessSpecifierPublic)
	struct FFishingPersistBlock                  Fishing;                                           // 0x950(0x58)(NativeAccessSpecifierPublic)
	struct FItemTrackingPersistBlock             ItemTracking;                                      // 0x9A8(0x50)(NativeAccessSpecifierPublic)
	struct FHouseInventoryPersistBlock           HouseInventory;                                    // 0x9F8(0x50)(NativeAccessSpecifierPublic)
	struct FWarpStonePersistBlock                WarpStone;                                         // 0xA48(0x58)(NativeAccessSpecifierPublic)
	struct FPlayerWorldStatePersistBlock         PlayerWorldState;                                  // 0xAA0(0x90)(NativeAccessSpecifierPublic)
	struct FPlayerInventoryPersistBlock          PlayerInventory;                                   // 0xB30(0x68)(NativeAccessSpecifierPublic)
	struct FBundlePersistBlock                   Bundles;                                           // 0xB98(0x50)(NativeAccessSpecifierPublic)
	struct FVALDATA_PlayerGuildQuestPersistBlock PlayerGuildQuests;                                 // 0xBE8(0x50)(NativeAccessSpecifierPublic)
	struct FGardeningWeedingPersistBlock         DELETED_GardeningWeeding;                          // 0xC38(0x40)(NativeAccessSpecifierPublic)
	struct FSleepingPersistBlock                 DELETED_SleepBlock;                                // 0xC78(0x40)(NativeAccessSpecifierPublic)
};

// 0x1408 (0x1408 - 0x0)
// ScriptStruct Palia.CharacterLoadingData
struct FCharacterLoadingData
{
public:
	struct FCharacterPersistContainer            CharacterContainer;                                // 0x0(0xCB8)(NativeAccessSpecifierPublic)
	struct FVALDTOS_MetaCharacterFormat          MetaCharacterData;                                 // 0xCB8(0x718)(NativeAccessSpecifierPublic)
	struct FGuid                                 CharacterId;                                       // 0x13D0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 LoadoutId;                                         // 0x13E0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMetaDataLoaded;                                   // 0x13F0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bContainerDataLoaded;                              // 0x13F1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCharacterContainerDataExists;                     // 0x13F2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasPendingHouseLoad;                              // 0x13F3(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 HouseGuid;                                         // 0x13F4(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AAB[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1420 (0x1420 - 0x0)
// ScriptStruct Palia.PlayerLoadingData
struct FPlayerLoadingData
{
public:
	bool                                         IsLoaded;                                          // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AAC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APlayerController*                     PlayerController;                                  // 0x8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterLoadingData                 CharacterData;                                     // 0x10(0x1408)(NativeAccessSpecifierPublic)
	bool                                         ReadyForInitialTeleport;                           // 0x1418(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AAD[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.PersistBlobId
struct FPersistBlobId
{
public:
	struct FGuid                                 BlobGuid;                                          // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BlobType;                                          // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AB2[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x24 (0x24 - 0x0)
// ScriptStruct Palia.PersistActorId
struct FPersistActorId
{
public:
	struct FGuid                                 HashId;                                            // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPersistBlobId                        BlobId;                                            // 0x10(0x14)(NoDestructor, NativeAccessSpecifierPrivate)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Palia.PendingHousingPersistActorsQueue
struct FPendingHousingPersistActorsQueue
{
public:
	class AHousingOwnershipActor*                House;                                             // 0x0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPersistActorId>               LoadQueue;                                         // 0x8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AB3[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AValeriaCharacter*                     LoadInstigator;                                    // 0x28(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Palia.SessionActorId
struct FSessionActorId
{
public:
	int32                                        ID;                                                // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Palia.ValeriaItem
struct FValeriaItem
{
public:
	int32                                        Amount;                                            // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AB5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x8(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemMetaData                         MetaData;                                          // 0x38(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FItemMetaData_UseLimit                MetaDataUse;                                       // 0x48(0x4)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AB6[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Palia.DebugCheatPlaceItems
struct FDebugCheatPlaceItems
{
public:
	struct FValeriaItem                          ItemToPlace;                                       // 0x0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UPlacementRegionComponent*             Region;                                            // 0x50(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               SpawnLocationInRegion;                             // 0x58(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Palia.DebugCheatActorSpawn
struct FDebugCheatActorSpawn
{
public:
	TSubclassOf<class AActor>                    SpawnActorClass;                                   // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AB7[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            SpawnActorTransform;                               // 0x10(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x908 (0x908 - 0x0)
// ScriptStruct Palia.DebugCheat
struct FDebugCheat
{
public:
	int32                                        TimeWarpMinutes;                                   // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TimeWarpToDayZero;                                 // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bModifyVillagerSpeedScalar;                        // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AB8[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VillagerSpeedScalarModifier;                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AB9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurrencyConfig*                       CurrencyToAdd;                                     // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrencyAmountToAdd;                               // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVitalType                        VitalTypeToAdd;                                    // 0x1C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ABA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        VitalAmountToAdd;                                  // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ABB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FValeriaItem                          ItemToAdd;                                         // 0x28(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bOverflowToStorage;                                // 0x78(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRemoveItemToAddInstead;                           // 0x79(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTryToUpdateRelevantStats;                         // 0x7A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowPickupRewards;                               // 0x7B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESkillType                        SkillTypeToAdd;                                    // 0x7C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ABC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SkillAmountToAdd;                                  // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerId;                                        // 0x84(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerCoreId;                                    // 0x88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FriendshipAmount;                                  // 0x8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RomanceAmount;                                     // 0x90(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERomanceStateChange               RomanceStateChange;                                // 0x94(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ABD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RecipeId;                                          // 0x98(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TeleportCharacter;                                 // 0x9C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ABE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               TeleportCharacterTo;                               // 0xA0(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TeleportVisitPlot;                                 // 0xB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ABF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                TeleportCharacterToPlotId;                         // 0xC0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BuffId;                                            // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UpdateMetaData;                                    // 0xD4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AC0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVALDTOS_MetaCharacterFormat          MetaData;                                          // 0xD8(0x718)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        VillagerQuestConfigIdToComplete;                   // 0x7F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerQuestConfigIdToGrant;                      // 0x7F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerMailMessageConfigId;                       // 0x7F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerQuestConfigIdToFulfill;                    // 0x7FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerQuestRequirementIndexToFulfill;            // 0x800(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AC1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                ActorToUpgrade;                                    // 0x808(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ConsoleCommand;                                    // 0x810(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ResetAllSeenDialogue;                              // 0x820(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AC3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          TagToSet;                                          // 0x824(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TagValueToSet;                                     // 0x82C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RandomizeGiftPreferences;                          // 0x830(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AC4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        EnableExplicitGiftPreference;                      // 0x834(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RevealGiftPreferences;                             // 0x838(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForgetGiftPreferences;                             // 0x839(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ClearAllGiftPreferences;                           // 0x83A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ClearAllGiftHistory;                               // 0x83B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AcquireStorageBag;                                 // 0x83C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AC5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDebugCheatPlaceItems                 PlaceItems;                                        // 0x840(0x70)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         bMaxOutPlayer;                                     // 0x8B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bKickMeOff;                                        // 0x8B1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AC6[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDebugCheatActorSpawn>         ActorsToSpawn;                                     // 0x8B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bResetChallengeProgress;                           // 0x8C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bChallengeWeeklyReset;                             // 0x8C9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AC7[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                StatToSetName;                                     // 0x8D0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDebugCheatStatType               StatToSetType;                                     // 0x8E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AC8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                StatToSetValue;                                    // 0x8E8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUnlockAllGearTypes;                               // 0x8F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDowngradeItem;                                    // 0x8F9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AC9[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCheatSetConfig*                       CheatSetConfig;                                    // 0x900(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct Palia.ErrorMessage
struct FErrorMessage
{
public:
	class FName                                  ErrorId;                                           // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerQuestConfigId;                             // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ACC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AValeriaCharacter*                     Character;                                         // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x18(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.ValeriaInputSettings
struct FValeriaInputSettings
{
public:
	bool                                         bInvertMouseXAxis;                                 // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInvertMouseYAxis;                                 // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ACD[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MouseSensitivity;                                  // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.PlotPresence
struct FPlotPresence
{
public:
	bool                                         bAtHome;                                           // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnPlot;                                           // 0x1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ACF[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AHousingPlotActor*                     CurrentHousingPlot;                                // 0x8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.GardenActionParams
struct FGardenActionParams
{
public:
	enum class EGardenActionType                 ActionType;                                        // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AD0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBagSlotLocation                      ItemLocation;                                      // 0x4(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        PlotIndex;                                         // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.HousingSlotActionParams
struct FHousingSlotActionParams
{
public:
	enum class EHousingSlotAction                Action;                                            // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHousingSlotType                  SlotType;                                          // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AD1[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SlotId;                                            // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Name;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CostChoice;                                        // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHousingVisitationState           Visitation;                                        // 0x1C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AD3[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct Palia.SimpleDecorExtraField
struct FSimpleDecorExtraField
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        IntValue;                                          // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.PlacementRegionId
struct FPlacementRegionId
{
public:
	class FString                                AnchorId;                                          // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSessionActorId                       ParentSessionId;                                   // 0x10(0x4)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPersistActorId                       ParentPersistId;                                   // 0x14(0x24)(RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0xAC (0xB8 - 0xC)
// ScriptStruct Palia.SimpleDecorPlaceable
struct FSimpleDecorPlaceable : public FFastArraySerializerItem
{
public:
	int32                                        ItemPersistId;                                     // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TintPersistID;                                     // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSessionActorId                       SessionId;                                         // 0x14(0x4)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlacementRegionId                    Anchor;                                            // 0x18(0x38)(NativeAccessSpecifierPublic)
	struct FVector                               Position;                                          // 0x50(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              Rotation;                                          // 0x68(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FSimpleDecorExtraField>        ExtraFields;                                       // 0x80(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        SlotId;                                            // 0x90(0x4)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPersistActorId                       PersistId;                                         // 0x94(0x24)(RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct Palia.DialogueToShow
struct FDialogueToShow
{
public:
	int32                                        ConfigId;                                          // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AlternativeScriptId;                               // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_QuestDef>          QuestDef;                                          // 0x8(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsQuestPinned;                                    // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AD5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UActorTagComponent*                    VillagerTagComponent;                              // 0x40(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPersistentTagMapComponent*            PlayerTagComponent;                                // 0x48(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AD6[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x198 (0x198 - 0x0)
// ScriptStruct Palia.DialogueListToShow
struct FDialogueListToShow
{
public:
	TArray<struct FDialogueToShow>               Dialogues;                                         // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FDialogueToShow                       StartupDialogue;                                   // 0x10(0x80)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FDialogueToShow                       GreetingDialogue;                                  // 0x90(0x80)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FDialogueToShow                       GiftHintDialogue;                                  // 0x110(0x80)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         IsBranchingDialogueChoice;                         // 0x190(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsDialogueRefresh;                                 // 0x191(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AD8[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.TelemetryClientDataForMapTravelLoadTime
struct FTelemetryClientDataForMapTravelLoadTime
{
public:
	int64                                        StartTime;                                         // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        EndTime;                                           // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StartMap;                                          // 0x10(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                EndMap;                                            // 0x20(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MapTravelReason;                                   // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ADA[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Palia.WallpaperItem
struct FWallpaperItem
{
public:
	class FName                                  WallTagName;                                       // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SurfaceId;                                         // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ADB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> WallpaperItemType;                                 // 0x10(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.HouseOwnershipTitle
struct FHouseOwnershipTitle
{
public:
	struct FGuid                                 UserGuid;                                          // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 HousingGuid;                                       // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHousingPermissionLevel           PermissionLevel;                                   // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ADC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        HousingSlot;                                       // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.RecipePlayerOptionMapping
struct FRecipePlayerOptionMapping
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SimpleIngredientIndex;                             // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ADE[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.RecipePlayerOptions
struct FRecipePlayerOptions
{
public:
	TArray<struct FRecipePlayerOptionMapping>    IngredientsToUse;                                  // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         UseStarQualityItems;                               // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ADF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.MusicState
struct FMusicState
{
public:
	TArray<int32>                                PlayedNotes;                                       // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UInstrumentSongConfig*                 MatchedSong;                                       // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.VAL_PostDialogueChainGiftInfo
struct FVAL_PostDialogueChainGiftInfo
{
public:
	class AValeriaCharacter*                     PlayerCharacter;                                   // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AE0[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBagSlotLocation                      BagSlotLocation;                                   // 0x10(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VAL_PostDialogueChainSupplementaryInfo
struct FVAL_PostDialogueChainSupplementaryInfo
{
public:
	TArray<struct FVAL_PostDialogueChainGiftInfo> PostDialogueChainGiftInfos;                        // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.AnimState
struct FAnimState
{
public:
	struct FGameplayTag                          State;                                             // 0x0(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          SubState;                                          // 0x8(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Transition;                                        // 0x10(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.ArcadeLeaderboardEntry
struct FArcadeLeaderboardEntry
{
public:
	int32                                        Score;                                             // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AE1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// ScriptStruct Palia.SingleQuestReward
struct FSingleQuestReward
{
public:
	int32                                        Amount;                                            // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AE2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x8(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        QualityStars;                                      // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVitalType                        VitalType;                                         // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bVitalChangeMax;                                   // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AE3[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurrencyConfig*                       Currency;                                          // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RelationshipVillagerId;                            // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RelationshipVillagerCoreId;                        // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FriendshipChange;                                  // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RomanceChange;                                     // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERomanceStateChange               RomanceStateChange;                                // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AE4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RecipeConfigId;                                    // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.TimeOfDayHourMinute
struct FTimeOfDayHourMinute
{
public:
	int32                                        Hour;                                              // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Minute;                                            // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.TimeOfDayFilter
struct FTimeOfDayFilter
{
public:
	int32                                        Periods;                                           // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimeOfDayHourMinute                  MinTime;                                           // 0x4(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FTimeOfDayHourMinute                  MaxTime;                                           // 0xC(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bAllowEditMaxTime;                                 // 0x14(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AE6[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.VillagerRelationshipFilter
struct FVillagerRelationshipFilter
{
public:
	float                                        MinLevel;                                          // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxLevel;                                          // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.SpecificVillagerRelationshipFilter
struct FSpecificVillagerRelationshipFilter
{
public:
	struct FDataTableRowHandle                   Villager;                                          // 0x0(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVillagerRelationshipFilter           Filter;                                            // 0x10(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct Palia.QuestActivityPrereq
struct FQuestActivityPrereq
{
public:
	int32                                        QuestConfigId;                                     // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVillagerQuestStatus              Status;                                            // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AE7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Step;                                              // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VillagerQuestItemReqSubConfig
struct FVillagerQuestItemReqSubConfig
{
public:
	class UVAL_ItemTypeDefinitionAsset*          RequiredItemType;                                  // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmountRequired;                                    // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StarQualityRequired;                               // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.VillagerVitalReqSubConfig
struct FVillagerVitalReqSubConfig
{
public:
	enum class EVitalType                        VitalType;                                         // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AE9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MinimumAmount;                                     // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xB0 (0xB0 - 0x0)
// ScriptStruct Palia.LootRequirements
struct FLootRequirements
{
public:
	struct FTimeOfDayFilter                      TimeOfDay;                                         // 0x0(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FSpecificVillagerRelationshipFilter> FriendshipRequirements;                            // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSpecificVillagerRelationshipFilter> RomanceRequirements;                               // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPersistentTagFilter>          PlayerTagRequirements;                             // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FQuestActivityPrereq>          QuestPrereqs;                                      // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVillagerQuestItemReqSubConfig> RequiredItems;                                     // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVillagerVitalReqSubConfig            VitalRequirement;                                  // 0x68(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FString>                        RequiredAccomplishments;                           // 0x70(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataTableRowHandle>           RequiredRecipes;                                   // 0x80(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 WeatherGameStates;                                 // 0x90(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x110 (0x110 - 0x0)
// ScriptStruct Palia.ChallengeClientInfo
struct FChallengeClientInfo
{
public:
	class FText                                  DisplayName;                                       // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  DisplayText;                                       // 0x18(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FLootRequirements                     Requirements;                                      // 0x30(0xB0)(NativeAccessSpecifierPublic)
	TArray<int32>                                GoalAmounts;                                       // 0xE0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSingleQuestReward>            Rewards;                                           // 0xF0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGuid                                 Guid;                                              // 0x100(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1E0 (0x1E0 - 0x0)
// ScriptStruct Palia.CharacterStateChangeParams
struct FCharacterStateChangeParams
{
public:
	struct FAnimState                            AnimState;                                         // 0x0(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FDialogueListToShow                   DialoguesToShow;                                   // 0x18(0x198)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UDialogueComponent*                    Dialogue;                                          // 0x1B0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPlayerInfoState                  PlayerInfoState;                                   // 0x1B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AEB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGardenActionParams                   GardenParams;                                      // 0x1BC(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        BookToReadId;                                      // 0x1CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVillagerGiftReceiverComponent*        GiftReceiver;                                      // 0x1D0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         LeaveDialogueUnchanged;                            // 0x1D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AEC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// ScriptStruct Palia.CrafterComponent_ChangeContext_OldValues
struct FCrafterComponent_ChangeContext_OldValues
{
public:
	enum class ECrafterState                     OldState;                                          // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// ScriptStruct Palia.CrafterComponent_ChangeContext
struct FCrafterComponent_ChangeContext
{
public:
	bool                                         StateChanged;                                      // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RecipeChanged;                                     // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RecipeInstanceChanged;                             // 0x2(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.CompleRecipeCrafterProductState
struct FCompleRecipeCrafterProductState
{
public:
	class UCrafterComponent*                     CrafterComponent;                                  // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EComplexRecipeCrafterCurrentProductState OneProductState;                                   // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AEE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.Recipe_RequireItem
struct FRecipe_RequireItem
{
public:
	class UVAL_ItemTypeDefinitionAsset*          ItemType;                                          // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          GameplayTag;                                       // 0x8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemAmount;                                        // 0x10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AEF[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.ComplexRecipeProduct
struct FComplexRecipeProduct
{
public:
	TArray<struct FCompleRecipeCrafterProductState> CrafterProductStates;                              // 0x0(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRecipe_RequireItem                   Item;                                              // 0x10(0x18)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	enum class EComplexRecipeCrafterCurrentProductState ConsolidatedOneProductState;                       // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EComplexRecipeProducerAllProductState AllProductState;                                   // 0x29(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AF1[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RemainingToMake;                                   // 0x2C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        RemainingToUse;                                    // 0x30(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3AF2[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.ComplexRecipeCrafter
struct FComplexRecipeCrafter
{
public:
	TArray<struct FComplexRecipeProduct>         Products;                                          // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                        CrafterPersistId;                                  // 0x10(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RemainingRecipes;                                  // 0x14(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.Recipe_RequireInteraction
struct FRecipe_RequireInteraction
{
public:
	class URecipeInteractionConfig*              Config;                                            // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InteractionTimeSecs;                               // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RequiredSuccessCount;                              // 0xC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PlayerMarkerMovementEasingFuncBlendExp;            // 0x10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AF3[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// ScriptStruct Palia.RecipeStepConfig
struct FRecipeStepConfig
{
public:
	enum class ERecipeStepType                   Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AF4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRecipe_RequireItem                   Type_Item;                                         // 0x8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FRecipe_RequireInteraction            Type_Interaction;                                  // 0x20(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	enum class ERecipeStepStartType              StartType;                                         // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AF5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ParentStep;                                        // 0x3C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                StepIndices;                                       // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                        RevealTime;                                        // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RequestExpirationTime;                             // 0x54(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// ScriptStruct Palia.InventoryRequest
struct FInventoryRequest
{
public:
	struct FGuid                                 RequestId;                                         // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      RequesterId;                                       // 0x10(0x30)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInventoryRequestStatus           Status;                                            // 0x40(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AF6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemId;                                            // 0x44(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x48(0x30)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemCount;                                         // 0x78(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemCountPartial;                                  // 0x7C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             CreatedAt;                                         // 0x80(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             ExpiresAt;                                         // 0x88(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      FillerId;                                          // 0x90(0x30)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             FilledTime;                                        // 0xC0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.EquipmentMetaData
struct FEquipmentMetaData
{
public:
	struct FBagSlotLocation                      InventoryLocation;                                 // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	enum class EEquipmentType                    EquipmentType;                                     // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AF7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        WaterAmount;                                       // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHidden;                                           // 0x10(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AF8[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// ScriptStruct Palia.EquipmentItem
struct FEquipmentItem
{
public:
	struct FEquipmentMetaData                    ItemMetaData;                                      // 0x0(0x14)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AFB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x18(0x30)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AEquipViewActor*>               SpawnedActors;                                     // 0x48(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.FishNibbles
struct FFishNibbles
{
public:
	TArray<float>                                Nibbles;                                           // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<enum class EFishingNibbleLevel>       NibbleLevels;                                      // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x130 (0x130 - 0x0)
// ScriptStruct Palia.FishingMiniGameViewState
struct FFishingMiniGameViewState
{
public:
	enum class EFishingMiniGameState             State;                                             // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFishingMiniGameResult            EndState;                                          // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3AFF[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimState                            AnimState;                                         // 0x4(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B00[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            World;                                             // 0x20(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StateLerp;                                         // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SafeZoneOffset;                                    // 0x84(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SafeZoneLength;                                    // 0x88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDamage;                                         // 0x8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxHp;                                             // 0x90(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B01[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class AActor>                  FishBlueprint;                                     // 0x98(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsNibblingPhase;                                   // 0xC8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B03[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NibbleTime;                                        // 0xCC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFishNibbles>                  Nibbles;                                           // 0xD0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         IsBiting;                                          // 0xE0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReelButtonHeld;                                    // 0xE1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B04[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BobberPosition;                                    // 0xE4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RodPosition;                                       // 0xE8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        JumpEndTimeMs;                                     // 0xEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsJumping;                                         // 0xF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B05[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Damage;                                            // 0xF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Hp;                                                // 0xF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceToShore;                                   // 0xFC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FishSpeed;                                         // 0x100(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TimeMs;                                            // 0x104(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               CastPosition;                                      // 0x108(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeEncouraged;                                  // 0x120(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldStruggle;                                   // 0x121(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B08[0xE];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Palia.VAL_ClientInteractableProp
struct FVAL_ClientInteractableProp
{
public:
	class AActor*                                PropActor;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECharacterAttachPoint             AttachPoint;                                       // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B0C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AValeriaCharacter*                     InteractingPlayer;                                 // 0x10(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                       AttachParent;                                      // 0x18(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3B0D[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x154 (0x160 - 0xC)
// ScriptStruct Palia.TrackedItemInfo
struct FTrackedItemInfo : public FFastArraySerializerItem
{
public:
	uint8                                        Pad_3B13[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                Actor;                                             // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      OwnerNetworkId;                                    // 0x18(0x30)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InstanceId;                                        // 0x48(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B14[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             Alignment;                                         // 0x50(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             MainIcon;                                          // 0x60(0x30)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             ActivityIcon;                                      // 0x90(0x30)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             QuestIcon;                                         // 0xC0(0x30)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseQuestIconOnCompass;                            // 0xF0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanAppearAsInWorldMarker;                         // 0xF1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnCompass;                                        // 0xF2(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSmallOnMap;                                       // 0xF3(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B18[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  DisplayText;                                       // 0xF8(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bIsTextOnly;                                       // 0x110(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanUserTrack;                                     // 0x111(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETrackedItemType                  Type;                                              // 0x112(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B1A[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Tooltip;                                           // 0x118(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector                               Location;                                          // 0x130(0x18)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Yaw;                                               // 0x148(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsTrackedByResourceTrackerBuff;                   // 0x14C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B1C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxVisibleDistance;                                // 0x150(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AreaRadius;                                        // 0x154(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWorldLocationContext             WorldLocationContext;                              // 0x158(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bQuestTrackingAttached;                            // 0x159(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasPinned;                                        // 0x15A(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B1D[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.LootEvent
struct FLootEvent
{
public:
	TArray<struct FQuestReward>                  Rewards;                                           // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class AValeriaCharacter*                     Character;                                         // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                LootInstigatorName;                                // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.VitalsChangeContext
struct FVitalsChangeContext
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x8(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct Palia.VitalsChange
struct FVitalsChange
{
public:
	enum class EVitalType                        VitalType;                                         // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B21[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AmountChanged;                                     // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVitalChangeFlags                 Flags;                                             // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B22[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVitalsChangeContext                  Context;                                           // 0x10(0x38)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.FishCaughtResult
struct FFishCaughtResult
{
public:
	bool                                         bWasPerfectCatch;                                  // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasFirstTimeCatch;                                // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EItemCategory                     FishCategory;                                      // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B23[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UVAL_ItemTypeDefinitionAsset*          FishType;                                          // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FishQuality;                                       // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B24[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.InventoryChange
struct FInventoryChange
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x30(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B26[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x78 (0x78 - 0x0)
// ScriptStruct Palia.Mail
struct FMail
{
public:
	enum class EMailType                         MailType;                                          // 0x0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B28[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                MailId;                                            // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EReadStatus                       ReadStatus;                                        // 0x18(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EActionableState                  ActionableState;                                   // 0x19(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMailSenderType                   MailSenderType;                                    // 0x1A(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B29[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                SenderId;                                          // 0x20(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                RecipientUserId;                                   // 0x30(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MessageContent;                                    // 0x40(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInventoryChange>              ExchangeItems;                                     // 0x50(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDateTime                             SentDateTime;                                      // 0x60(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             ExpireDateTime;                                    // 0x68(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             LastUpdatedDateTime;                               // 0x70(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.Mailbox
struct FMailbox
{
public:
	TArray<struct FMail>                         Items;                                             // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.MessageTarget
struct FMessageTarget
{
public:
	enum class EMessageTargetType                Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B2B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                RecipientId;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                RecipientCharacterName;                            // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct Palia.Message
struct FMessage
{
public:
	struct FMessageTarget                        Target;                                            // 0x0(0x28)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FromID;                                            // 0x28(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FromCharacterName;                                 // 0x38(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FromServerName;                                    // 0x48(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x78 - 0x58)
// ScriptStruct Palia.ValeriaChatMessage
struct FValeriaChatMessage : public FMessage
{
public:
	enum class EChatMessageType                  ChatMessageType;                                   // 0x58(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B2E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Content;                                           // 0x60(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             Timestamp;                                         // 0x70(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x80 - 0x58)
// ScriptStruct Palia.ControlMessage
struct FControlMessage : public FMessage
{
public:
	enum class EControlMessageType               ControlMessageType;                                // 0x58(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B2F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Content;                                           // 0x60(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FromWorldName;                                     // 0x70(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// ScriptStruct Palia.Presence
struct FPresence
{
public:
	struct FUniqueNetIdRepl                      ID;                                                // 0x0(0x30)(Edit, BlueprintVisible, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVAL_PresenceStatus               Status;                                            // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B31[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                FromServerName;                                    // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MapName;                                           // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatusString;                                      // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 CharacterId;                                       // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CharacterName;                                     // 0x78(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Palia.VAL_ValidateLoadoutError_ErrorItems
struct FVAL_ValidateLoadoutError_ErrorItems
{
public:
	TSet<class UVAL_CharacterCustomizationItemBase*> ErroredItems;                                      // 0x0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Palia.VAL_ValidateLoadoutErrorPayload
struct FVAL_ValidateLoadoutErrorPayload
{
public:
	TMap<enum class EVAL_ValidateLoadoutErrorType, struct FVAL_ValidateLoadoutError_ErrorItems> ErrorToItemMap;                                    // 0x0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct Palia.VillagerActionInfo
struct FVillagerActionInfo
{
public:
	class FText                                  UiText;                                            // 0x0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>             AnimationMappingConfigDataTable;                   // 0x18(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AnimationMappingConfigRowName;                     // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             ActionIcon;                                        // 0x50(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.VAL_InteractorLockParams
struct FVAL_InteractorLockParams
{
public:
	class UInteractableComponent*                Interactable;                                      // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USphereComponent*                      InteractableLocation;                              // 0x8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UObject>                SourceContext;                                     // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UObject>                TargetEngaged;                                     // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECharacterState                   CharacterState;                                    // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnforceFacing;                                    // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnforcePosition;                                  // 0x22(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B3A[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.ValeriaAudioSettings
struct FValeriaAudioSettings
{
public:
	float                                        OverallVolume;                                     // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SoundVolume;                                       // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MusicVolume;                                       // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DialogueVolume;                                    // 0xC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPanningRule                      AudioPanningRule;                                  // 0x10(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAudioMixProfiles                 AudioMixProfile;                                   // 0x11(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         MuteWhenNotInFocus;                                // 0x12(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B3C[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.ValeriaGameplaySettings
struct FValeriaGameplaySettings
{
public:
	bool                                         bAllowCameraShake;                                 // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableReticle;                                    // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideChatTimestamp;                                // 0x2(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B3E[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumStorageBagsInActionBar;                         // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESprintType                       SprintType;                                        // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowEatingWhenFull;                              // 0x9(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowServerPing;                                   // 0xA(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableActionBarWrapping;                          // 0xB(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMaxGoldRepairSlider;                              // 0xC(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMaxToolkitRepairSlider;                           // 0xD(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRepairAll;                                        // 0xE(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B40[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Palia.ValeriaGraphicSettings
struct FValeriaGraphicSettings
{
public:
	float                                        FOV;                                               // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct Palia.ValeriaMenuSettings
struct FValeriaMenuSettings
{
public:
	TMap<enum class EVAL_QuestCategory, bool>    QuestCategoriesExpanded;                           // 0x0(0x50)(BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	bool                                         CompletedQuestCategoryExpanded;                    // 0x50(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B41[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        LastSelectedQuestId;                               // 0x54(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VillagerRelationshipChange
struct FVillagerRelationshipChange
{
public:
	int32                                        VillagerCoreId;                                    // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmountChanged;                                     // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERelationshipType                 Type;                                              // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bNewLevelReached;                                  // 0x9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B42[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NewLevel;                                          // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct Palia.AddedIngredient
struct FAddedIngredient
{
public:
	struct FValeriaItem                          Item;                                              // 0x0(0x50)(NativeAccessSpecifierPublic)
	struct FGuid                                 PlayerId;                                          // 0x50(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIntermediate;                                     // 0x60(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B46[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Palia.ComplexRecipeIngredient
struct FComplexRecipeIngredient
{
public:
	int32                                        UniqueId;                                          // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 OwningPlayerId;                                    // 0x4(0x10)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 CarryingPlayerId;                                  // 0x14(0x10)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        QualityStars;                                      // 0x24(0x4)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SellValueOfInputs;                                 // 0x28(0x4)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsCarried;                                        // 0x2C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B49[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.ComplexRecipeIngredientSet
struct FComplexRecipeIngredientSet
{
public:
	int32                                        ItemPersistId;                                     // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CrafterPersistId;                                  // 0x4(0x4)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            ItemIcon;                                          // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FComplexRecipeIngredient>      Shelved;                                           // 0x10(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FComplexRecipeIngredient>      InPlay;                                            // 0x20(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bShelvedHasStarQuality;                            // 0x30(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIntermediate;                                     // 0x31(0x1)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B4B[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Palia.ComplexRecipeMinigame
struct FComplexRecipeMinigame
{
public:
	float                                        SuccessPercent;                                    // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Palia.ComplexRecipeRecord
struct FComplexRecipeRecord
{
public:
	int32                                        RecipeId;                                          // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESkillType                        SkillType;                                         // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B4F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCrafterComponent*                     OwningCrafter;                                     // 0x8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CrafterConfigId;                                   // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B50[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FComplexRecipeCrafter>         Crafters;                                          // 0x18(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FComplexRecipeIngredientSet>   Ingredients;                                       // 0x28(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FComplexRecipeMinigame>        Minigames;                                         // 0x38(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAddedIngredient>              UsedItems;                                         // 0x48(0x10)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	class FString                                SessionId;                                         // 0x58(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EComplexRecipeState               State;                                             // 0x68(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bConsumeStarQualityIngredients;                    // 0x69(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B51[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.EquipItemConfig
struct FEquipItemConfig
{
public:
	class UVAL_ItemTypeDefinitionAsset*          ItemType;                                          // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.AbilityToolConfig
struct FAbilityToolConfig
{
public:
	struct FEquipItemConfig                      ToolEquippedConfig;                                // 0x0(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UValeriaGASGameplayAbility> PlayerAbility;                                     // 0x8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE8 - 0x8)
// ScriptStruct Palia.CrafterConfig
struct FCrafterConfig : public FTableRowBase
{
public:
	int32                                        PersistId;                                         // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B54[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CrafterName;                                       // 0x10(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  CrafterPromptOverride;                             // 0x28(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  CurrentJobTextOverride;                            // 0x40(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             HudIcon;                                           // 0x58(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  CrafterFToInteractText;                            // 0x88(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	enum class ESkillType                        SkillType;                                         // 0xA0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStarQuality;                                      // 0xA1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowIntermixingRegularAndStarQualityIngredients; // 0xA2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B55[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RequiredLevel;                                     // 0xA4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CraftTimeMultiplier;                               // 0xA8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CraftTimeOverride;                                 // 0xAC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECrafterMode                      Mode;                                              // 0xB0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBurnsStuff;                                       // 0xB1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideInWorldUIWhileCrafting;                       // 0xB2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutoPickupOnCraftingEnd;                          // 0xB3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideRecipesUIPane;                                // 0xB4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B56[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAbilityToolConfig                    AbilityActivate;                                   // 0xB8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAbilityToolConfig                    AbilityAddIngredient;                              // 0xC8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAbilityToolConfig                    AbilityCollect;                                    // 0xD8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.CreateInventoryRequest
struct FCreateInventoryRequest
{
public:
	struct FUniqueNetIdRepl                      RequesterId;                                       // 0x0(0x30)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemId;                                            // 0x30(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemCount;                                         // 0x34(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.VAL_ServerSpace
struct FVAL_ServerSpace
{
public:
	struct FGuid                                 ID;                                                // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVAL_ServerSpaceType              Type;                                              // 0x10(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B58[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.SessionActorRecord
struct FSessionActorRecord
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B59[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.PrivateSpaceDestination
struct FPrivateSpaceDestination
{
public:
	class UPrivateSpaceLevelHandle*              PSHandle;                                          // 0x0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTeleportDestinationComponent*         TeleportDestination;                               // 0x8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.TargetPointArray
struct FTargetPointArray
{
public:
	TArray<class AValeriaTargetPoint*>           Entries;                                           // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Palia.VAL_ServerSpaceContainer
struct FVAL_ServerSpaceContainer
{
public:
	TMap<struct FGuid, struct FVAL_ServerSpace>  Table;                                             // 0x0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct Palia.ContentReport
struct FContentReport
{
public:
	struct FUniqueNetIdRepl                      ReportedUserId;                                    // 0x0(0x30)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EContentReportType                Type;                                              // 0x30(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B5A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ContentId;                                         // 0x38(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Reason;                                            // 0x48(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.SupportRequest
struct FSupportRequest
{
public:
	class FString                                Subject;                                           // 0x0(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Comment;                                           // 0x10(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct Palia.UserReport
struct FUserReport
{
public:
	struct FUniqueNetIdRepl                      ReportedUserId;                                    // 0x0(0x30)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EUserReportType                   Type;                                              // 0x30(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B5B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Reason;                                            // 0x38(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VAL_CharacterCustomization_BodyData
struct FVAL_CharacterCustomization_BodyData
{
public:
	float                                        HeightScalar;                                      // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThicknessScalar;                                   // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GenderExpressionScalar;                            // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MuscularExpressionScalar;                          // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x918 (0x918 - 0x0)
// ScriptStruct Palia.VAL_CharacterCustomizationLoadout
struct FVAL_CharacterCustomizationLoadout
{
public:
	enum class EVAL_CharacterBodyType            BodyType;                                          // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B5D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVAL_CharacterCustomization_BodyData  BodyData;                                          // 0x4(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3B5E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_AnimSet> AnimSetItem;                                       // 0x18(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              AnimSet_VariantSelections;                         // 0x48(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_SkinTone> SkinToneItem;                                      // 0x98(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              SkinTone_VariantSelections;                        // 0xC8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Eyes> EyesItem;                                          // 0x118(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Eyes_VariantSelections;                            // 0x148(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_HairStyle> HairStyleItem;                                     // 0x198(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              HairStyle_VariantSelections;                       // 0x1C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Head> HeadItem;                                          // 0x218(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Head_VariantSelections;                            // 0x248(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Torso> TorsoItem;                                         // 0x298(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Torso_VariantSelections;                           // 0x2C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Legs> LegsItem;                                          // 0x318(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Legs_VariantSelections;                            // 0x348(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Hat> HatItem;                                           // 0x398(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Hat_VariantSelections;                             // 0x3C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
