#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------

enum class EVAL_CharacterBodyType : uint8
{
	Male                           = 0,
	Female                         = 1,
	ValerianMale                   = 2,
	ValerianFemale                 = 3,
	EVAL_MAX                       = 4,
};

enum class EVAL_CharacterRenderStudioState : uint8
{
	Idle                           = 0,
	LoadingLevel                   = 1,
	PresentingLevel                = 2,
	ClosingStudio                  = 3,
	Closed                         = 4,
	EVAL_MAX                       = 5,
};

enum class ENotificationSpecialType : uint8
{
	General                        = 0,
	InventoryFull                  = 1,
	Error                          = 2,
	ENotificationSpecialType_MAX   = 3,
};

enum class ETimeOfDayPeriod : uint8
{
	Morning                        = 0,
	Day                            = 1,
	Evening                        = 2,
	Night                          = 3,
	Custom                         = 4,
	ETimeOfDayPeriod_MAX           = 5,
};

enum class ETravelDestinationType : uint8
{
	None                           = 0,
	Home                           = 1,
	Stable                         = 2,
	PrivateSpace                   = 3,
	SpecificLocation               = 4,
	ETravelDestinationType_MAX     = 5,
};

enum class EStoragePoolType : uint8
{
	None                           = 0,
	Primary                        = 1,
	Lockbox                        = 2,
	Max                            = 3,
};

enum class EVillagerGiftRewardLevel : uint8
{
	Love                           = 0,
	Like                           = 1,
	Neutral                        = 2,
	Dislike                        = 3,
	Hate                           = 4,
	INVALID                        = 5,
	EVillagerGiftRewardLevel_MAX   = 6,
};

enum class ERomanceState : uint8
{
	Inactive                       = 0,
	Dating                         = 1,
	ERomanceState_MAX              = 2,
};

enum class EVAL_BoolOverride : uint8
{
	NotOverridden                  = 0,
	OverrideFalse                  = 1,
	OverrideTrue                   = 2,
	EVAL_MAX                       = 3,
};

enum class EHousingSlotType : uint8
{
	PlayerOwned                    = 0,
	PlayerPurchased                = 1,
	EHousingSlotType_MAX           = 2,
};

enum class ENumericalOperation : uint8
{
	Set                            = 0,
	Add                            = 1,
	Subtract                       = 2,
	ENumericalOperation_MAX        = 3,
};

enum class ESkillType : uint8
{
	None                           = 0,
	Fishing                        = 1,
	Cooking                        = 2,
	Alchemy                        = 3,
	Gardening                      = 4,
	Blacksmithing                  = 5,
	AnimalHusbandry                = 6,
	Mining                         = 7,
	Hunting                        = 8,
	Combat                         = 9,
	BugCatching                    = 10,
	Lumberjacking                  = 11,
	Master                         = 12,
	Foraging                       = 13,
	FurnitureMaking                = 14,
	Num                            = 15,
	ESkillType_MAX                 = 16,
};

enum class ERomanceStateChange : uint8
{
	None                           = 0,
	StartDating                    = 1,
	BreakUp                        = 7,
	ERomanceStateChange_MAX        = 8,
};

enum class EVitalType : uint8
{
	None                           = 0,
	Coins                          = 1,
	CommunityPoints                = 2,
	Stamina                        = 3,
	Health                         = 4,
	PremiumCurrency                = 5,
	MedalFishing                   = 6,
	Focus                          = 7,
	RestedFocus                    = 8,
	Num                            = 9,
	EVitalType_MAX                 = 10,
};

enum class EVAL_QuestNeedsResetReason : uint8
{
	InvalidResult                  = -2,
	NoResetNeeded                  = 0,
	VersionMismatch                = 1,
	QuestDeleted                   = 2,
	Cheat                          = 3,
	StateError                     = 4,
	StateMismatch                  = 5,
	EVAL_MAX                       = 6,
};

enum class EVAL_QuestPlayerStateChangeType : uint8
{
	Invalid                        = 0,
	Reward                         = 1,
	Deduction                      = 2,
	DialogueViewed                 = 3,
	VisitStarted                   = 4,
	VisitCompleted                 = 5,
	QuestReset                     = 6,
	EVAL_MAX                       = 7,
};

enum class EVAL_QuestBranchingGoalChoiceStatus : uint8
{
	Undecided                      = 0,
	Rejected                       = 1,
	Chosen                         = 2,
	EVAL_MAX                       = 3,
};

enum class EVitalPersistType : uint8
{
	None                           = 0,
	Coins                          = 1,
	CommunityPoints                = 2,
	Stamina                        = 3,
	Health                         = 4,
	PremiumCurrency                = 5,
	MedalFishing                   = 6,
	Focus                          = 7,
	RestedFocus                    = 8,
	Num                            = 9,
	EVitalPersistType_MAX          = 10,
};

enum class EHousingPermissionLevel : uint8
{
	Owner                          = 0,
	CoOwner                        = 1,
	Companion                      = 2,
	BFF                            = 3,
	Editor                         = 4,
	Contractor                     = 5,
	NoEntry                        = 6,
	Default                        = 7,
	Unknown                        = 8,
	EHousingPermissionLevel_MAX    = 9,
};

enum class EInventoryAmount : uint8
{
	FullStack                      = 0,
	SplitStack                     = 1,
	EInventoryAmount_MAX           = 2,
};

enum class EDebugCheatStatType : uint8
{
	Bool                           = 0,
	Int                            = 1,
	Float                          = 2,
	Double                         = 3,
	EDebugCheatStatType_MAX        = 4,
};

enum class EVAL_PartyManagerState : uint8
{
	Idle                           = 0,
	AwaitingPartyCreation          = 1,
	InParty                        = 2,
	EVAL_MAX                       = 3,
};

enum class EGardenActionType : uint8
{
	None                           = 0,
	Plant                          = 1,
	Harvest                        = 2,
	Water                          = 3,
	Fertilize                      = 4,
	TillPartial                    = 5,
	Till                           = 6,
	Weed                           = 7,
	MaxActionType                  = 8,
	EGardenActionType_MAX          = 9,
};

enum class EHousingVisitationState : uint8
{
	Friends                        = 0,
	Closed                         = 1,
	Request                        = 2,
	Open                           = 3,
	EHousingVisitationState_MAX    = 4,
};

enum class EHousingSlotAction : uint8
{
	Activate                       = 0,
	Rename                         = 1,
	Purchase                       = 2,
	Delete                         = 3,
	VisitationChange               = 4,
	Add                            = 5,
	EHousingSlotAction_MAX         = 6,
};

enum class EVAL_ShrineType : uint8
{
	Phoenix                        = 0,
	Dragon                         = 1,
	EVAL_MAX                       = 2,
};

enum class EVillagerQuestStatus : uint8
{
	NotStarted                     = 0,
	InProgress                     = 1,
	Completed                      = 2,
	Expired                        = 3,
	Invalid                        = 4,
	EVillagerQuestStatus_MAX       = 5,
};

enum class EChappaChaseState : uint8
{
	UnInitialized                  = 0,
	ReadyToPlay                    = 1,
	InProgress                     = 2,
	EChappaChaseState_MAX          = 3,
};

enum class EValeriaCharacterEvent : uint8
{
	Deserialized                   = 0,
	NewCharacter                   = 1,
	Replicated                     = 2,
	EValeriaCharacterEvent_MAX     = 3,
};

enum class EWorldLocationContext : uint8
{
	Default                        = 0,
	LimitedEvent                   = 1,
	Visit                          = 2,
	PrivateSpace                   = 3,
	EWS                            = 4,
	DialogueRoom                   = 5,
	EWorldLocationContext_MAX      = 6,
};

enum class EValeriaClimbDashDirection : uint8
{
	Invalid                        = 0,
	Left                           = 1,
	UpAndLeft                      = 2,
	Up                             = 3,
	UpAndRight                     = 4,
	Right                          = 5,
	EValeriaClimbDashDirection_MAX = 6,
};

enum class EPlayerInfoState : uint8
{
	NotSpecified                   = 0,
	Cheats                         = 1,
	Currencies                     = 2,
	Map                            = 3,
	Quests                         = 4,
	Recipes                        = 5,
	Relationships                  = 6,
	Skills                         = 7,
	EPlayerInfoState_MAX           = 8,
};

enum class ECrafterState : uint8
{
	Invalid                        = 0,
	SelectingRecipe                = 1,
	ActionsRequired                = 2,
	Crafting                       = 3,
	FinalCook                      = 4,
	CollectionReady                = 5,
	ECrafterState_MAX              = 6,
};

enum class EComplexRecipeProducerAllProductState : uint8
{
	None                           = 0,
	Needs                          = 1,
	Complete                       = 5,
	EComplexRecipeProducerAllProductState_MAX = 6,
};

enum class EComplexRecipeCrafterCurrentProductState : uint8
{
	None                           = 0,
	Complete                       = 5,
	Fail                           = 2,
	InProgress                     = 4,
	EComplexRecipeCrafterCurrentProductState_MAX = 6,
};

enum class ERecipeStepStartType : uint8
{
	PreviousStepFinish             = 0,
	PreviousStepStart              = 1,
	ParentStepStart                = 2,
	RecipeStart                    = 3,
	SpecificStepsFinished          = 4,
	ERecipeStepStartType_MAX       = 5,
};

enum class ERecipeStepType : uint8
{
	None                           = 0,
	RequireItem                    = 1,
	RequireInteraction             = 2,
	ERecipeStepType_MAX            = 3,
};

enum class EEquipmentType : uint8
{
	Invalid                        = 0,
	Gear                           = 1,
	Tool                           = 2,
	Primary                        = 3,
	Temporary                      = 4,
	EEquipmentType_MAX             = 5,
};

enum class EAnimStateFish : uint8
{
	None                           = 0,
	Idle                           = 1,
	Bite                           = 2,
	Hooked                         = 3,
	Caught                         = 4,
	StraightJump                   = 5,
	EAnimStateFish_MAX             = 6,
};

enum class EFishingMiniGameResult : uint8
{
	None                           = 0,
	Success                        = 1,
	Failure                        = 2,
	Cancelled                      = 3,
	CancelledCast                  = 4,
	EmptyHanded                    = 5,
	EFishingMiniGameResult_MAX     = 6,
};

enum class EFishingNibbleLevel : uint8
{
	Aggressive                     = 0,
	Cautious                       = 1,
	Normal                         = 2,
	Strategic                      = 3,
	Uncertain                      = 4,
	EFishingNibbleLevel_MAX        = 5,
};

enum class EFishingMiniGameState : uint8
{
	Inactive                       = 0,
	AimingCast                     = 1,
	CancellingCast                 = 2,
	DeployingCast                  = 3,
	SelectingLoot                  = 4,
	Waiting                        = 5,
	Nibbling                       = 6,
	Biting                         = 7,
	Reeling                        = 8,
	Finished                       = 9,
	Catching                       = 10,
	EFishingMiniGameState_MAX      = 11,
};

enum class EPlantingState : uint8
{
	None                           = 0,
	Open                           = 1,
	NotAvailable                   = 2,
	Preview                        = 3,
	EPlantingState_MAX             = 4,
};

enum class ECharacterAttachPoint : uint8
{
	None                           = 0,
	LeftHand                       = 1,
	RightHand                      = 2,
	ECharacterAttachPoint_MAX      = 3,
};

enum class ETrackedItemType : uint8
{
	Default                        = 0,
	LocalPlayer                    = 1,
	RemotePlayer                   = 2,
	NPC                            = 3,
	MapActor                       = 4,
	Waypoint                       = 5,
	QuestMarker                    = 6,
	ETrackedItemType_MAX           = 7,
};

enum class EMinigameState : uint8
{
	None                           = 0,
	WaitingToStart                 = 1,
	WaitingForRelease              = 2,
	WaitingForPress                = 3,
	Start                          = 4,
	Running                        = 5,
	Penalty                        = 6,
	Failure                        = 7,
	Success                        = 8,
	EMinigameState_MAX             = 9,
};

enum class ESubgameResult : uint8
{
	None                           = 0,
	Failure                        = 1,
	Success                        = 2,
	ESubgameResult_MAX             = 3,
};

enum class EVitalChangeFlags : uint8
{
	None                           = 0,
	NotifyItemCarousel             = 1,
	TrackStat                      = 2,
	CreateShippingBinNotification  = 4,
	NotifyCarouselAndTrackStat     = 3,
	NotifyCarouselWithShippingBinNotificationAndTrackStat = 7,
	EVitalChangeFlags_MAX          = 8,
};

enum class EItemCategory : uint8
{
	NotSpecified                   = 0,
	Consumable                     = 1,
	Material                       = 2,
	Equipment                      = 3,
	Customization                  = 4,
	Vegetable                      = 5,
	Fruit                          = 6,
	Fish                           = 7,
	Meat                           = 8,
	Spice                          = 9,
	Ingredient                     = 10,
	Storage                        = 11,
	Tool                           = 12,
	Crafter                        = 13,
	Junk                           = 14,
	Book                           = 15,
	Fertilizer                     = 16,
	Bug                            = 17,
	Seed                           = 18,
	Product                        = 19,
	Crop                           = 20,
	Gatherable                     = 21,
	Wallpaper                      = 22,
	FloorTiling                    = 23,
	ExteriorWallpaper              = 24,
	Quest                          = 25,
	Instrument                     = 26,
	EItemCategory_MAX              = 27,
};

enum class EMailSenderType : uint8
{
	Player                         = 0,
	Character                      = 1,
	EMailSenderType_MAX            = 2,
};

enum class EActionableState : uint8
{
	Unactionable                   = 0,
	Actionable                     = 1,
	InAction                       = 2,
	ActionComplete                 = 3,
	EActionableState_MAX           = 4,
};

enum class EReadStatus : uint8
{
	New                            = 0,
	Opened                         = 1,
	Archived                       = 2,
	Deleted                        = 3,
	EReadStatus_MAX                = 4,
};

enum class EMailType : uint8
{
	Unknown                        = 0,
	Text                           = 1,
	Reward                         = 2,
	Gift                           = 3,
	EMailType_MAX                  = 4,
};

enum class EInputType : uint8
{
	Keyboard                       = 0,
	Gamepad                        = 1,
	Touch                          = 2,
	EInputType_MAX                 = 3,
};

enum class EMessageTargetType : uint8
{
	Invalid                        = 0,
	Server                         = 1,
	Direct                         = 2,
	Group                          = 3,
	Party                          = 4,
	PlayerGuild                    = 5,
	Development                    = 6,
	EMessageTargetType_MAX         = 7,
};

enum class EChatMessageType : uint8
{
	Text                           = 0,
	Image                          = 1,
	Notification                   = 2,
	Valeriagram                    = 3,
	EChatMessageType_MAX           = 4,
};

enum class EVAL_PresenceStatus : uint8
{
	Online                         = 0,
	Offline                        = 1,
	Away                           = 2,
	ExtendedAway                   = 3,
	DoNotDisturb                   = 4,
	Chat                           = 5,
	EVAL_MAX                       = 6,
};

enum class ETravelManagerStatus : uint8
{
	None                           = 0,
	FindingSessions                = 1,
	WaitingForReservation          = 2,
	JoiningSession                 = 3,
	PreparingForTravel             = 4,
	TravelFailure                  = 5,
	ReservationFailed              = 6,
	NoSessionsFound                = 7,
	JoinSessionFailed              = 8,
	ConnectionFailure              = 9,
	UnknownFailure                 = 10,
	ETravelManagerStatus_MAX       = 11,
};

enum class EVAL_LoadoutErrorType : uint8
{
	DisabledItem                   = 0,
	InvalidVariantChannel          = 1,
	MissingVariantOption           = 2,
	BodyTypeIncompatibility        = 3,
	NullInMandatorySlot            = 4,
	NoEntitlement                  = 5,
	EVAL_MAX                       = 6,
};

enum class EShaderBasedAnimEventEdge : uint8
{
	Triggered                      = 0,
	Started                        = 1,
	Ended                          = 2,
	EShaderBasedAnimEventEdge_MAX  = 3,
};

enum class ECharacterState : uint8
{
	Empty                          = 0,
	World                          = 1,
	Fishing                        = 2,
	Placement                      = 3,
	Aiming                         = 5,
	HousingUpgrades                = 13,
	Strafing                       = 17,
	GardenPlanting                 = 18,
	Minigame                       = 19,
	MinigameTouch                  = 20,
	Subgame                        = 54,
	BowAiming                      = 33,
	SwingReady                     = 34,
	Watering                       = 35,
	WaterRefill                    = 36,
	GardenFertilizing              = 40,
	Arcade                         = 41,
	Carrying                       = 42,
	Teleporting                    = 43,
	TakingPhotos                   = 45,
	FlowSprite                     = 51,
	PlayingInstrument              = 52,
	GardenTilling                  = 53,
	SwingingTool                   = 56,
	Dialogue                       = 9,
	SocialPanel                    = 22,
	GiveGift                       = 32,
	ECharacterState_MAX            = 57,
};

enum class EAudioMixProfiles : uint8
{
	Default                        = 0,
	Midnight                       = 1,
	Studio                         = 2,
	EAudioMixProfiles_MAX          = 3,
};

enum class ESprintType : uint8
{
	Undefined                      = 0,
	HoldToSprint                   = 1,
	TapToSprint                    = 2,
	ToggleSprint                   = 3,
	ESprintType_MAX                = 4,
};

enum class EVAL_QuestCategory : uint8
{
	Default                        = 0,
	Mastery                        = 1,
	Skills                         = 2,
	Villager                       = 3,
	Event                          = 4,
	Main                           = 5,
	Pinned                         = 255,
	EVAL_MAX                       = 256,
};

enum class EVillagerActivityStatus : uint8
{
	Traveling                      = 0,
	Action                         = 1,
	EVillagerActivityStatus_MAX    = 2,
};

enum class ERelationshipType : uint8
{
	INVALID                        = 0,
	Friendship                     = 1,
	Romance                        = 2,
	ERelationshipType_MAX          = 3,
};

enum class EMovementRelativeTo : uint8
{
	Camera                         = 0,
	ControlRotation                = 1,
	EMovementRelativeTo_MAX        = 2,
};

enum class ECharacterMoveMode : uint8
{
	Custom                         = 0,
	Normal                         = 1,
	Strafe                         = 2,
	StrafeWalk                     = 3,
	ECharacterMoveMode_MAX         = 4,
};

enum class EVAL_ChatPermissions : uint8
{
	None                           = 0,
	AllowedToSendMessages          = 1,
	ChatPanelVisible               = 2,
	All                            = 3,
	EVAL_MAX                       = 4,
};

enum class EComplexRecipeState : uint8
{
	Invalid                        = 0,
	Active                         = 1,
	Ended                          = 2,
	EComplexRecipeState_MAX        = 3,
};

enum class ECrafterMode : uint8
{
	None                           = 0,
	AutoCraft                      = 1,
	SemiAuto                       = 2,
	Manual                         = 3,
	ECrafterMode_MAX               = 4,
};

enum class EComplexRecipeCueState : uint8
{
	None                           = 0,
	Needs                          = 1,
	Fail                           = 2,
	Browsing                       = 3,
	InProgress                     = 4,
	Complete                       = 5,
	Holding                        = 6,
	EComplexRecipeCueState_MAX     = 7,
};

enum class EValeriaFuncResult : uint8
{
	Success                        = 0,
	Failure                        = 1,
	EValeriaFuncResult_MAX         = 2,
};

enum class EInventoryRequestStatus : uint8
{
	Open                           = 0,
	Filled                         = 1,
	Claimed                        = 2,
	EInventoryRequestStatus_MAX    = 3,
};

enum class EInvitationFailureReason : uint8
{
	AlreadyOnServer                = 0,
	DifferentMap                   = 1,
	EInvitationFailureReason_MAX   = 2,
};

enum class EPaliaScreenState : uint8
{
	Down                           = 0,
	DownToBlack                    = 1,
	Black                          = 2,
	BlackToDown                    = 3,
	BlackToLoadingScreen           = 4,
	LoadingScreen                  = 5,
	LoadingScreenToBlack           = 6,
	EPaliaScreenState_MAX          = 7,
};

enum class EVAL_ServerSpaceType : uint8
{
	Invalid                        = 0,
	HousingPlot                    = 1,
	CommunityCenter                = 2,
	EVAL_MAX                       = 3,
};

enum class EMapTravelReason : uint8
{
	MAP_TRAVEL_UNKNOWN             = 0,
	MAP_TRAVEL_PORTAL              = 1,
	MAP_TRAVEL_STABLES             = 2,
	MAP_TRAVEL_HOUSE               = 3,
	MAP_TRAVEL_LOBBY               = 4,
	MAP_TRAVEL_CHEATS              = 5,
	MAP_TRAVEL_MAX                 = 6,
};

enum class EVAL_ApplyCustomizationToActorContext : uint8
{
	None                           = 0,
	OpeningWardrobe                = 1,
	ChangingWardrobeItem           = 2,
	FinishCharacterCreation        = 3,
	ChangeCharacterPreview         = 4,
	ChangeItemPremiumStore         = 5,
	SelectCharacter                = 6,
	PreOpeningCinematic            = 7,
	RandomizeCharacter             = 8,
	ChangeBodyType                 = 9,
	RenderRequestsForUI            = 10,
	EVAL_MAX                       = 11,
};

enum class EVAL_UpdateSpawnedPetContext : uint8
{
	LoadoutChanged                 = 0,
	PostTeleport                   = 1,
	EVAL_MAX                       = 2,
};

enum class EVAL_SocialBlockError : uint8
{
	None                           = 0,
	AlreadyBlocked                 = 1,
	NotBlocked                     = 2,
	BlockYourself                  = 3,
	MiscFail                       = 4,
	EVAL_MAX                       = 5,
};

enum class EVAL_PlayerGuildQuestRarity : uint8
{
	Common                         = 0,
	Uncommon                       = 1,
	Rare                           = 2,
	Num                            = 3,
	EVAL_MAX                       = 4,
};

enum class EVAL_PlayerGuildQuestSize : uint8
{
	Small                          = 0,
	Medium                         = 1,
	Large                          = 2,
	EVAL_MAX                       = 3,
};

enum class EVAL_PlayerGuildMemberRole : uint8
{
	Member                         = 0,
	Officer                        = 1,
	Leader                         = 2,
	EVAL_MAX                       = 3,
};

enum class EVAL_PlayerGuildInvitationPolicy : uint8
{
	LeaderInviteOnly               = 0,
	OfficerInviteOnly              = 1,
	Open                           = 2,
	EVAL_MAX                       = 3,
};

enum class EVAL_PlayerGuildApplicationPolicy : uint8
{
	Closed                         = 0,
	LeaderApprovalRequired         = 1,
	OfficerApprovalRequired        = 2,
	Open                           = 3,
	EVAL_MAX                       = 4,
};

enum class EAimingAnimationAimOffset : uint8
{
	Unspecified                    = 0,
	BowFiring                      = 1,
	Throwing                       = 2,
	Slot3                          = 3,
	Slot4                          = 4,
	Slot5                          = 5,
	Slot6                          = 6,
	Slot7                          = 7,
	EAimingAnimationAimOffset_MAX  = 8,
};

enum class EPlantSize : uint8
{
	Default                        = 0,
	TwoByTwo                       = 1,
	ThreeByThree                   = 2,
	EPlantSize_MAX                 = 3,
};

enum class EItemStorageCategory : uint8
{
	NotSpecified                   = 0,
	Alchemy                        = 1,
	All                            = 2,
	Bugs                           = 3,
	Cooking                        = 4,
	Crops                          = 5,
	Decor                          = 6,
	Equipment                      = 7,
	Fish                           = 8,
	Gatherable                     = 9,
	Materials                      = 10,
	Products                       = 11,
	Seeds                          = 12,
	Sorted                         = 13,
	EItemStorageCategory_MAX       = 14,
};

enum class EItemQuality : uint8
{
	NotSpecified                   = 0,
	Simple                         = 1,
	Standard                       = 2,
	Fine                           = 3,
	Exquisite                      = 4,
	Impeccable                     = 5,
	Perfect                        = 6,
	EItemQuality_MAX               = 7,
};

enum class EItemRarity : uint8
{
	NotSpecified                   = 0,
	Abundant                       = 1,
	Common                         = 2,
	Uncommon                       = 3,
	Rare                           = 4,
	Epic                           = 5,
	Legendary                      = 6,
	EItemRarity_MAX                = 7,
};

enum class EFencePlacementType : uint8
{
	NotAFence                      = 0,
	Fence                          = 1,
	FenceColumn                    = 2,
	FenceGate                      = 3,
	EFencePlacementType_MAX        = 4,
};

enum class EValeriaGameAction : uint8
{
	TillSoil                       = 0,
	WaterTile                      = 1,
	PullWeed                       = 2,
	EValeriaGameAction_MAX         = 3,
};

enum class EVillagerQuestBranchingCategory : uint8
{
	Mandatory                      = 0,
	BranchingCategory1             = 1,
	BranchingCategory2             = 2,
	BranchingCategory3             = 3,
	EVillagerQuestBranchingCategory_MAX = 4,
};

enum class EVillagerQuestRequirementType : uint8
{
	Item                           = 0,
	MeetVillager                   = 1,
	CatchFish                      = 2,
	CraftItem                      = 3,
	CompleteBillboard              = 4,
	HasSeenDialogue                = 5,
	Vital                          = 6,
	LearnRecipe                    = 7,
	GiftAVillager                  = 8,
	AcquireHouseStructure          = 9,
	AcquireSkillLevel              = 10,
	GatherItem                     = 11,
	Purchase                       = 12,
	Sell                           = 13,
	Harvest                        = 14,
	ViewMail                       = 15,
	PlayerTag                      = 16,
	Kill                           = 17,
	ContributeToBillboard          = 18,
	DiscoverVillagerGiftPreference = 19,
	UseItem                        = 20,
	Loot                           = 21,
	Acquire                        = 22,
	Currency                       = 23,
	Spend                          = 24,
	PlotValue                      = 25,
	GameAction                     = 26,
	StatReached                    = 27,
	EVillagerQuestRequirementType_MAX = 28,
};

enum class EQuestIconToUse : uint8
{
	None                           = 0,
	VillagerIcon                   = 1,
	CustomIcon                     = 2,
	EQuestIconToUse_MAX            = 3,
};

enum class EBuffStackingRule : uint8
{
	NotSpecified                   = 0,
	Infinite                       = 1,
	Unique                         = 3,
	UniqueReplace                  = 4,
	Stacks                         = 6,
	ReplaceIfInSameGroup           = 7,
	StrongestInGroupReplacesOrRefreshes = 8,
	EBuffStackingRule_MAX          = 9,
};

enum class EBuffEffect : uint8
{
	NotSpecified                   = 0,
	HealthMax                      = 5,
	MovementAcceleration           = 6,
	MovementRotation               = 7,
	MovementSpeed                  = 8,
	FocusBonusExperiencePercent    = 11,
	ClimbingSpeed                  = 12,
	GlideSpeed                     = 13,
	EBuffEffect_MAX                = 14,
};

enum class EBuffDisplayType : uint8
{
	NotSpecified                   = 0,
	Buff                           = 1,
	Debuff                         = 2,
	Appetite                       = 3,
	EBuffDisplayType_MAX           = 4,
};

enum class EShopCostScalingType : uint8
{
	None                           = 0,
	NumberPurchased                = 1,
	EShopCostScalingType_MAX       = 2,
};

enum class EScalingRewardType : uint8
{
	Disabled                       = 0,
	AddVital                       = 1,
	AddVitalMax                    = 2,
	Currency                       = 3,
	EScalingRewardType_MAX         = 4,
};

enum class ESkillCategory : uint8
{
	None                           = 0,
	Gathering                      = 1,
	Crafting                       = 2,
	ESkillCategory_MAX             = 3,
};

enum class ERelationshipDifficulty : uint8
{
	Easy                           = 0,
	Medium                         = 1,
	Hard                           = 2,
	ERelationshipDifficulty_MAX    = 3,
};

enum class EVillagerGiftDifficultyGrouping : uint8
{
	Unspecified                    = 0,
	Difficulty1                    = 1,
	Difficulty2                    = 2,
	Difficulty3                    = 3,
	Difficulty4                    = 4,
	EVillagerGiftDifficultyGrouping_MAX = 5,
};

enum class EValeriaPersonalityElement : uint8
{
	None                           = 0,
	Air                            = 1,
	Earth                          = 2,
	Fire                           = 3,
	Water                          = 4,
	EValeriaPersonalityElement_MAX = 5,
};

enum class EWorldMapType : uint8
{
	Default                        = 0,
	HousingPlot                    = 1,
	EWorldMapType_MAX              = 2,
};

enum class EModificationCostType : uint8
{
	Vital                          = 0,
	Currency                       = 1,
	Item                           = 2,
	Num                            = 3,
	EModificationCostType_MAX      = 4,
};

enum class EAmmoType : uint8
{
	None                           = 0,
	FishingBait                    = 1,
	HuntingAmmo                    = 2,
	InsectBall                     = 3,
	COUNT                          = 4,
	EAmmoType_MAX                  = 5,
};

enum class EDialogueType : uint8
{
	Default                        = 0,
	FirstMeeting                   = 1,
	Greeting                       = 2,
	Dismiss                        = 3,
	ChoiceResponse                 = 4,
	GiftResponse                   = 5,
	Chat                           = 6,
	Flirt                          = 7,
	GiftHint                       = 9,
	QuestStart                     = 20,
	QuestHint                      = 21,
	QuestGoal                      = 22,
	QuestTurnIn                    = 23,
	QuestComplete                  = 24,
	ImportantDialogue              = 30,
	EDialogueType_MAX              = 31,
};

enum class EQuestDurationType : uint8
{
	TimeBased                      = 0,
	ThruAvailability               = 1,
	EQuestDurationType_MAX         = 2,
};

enum class EQuestRequirementType : uint8
{
	None                           = 0,
	Item                           = 1,
	EQuestRequirementType_MAX      = 2,
};

enum class EQuestRewardType : uint8
{
	None                           = 0,
	Item                           = 1,
	Vital                          = 2,
	Relationship                   = 3,
	Recipe                         = 4,
	Buff                           = 5,
	Skill                          = 6,
	ItemUse                        = 7,
	BagUpgrade                     = 8,
	TriggerQuest                   = 9,
	Misc                           = 10,
	Mail                           = 11,
	GiftPreference                 = 12,
	PlayerTag                      = 13,
	Visit                          = 15,
	Currency                       = 16,
	EQuestRewardType_MAX           = 17,
};

enum class EItemSortType : uint8
{
	NotSpecified                   = 0,
	Alphabetical                   = 1,
	EItemSortType_MAX              = 2,
};

enum class EPlacementHoverType : uint8
{
	None                           = 0,
	HousingPlotUnlock              = 1,
	Actor                          = 2,
	Alteration                     = 3,
	EPlacementHoverType_MAX        = 4,
};

enum class EVillagerScheduleActivityType : uint8
{
	None                           = 0,
	Work                           = 1,
	FreeTime                       = 2,
	Follow                         = 3,
	PrivateSpace                   = 4,
	Absent                         = 5,
	EVillagerScheduleActivityType_MAX = 6,
};

enum class ELootFilterResult : uint8
{
	Success                        = 0,
	GenericFail                    = 1,
	AlreadyOwns                    = 2,
	IncorrectTimeOfDay             = 3,
	IncorrectWeather               = 4,
	DoesntMeetFriendshipReq        = 5,
	DoesntMeetRomanceReq           = 6,
	TooManyForTagReq               = 7,
	TooFewForTagReq                = 8,
	QuestFilterFail                = 9,
	MissingRequiredItems           = 10,
	MissingRequiredVitals          = 11,
	MissingRequiredAccomplishments = 12,
	MissingRequiredRecipes         = 13,
	ELootFilterResult_MAX          = 14,
};

enum class EVAL_TeleportCompFlags : uint8
{
	None                           = 0,
	LockedControl                  = 1,
	EVAL_MAX                       = 2,
};

enum class ETeleportTravelType : uint8
{
	Default                        = 0,
	PrivateSpace                   = 1,
	HomePlot                       = 2,
	VisitingPlot                   = 3,
	SpecificLocation               = 4,
	LimitedEvent                   = 5,
	ETeleportTravelType_MAX        = 6,
};

enum class EValeriaStatModificationType : uint8
{
	None                           = 0,
	Smallest                       = 1,
	Largest                        = 2,
	Increment                      = 3,
	Decrement                      = 4,
	Set                            = 5,
	EValeriaStatModificationType_MAX = 6,
};

enum class EAimingState : uint8
{
	ZoomingIn                      = 0,
	ZoomedIn                       = 1,
	ZoomingOut                     = 2,
	ZoomedOut                      = 3,
	INVALID                        = 4,
	EAimingState_MAX               = 5,
};

enum class EValeriaNoiseEventVolume : uint8
{
	Undefined                      = 0,
	Quiet                          = 1,
	Normal                         = 2,
	Loud                           = 3,
	EValeriaNoiseEventVolume_MAX   = 4,
};

enum class EValeriaNoiseStealthType : uint8
{
	SmokeCandle                    = 0,
	EValeriaNoiseStealthType_MAX   = 1,
};

enum class EAnimMappingCachePolicy : uint8
{
	NoCaching                      = 0,
	TryToStore                     = 1,
	TryToUseCached                 = 2,
	EAnimMappingCachePolicy_MAX    = 3,
};

enum class EEscapeTypeOld : uint8
{
	None                           = 0,
	Water                          = 1,
	Tree                           = 2,
	EEscapeTypeOld_MAX             = 3,
};

enum class EBuffClientActionType : uint8
{
	None                           = 0,
	Remove                         = 1,
	EBuffClientActionType_MAX      = 2,
};

enum class EBundleType : uint8
{
	Unspecified                    = 0,
	Water                          = 1,
	Fire                           = 2,
	Air                            = 3,
	Earth                          = 4,
	BundleType_MAX                 = 5,
};

enum class ECameraTargetMode : uint8
{
	HardLock                       = 0,
	HardLockRotate                 = 1,
	FreeLook                       = 2,
	CameraTargetMode_MAX           = 3,
};

enum class ECharacterCreationHairColor : uint8
{
	Black                          = 0,
	Blonde                         = 1,
	Blue                           = 2,
	Brown                          = 3,
	Green                          = 4,
	Red                            = 5,
	White                          = 6,
	ECharacterCreationHairColor_MAX = 7,
};

enum class ECustomizationItemSlot : uint8
{
	FullBody                       = 0,
	Torso                          = 1,
	Legs                           = 2,
	ECustomizationItemSlot_MAX     = 3,
};

enum class EMouseControlMode : uint8
{
	GameOnly                       = 0,
	UiOnly                         = 1,
	UiAndGame                      = 2,
	EMouseControlMode_MAX          = 3,
};

enum class EVAL_ChatManagerChannelFlags : uint8
{
	None                           = 0,
	CurrentlyQueryingChannels      = 1,
	QueuedToQueryChannels          = 2,
	AttemptingToLogin              = 4,
	EVAL_MAX                       = 5,
};

enum class ECrafterEngageResult : uint8
{
	None                           = 0,
	Ok                             = 1,
	Ok_MatchesDesiredState         = 2,
	Fail_TooFarAway                = 3,
	Fail_OtherPlayerEngaging       = 4,
	ECrafterEngageResult_MAX       = 5,
};

enum class ECrafterStepState : uint8
{
	NotStarted                     = 0,
	InProgress                     = 1,
	Paused                         = 2,
	Completed                      = 4,
	Expired                        = 8,
	Done                           = 12,
	ECrafterStepState_MAX          = 13,
};

enum class EComplexRecipeIngredientState : uint8
{
	None                           = 0,
	Browsing                       = 3,
	Holding                        = 6,
	EComplexRecipeIngredientState_MAX = 7,
};

enum class ECraftingRequestItemMode : uint8
{
	None                           = 0,
	AutoFetch                      = 1,
	Manual                         = 2,
	ECraftingRequestItemMode_MAX   = 3,
};

enum class EValeriaNoiseEventType : uint8
{
	NetSwing                       = 0,
	SprintFootstep                 = 1,
	RunFootstep                    = 2,
	WalkFootstep                   = 3,
	JumpLanding                    = 4,
	AxeHit                         = 5,
	PickaxeHit                     = 6,
	EValeriaNoiseEventType_MAX     = 7,
};

enum class ECurrentBehavior : uint8
{
	INVALID                        = 0,
	Wander                         = 1,
	BecomeAware                    = 2,
	Evade                          = 3,
	Death                          = 4,
	Despawn                        = 5,
	HitReact                       = 6,
	Stunned                        = 7,
	FallIntoPit                    = 8,
	Escape                         = 9,
	PrepareToDespawn               = 10,
	ECurrentBehavior_MAX           = 11,
};

enum class EErrorMessageType : uint8
{
	Error                          = 0,
	Info                           = 1,
	Success                        = 2,
	EErrorMessageType_MAX          = 3,
};

enum class EFactionRelationshipType : uint8
{
	Ally                           = 0,
	Enemy                          = 1,
	Neutral                        = 2,
	Ignore                         = 3,
	EFactionRelationshipType_MAX   = 4,
};

enum class EFenceMeshType : uint8
{
	FenceStartPost                 = 0,
	FenceEndPost                   = 1,
	FenceSpan                      = 2,
	GateStartPost                  = 3,
	GateEndPost                    = 4,
	Gate                           = 5,
	Column                         = 6,
	EFenceMeshType_MAX             = 7,
};

enum class EFishingCastIndicatorStatus : uint8
{
	UnfishableGround               = 0,
	FishableWater                  = 1,
	EFishingCastIndicatorStatus_MAX = 2,
};

enum class EFishingState_NEW : uint8
{
	None                           = 0,
	Aiming                         = 1,
	CastInProgress                 = 2,
	WaitingForBite                 = 3,
	Bite                           = 4,
	Reeling                        = 5,
	FishCaught                     = 6,
	Celebration                    = 7,
	EFishingState_MAX              = 8,
};

enum class EFishingCelebrationTier : uint8
{
	None                           = 0,
	Basic                          = 1,
	Medium                         = 2,
	High                           = 3,
	EFishingCelebrationTier_MAX    = 4,
};

enum class EFishingState_OLD : uint8
{
	None                           = 0,
	AimingCast                     = 1,
	RotatingToCast                 = 2,
	DeployingCast                  = 3,
	PlayingMiniGame                = 4,
	EFishingState_MAX              = 5,
};

enum class EFFishingLevelSegmentActionType : uint8
{
	MoveTo                         = 0,
	JumpTo                         = 1,
	FFishingLevelSegmentActionType_MAX = 2,
};

enum class EFishingViewStatePhase : uint8
{
	Idle                           = 0,
	Active                         = 1,
	Ended                          = 2,
	EFishingViewStatePhase_MAX     = 3,
};

enum class EFishingSafeTier : uint8
{
	Safe                           = 0,
	Caution                        = 1,
	Danger                         = 2,
	EFishingSafeTier_MAX           = 3,
};

enum class EFishingBobberHitSomethingResult : uint8
{
	FishableWater                  = 0,
	UnfishableWater                = 1,
	TooShallowOrTooLowWater        = 2,
	Other                          = 3,
	EFishingBobberHitSomethingResult_MAX = 4,
};

enum class EFriendStatus : uint8
{
	Unknown                        = 0,
	Accepted                       = 1,
	PendingInbound                 = 2,
	PendingOutbound                = 3,
	Blocked                        = 4,
	Suggested                      = 5,
	EFriendStatus_MAX              = 6,
};

enum class EKnowsRecipeConditionStatus : uint8
{
	HasNotLearned                  = 0,
	HasLearned                     = 1,
	EKnowsRecipeConditionStatus_MAX = 2,
};

enum class ECompletedBundleConditionStatus : uint8
{
	NotStarted                     = 0,
	InProgress                     = 1,
	Completed                      = 2,
	RewardGranted                  = 3,
	ECompletedBundleConditionStatus_MAX = 4,
};

enum class EQuestProgressConditionStatus : uint8
{
	NotStarted                     = 0,
	InProgress                     = 1,
	Completed                      = 2,
	Expired                        = 3,
	EQuestProgressConditionStatus_MAX = 4,
};

enum class EVAL_GameplayEventSourceTargetType : uint8
{
	Any                            = 0,
	Player                         = 1,
	Villager                       = 2,
	Creature                       = 3,
	EVAL_MAX                       = 4,
};

enum class EVAL_GameplayEventPlayerRelationship : uint8
{
	Any                            = 0,
	Self                           = 1,
	EVAL_MAX                       = 2,
};

enum class EVAL_GE_AcquireItem_Method : uint8
{
	Any                            = 0,
	Gather                         = 1,
	Craft                          = 2,
	Loot                           = 4,
	Harvest                        = 8,
	Purchase                       = 16,
	Mail                           = 32,
	EVAL_GE_AcquireItem_MAX        = 33,
};

enum class EVAL_GE_ReleaseItem_Method : uint8
{
	Any                            = 0,
	Discard                        = 1,
	Sell                           = 2,
	Use                            = 4,
	FulfillRequest                 = 8,
	EVAL_GE_ReleaseItem_MAX        = 9,
};

enum class EGardenTileDirection : uint8
{
	N                              = 0,
	NE                             = 1,
	E                              = 2,
	SE                             = 3,
	S                              = 4,
	SW                             = 5,
	W                              = 6,
	NW                             = 7,
	EGardenTileDirection_MAX       = 8,
};

enum class EGardenTileNeighborAdjacency : uint8
{
	Invalid                        = 0,
	Border                         = 1,
	Corner                         = 2,
	BorderAndCorner                = 3,
	EGardenTileNeighborAdjacency_MAX = 4,
};

enum class EGardeningWeedingMinigameInteractStyle : uint8
{
	None                           = 0,
	PressToWeed                    = 1,
	HoldToRelease                  = 2,
	HoldToReleaseRetry             = 3,
	Default                        = 1,
	EGardeningWeedingMinigameInteractStyle_MAX = 4,
};

enum class EGearChangeResult : uint8
{
	Success                        = 0,
	Failure                        = 1,
	NotEnoughInventorySpace        = 2,
	ItemToAddNotAGear              = 3,
	RomancePinSlotOnCooldown       = 4,
	FishingIsActive                = 5,
	EGearChangeResult_MAX          = 6,
};

enum class EUseEventType : uint8
{
	None                           = 0,
	Pressed                        = 1,
	Released                       = 2,
	EUseEventType_MAX              = 3,
};

enum class EInteractEventType : uint8
{
	None                           = 0,
	Pressed                        = 1,
	Released                       = 3,
	EInteractEventType_MAX         = 4,
};

enum class EInteractEventIndex : uint8
{
	Primary                        = 0,
	Secondary                      = 1,
	MousePrimary                   = 2,
	MouseSecondary                 = 3,
	Tertiary                       = 4,
	Quaternary                     = 5,
	EInteractEventIndex_MAX        = 6,
};

enum class ESubgameState : uint8
{
	None                           = 0,
	WaitingToStart                 = 1,
	Active                         = 2,
	Complete                       = 3,
	ESubgameState_MAX              = 4,
};

enum class ERpcMontageAction : uint8
{
	None                           = 0,
	Start                          = 1,
	Stop                           = 2,
	ERpcMontageAction_MAX          = 3,
};

enum class ERpcAction : uint8
{
	None                           = 0,
	Default                        = 1,
	Synchronous                    = 2,
	ClientToServer                 = 3,
	ServerToClient                 = 4,
	ServerMulticast                = 5,
	ServerMulticastRemote          = 6,
	ERpcAction_MAX                 = 7,
};

enum class ERequirementType : uint8
{
	Default                        = 0,
	ItemUse                        = 1,
	PlayerActionUse                = 2,
	ERequirementType_MAX           = 3,
};

enum class EHitReactionType : uint8
{
	None                           = 0,
	Flinch                         = 1,
	Stagger                        = 2,
	Knockback                      = 3,
	EHitReactionType_MAX           = 4,
};

enum class ETeleportState : uint8
{
	Inactive                       = 0,
	Preparing                      = 1,
	CoolingDown                    = 2,
	Disrupted                      = 3,
	ETeleportState_MAX             = 4,
};

enum class EInstrumentType : uint8
{
	Invalid                        = 0,
	Wind                           = 1,
	EInstrumentType_MAX            = 2,
};

enum class EInteractablePlateVerticalOffsetDirection : uint8
{
	Up                             = 0,
	Down                           = 1,
	EInteractablePlateVerticalOffsetDirection_MAX = 2,
};

enum class EVAL_InteractorOperation : uint8
{
	UnlockPlayer                   = 0,
	LockPlayer                     = 1,
	EVAL_MAX                       = 2,
};

enum class EInventoryAddItemFlags : uint8
{
	None                           = 0,
	NotifyItemCarousel             = 1,
	AllowOverflow                  = 2,
	Carry                          = 4,
	TrackStat                      = 8,
	AllowPickupRewards             = 16,
	SendOverflowToStorage          = 32,
	NotifyCarouselAndAllowOverflow = 3,
	NorifyCarouselAndSendOverflowToStorage = 33,
	NotifyCarouselAndTrackStat     = 9,
	NotifyCarouselAndTrackStatWithOverflow = 11,
	NotifyCarouselAndTrackStatAndSendOverflowToStorage = 41,
	NotifyCarouselAndAllowOverflowWithPickupRewards = 19,
	NotifyCarouselAndTrackStatAndAllowOverflowWithPickupRewards = 27,
	NotifyCarouselAndTrackStatAndSendOverflowToStorageWithPickupRewards = 57,
	EInventoryAddItemFlags_MAX     = 58,
};

enum class EInventoryOperation : uint8
{
	None                           = 0,
	Add                            = 1,
	Remove                         = 2,
	AddRemove                      = 3,
	EInventoryOperation_MAX        = 4,
};

enum class EGardenBuffEffectType : uint8
{
	None                           = 0,
	PreventWeedGrowth              = 1,
	HarvestBooster                 = 2,
	IncreaseOutputQuality          = 3,
	RetainWater                    = 4,
	DoubleGrowthRate               = 5,
	MaxEffectType                  = 6,
	EGardenBuffEffectType_MAX      = 7,
};

enum class EWateringTilePattern : uint8
{
	SingleTile                     = 0,
	BorderTiles                    = 1,
	BorderAndCornerTiles           = 2,
	EWateringTilePattern_MAX       = 3,
};

enum class EValeriaStorageType : uint8
{
	None                           = 0,
	Carried                        = 1,
	CraftingShelved                = 2,
	Inventory                      = 4,
	PlayerStorage                  = 8,
	All                            = 255,
	EValeriaStorageType_MAX        = 256,
};

enum class EIOMode : uint8
{
	ReadOnly                       = 0,
	ReadWrite                      = 1,
	EIOMode_MAX                    = 2,
};

enum class ELootAchievementCreditType : uint8
{
	None                           = 0,
	Hunting                        = 1,
	Mining                         = 2,
	BugCatching                    = 3,
	TreeChopping                   = 4,
	ELootAchievementCreditType_MAX = 5,
};

enum class ELootType : uint8
{
	None                           = 0,
	LootActor                      = 1,
	LootPerVitalChange             = 2,
	LootPerVitalChangeBanked       = 3,
	ELootType_MAX                  = 4,
};

enum class EMeleeAttackType : uint8
{
	INVALID                        = 0,
	LightAttack1                   = 1,
	LightAttack2                   = 2,
	LightAttack3                   = 3,
	HeavyAttack                    = 4,
	AttackWindup                   = 5,
	EMeleeAttackType_MAX           = 6,
};

enum class EMinigameQTEStyle : uint8
{
	Hold                           = 0,
	PressAndReleaseCycle           = 1,
	Mash                           = 2,
	Beat                           = 3,
	BeatPingPong                   = 4,
	EMinigameQTEStyle_MAX          = 5,
};

enum class ENotificationType : uint8
{
	Informational                  = 0,
	Presence                       = 1,
	Invite                         = 2,
	Party                          = 3,
	ENotificationType_MAX          = 4,
};

enum class ELightingModificationType : uint8
{
	NoModification                 = 0,
	AdditiveBlend                  = 1,
	OverrideBlend                  = 2,
	Modification                   = 3,
	ELightingModificationType_MAX  = 4,
};

enum class EPaliaScreenStateRequest : uint8
{
	DesiredScreenState_None        = 0,
	DesiredScreenState_PutUp       = 1,
	DesiredScreenState_MAX         = 2,
};

enum class EPaliaScreenTypeRequest : uint8
{
	DesiredScreenType_None         = 0,
	DesiredScreenType_SimpleBlack  = 1,
	DesiredScreenType_FullLoading  = 2,
	DesiredScreenType_MAX          = 3,
};

enum class EPaliaTargetState : uint8
{
	TargetState_Down               = 0,
	TargetState_Black              = 1,
	TargetState_LoadingScreen      = 2,
	TargetState_MAX                = 3,
};

enum class EVAL_BagGroup : uint8
{
	Standard                       = 0,
	Quest                          = 1,
	Ammo                           = 2,
	EVAL_MAX                       = 3,
};

enum class EVillagerMarkerStatus : uint8
{
	None                           = 0,
	ImportantDialogue              = 1,
	TrackedDialogue                = 2,
	DailyChatDialogue              = 6,
	AvailableQuest                 = 10,
	CompletableQuest               = 11,
	EVillagerMarkerStatus_MAX      = 12,
};

enum class EVillagerVisitOccurrence : uint8
{
	OneTime                        = 0,
	Repeatable                     = 1,
	EVillagerVisitOccurrence_MAX   = 2,
};

enum class ECompassDisplaySettings : uint8
{
	DisableCompass                 = 0,
	HideFarOffTrackers             = 1,
	HideDistance                   = 2,
	ECompassDisplaySettings_MAX    = 3,
};

enum class ECooldownTimerType : uint8
{
	Explicit                       = 0,
	RealWorldDay                   = 1,
	PalianDay                      = 2,
	ECooldownTimerType_MAX         = 3,
};

enum class ES6UnstuckType : uint8
{
	NONE                           = 0,
	CLIENT_CALL                    = 1,
	KILL_Z                         = 2,
	OUT_OF_BOUNDS                  = 3,
	CONSOLE_CALL                   = 4,
	UNEXPECTED_SPEED               = 5,
	ES6UnstuckType_MAX             = 6,
};

enum class EPersistAnchorType : uint8
{
	None                           = 0,
	Spawner                        = 1,
	PlacementRegion                = 2,
	EPersistAnchorType_MAX         = 3,
};

enum class EItemToPlaceSource : uint8
{
	None                           = 0,
	FromInventory                  = 1,
	FromHouseInventory             = 2,
	FromStorage                    = 3,
	MoveExistingStructure          = 4,
	EItemToPlaceSource_MAX         = 5,
};

enum class EItemPlacementState : uint8
{
	NotPlacing                     = 0,
	SingleStage                    = 1,
	FenceOriginStage               = 2,
	FenceExtentStage               = 3,
	EItemPlacementState_MAX        = 4,
};

enum class EPlayerCompassMultipleSameTargetResolution : uint8
{
	None                           = 0,
	ShowOneClosest                 = 1,
	EPlayerCompassMultipleSameTargetResolution_MAX = 2,
};

enum class EPlayerMapLayer : uint8
{
	None                           = 0,
	DebugSpawning                  = 1,
	EPlayerMapLayer_MAX            = 2,
};

enum class EPrivateSpaceCharacterState : uint8
{
	None                           = 0,
	RequestingLoad                 = 1,
	InPrivateSpace                 = 2,
	RequestingUnload               = 3,
	EPrivateSpaceCharacterState_MAX = 4,
};

enum class EVAL_QuestShowGoalCount : uint8
{
	Default                        = 0,
	ForceShowCount                 = 1,
	ForceHideCount                 = 2,
	EVAL_MAX                       = 3,
};

enum class EQuestRewardSourceType : uint8
{
	Unspecified                    = 0,
	Crafted                        = 1,
	Gathered                       = 2,
	Consumption                    = 3,
	Quest                          = 4,
	Dialogue                       = 5,
	Gift                           = 6,
	Mail                           = 7,
	Purchase                       = 8,
	Cheat                          = 9,
	Book                           = 10,
	Bundle                         = 11,
	Challenge                      = 12,
	Garden                         = 13,
	Subgame                        = 14,
	ItemPickup                     = 15,
	DataCorrection                 = 16,
	EQuestRewardSourceType_MAX     = 17,
};

enum class ERecipeInteractionMode : uint8
{
	Wait                           = 0,
	Minigame                       = 1,
	ERecipeInteractionMode_MAX     = 2,
};

enum class ERecipePropPhase : uint8
{
	Start                          = 0,
	Cooking                        = 1,
	Burned                         = 2,
	Cooked                         = 3,
	CookedStale                    = 4,
	Num                            = 5,
	INVALID                        = 255,
	ERecipePropPhase_MAX           = 256,
};

enum class ERecipeAvailability : uint8
{
	Not                            = 0,
	Restricted                     = 1,
	Available                      = 2,
	Recommended                    = 3,
	ERecipeAvailability_MAX        = 4,
};

enum class ERecipePhaseRequirement : uint8
{
	ToStart                        = 0,
	AddDuring                      = 1,
	ToCraft                        = 2,
	ERecipePhaseRequirement_MAX    = 3,
};

enum class ERecipeLearnedFromType : uint8
{
	Unspecified                    = 0,
	PurchasedAtVillagerStore       = 1,
	Cheats                         = 2,
	QuestReward                    = 3,
	Inspiration                    = 4,
	LevelUp                        = 5,
	ERecipeLearnedFromType_MAX     = 6,
};

enum class EShaderBasedAnimPlaybackCycle : uint8
{
	Looping                        = 0,
	Once                           = 1,
	Clamp                          = 2,
	PingPong                       = 3,
	EShaderBasedAnimPlaybackCycle_MAX = 4,
};

enum class EShaderBasedAnimPlaybackLayer : uint8
{
	Normal                         = 0,
	OneOff                         = 10,
	EShaderBasedAnimPlaybackLayer_MAX = 11,
};

enum class ESpawnerMode : uint8
{
	Radius                         = 0,
	SpawnPoints                    = 1,
	SpawnOnFoliage                 = 2,
	AttachedToOtherActor           = 3,
	ESpawnerMode_MAX               = 4,
};

enum class ESpawnerKind : uint8
{
	Weighted                       = 0,
	FixedAmount                    = 1,
	ESpawnerKind_MAX               = 2,
};

enum class ESecondaryActorToSpawnMethod : uint8
{
	Never                          = 0,
	AfterPrimaryActorDestroyed     = 1,
	SpawnsWithPrimaryActor_Deprecated = 2,
	ESecondaryActorToSpawnMethod_MAX = 3,
};

enum class EWhereToSpawnActors : uint8
{
	AtSpawnPoints                  = 0,
	AtSpawnPointsButDontOccupy     = 1,
	OnNavMeshWithinRadius          = 2,
	EWhereToSpawnActors_MAX        = 3,
};

enum class EResourceSpawnedReason : uint8
{
	Unknown                        = 0,
	Spawner                        = 1,
	AfterActorDestroyed            = 2,
	AroundAoe                      = 3,
	EResourceSpawnedReason_MAX     = 4,
};

enum class ESpawnOnFoliageStatus : uint8
{
	NotLoaded                      = 0,
	Loading                        = 1,
	Loaded                         = 2,
	ESpawnOnFoliageStatus_MAX      = 3,
};

enum class EStorageUsageDisplayType : uint8
{
	NotSpecified                   = 0,
	StorageUsed                    = 1,
	StorageFree                    = 2,
	StorageCapacity                = 3,
	StorageMaxCapacity             = 4,
	EStorageUsageDisplayType_MAX   = 5,
};

enum class ESlidingPuzzleCardinalDirections : uint8
{
	North                          = 0,
	South                          = 1,
	East                           = 2,
	West                           = 3,
	Invalid                        = 4,
	ESlidingPuzzleCardinalDirections_MAX = 5,
};

enum class ESlidingPuzzleOpenPieceSlot : uint8
{
	BottomRight                    = 0,
	TopRight                       = 1,
	TopLeft                        = 2,
	BottomLeft                     = 3,
	ESlidingPuzzleOpenPieceSlot_MAX = 4,
};

enum class EArcadeCommandType : uint8
{
	None                           = 0,
	LockMachine                    = 1,
	UnlockMachine                  = 2,
	AddLeaderboardScore            = 3,
	GetLeaderboardScores           = 4,
	AddReplayFrame                 = 5,
	EArcadeCommandType_MAX         = 6,
};

enum class EMontageEventResult : uint8
{
	Completed                      = 0,
	OnBlendOut                     = 1,
	OnInterrupted                  = 2,
	OnCancelled                    = 3,
	EMontageEventResult_MAX        = 4,
};

enum class ECrossMapTracking : uint8
{
	None                           = 0,
	Villager                       = 1,
	QuestLocation                  = 2,
	Visit                          = 3,
	All                            = 255,
	ECrossMapTracking_MAX          = 256,
};

enum class ETimeOfDayAudioBehavior : uint8
{
	AtActorLocation                = 0,
	RandomLocation                 = 1,
	SpecificDirection              = 2,
	DoNothing                      = 3,
	ETimeOfDayAudioBehavior_MAX    = 4,
};

enum class EPlayerTrackingOn : uint8
{
	None                           = 0,
	Compass                        = 1,
	WorldMap                       = 2,
	All                            = 255,
	EPlayerTrackingOn_MAX          = 256,
};

enum class EValeriaMoveSimulationFlag : uint8
{
	NO_FLAGS                       = 0,
	VALID_Position                 = 1,
	VALID_Rotation                 = 2,
	VALID_PositionAndRotation      = 3,
	SIM_Direct                     = 4,
	SIM_FaceVelocity               = 8,
	CONTROL_ServerAuthority        = 16,
	EValeriaMoveSimulationFlag_MAX = 17,
};

enum class EVAL_PermanentUnlockVerifyResult : uint8
{
	NoActionNecessary              = 0,
	UnableToVerify                 = 1,
	UnlockFound                    = 2,
	UnlockMissing_Rewarded         = 3,
	UnlockMissing_FailedToReward   = 4,
	EVAL_MAX                       = 5,
};

enum class EEmoteTargetType : uint8
{
	Invalid                        = 0,
	Player                         = 1,
	NPC                            = 2,
	Creatures                      = 3,
	EEmoteTargetType_MAX           = 4,
};

enum class EValeriaErrorMsgId : uint8
{
	None                           = 0,
	GenericDisconnect              = 1,
	InactivityDisconnect           = 2,
	EValeriaErrorMsgId_MAX         = 3,
};

enum class EVAL_GameSessionFlags : uint8
{
	None                           = 0,
	MarkedServerOnline             = 1,
	EmptyPlayers                   = 2,
	AgonesReserveQueued            = 4,
	AgonesAllocated                = 8,
	EVAL_MAX                       = 9,
};

enum class EValeriaGASAbilityInputID : uint8
{
	INVALID                        = 0,
	LMBPress                       = 50,
	RMBPress                       = 51,
	Spacebar                       = 100,
	AdditionalAbility1             = 201,
	AdditionalAbility2             = 202,
	AdditionalAbility3             = 203,
	AdditionalAbility4             = 204,
	AdditionalAbility5             = 205,
	ValeriaGASAbilityInputID_MAX   = 206,
};

enum class EValeriaGASAbilityInput : uint8
{
	GASUseActiveAbility1           = 0,
	GASUseActiveAbility2           = 1,
	GASUseActiveAbility3           = 2,
	GASUseActiveAbility4           = 3,
	ValeriaGASAbilityInput_MAX     = 4,
};

enum class EValeriaReplicationPolicy : uint8
{
	NotRouted                      = 0,
	AlwaysRelevant                 = 1,
	AlwaysRelevantToConnection     = 2,
	Grid_Static                    = 3,
	Grid_Dynamic                   = 4,
	Grid_Dormant                   = 5,
	HousingPlot                    = 6,
	ImportantActors                = 7,
	GameplayDebugger               = 8,
	EValeriaReplicationPolicy_MAX  = 9,
};

enum class ESpatialVolumeType : uint8
{
	Room                           = 0,
	Ambience                       = 1,
	Reverb                         = 2,
	ReverbOverride                 = 3,
	Trigger                        = 4,
	ESpatialVolumeType_MAX         = 5,
};

enum class ESpatialVolumePriority : uint8
{
	Global                         = 0,
	ExteriorLow                    = 1,
	ExteriorHi                     = 2,
	InteriorLow                    = 3,
	InteriorMed                    = 4,
	InteriorHi                     = 5,
	SpecialLow                     = 6,
	SpecialMed                     = 7,
	SpecialHi                      = 8,
	Custom                         = 9,
	ESpatialVolumePriority_MAX     = 10,
};

enum class EVillagerState : uint8
{
	Activities                     = 0,
	Visiting                       = 1,
	PrivateSpace                   = 2,
	EVillagerState_MAX             = 3,
};

enum class EVAL_ApplyCustomizationToActorState : uint8
{
	Idle                           = 0,
	PlayTransition                 = 1,
	LoadPrimaryAssets              = 2,
	LoadSecondaryAssets            = 3,
	ApplyCustomizations            = 4,
	EVAL_MAX                       = 5,
};

enum class EVAL_ApplyCustomizationToActorOutcome : uint8
{
	Completed                      = 0,
	Failed                         = 1,
	Interrupted                    = 2,
	Stubbed                        = 3,
	EVAL_MAX                       = 4,
};

enum class EVAL_CharacterCustomizationHideSlotFlags : uint8
{
	Invalid                        = 0,
	Hair                           = 1,
	Head                           = 2,
	Torso                          = 3,
	Legs                           = 4,
	Hat                            = 5,
	FaceMask                       = 6,
	FacialHair                     = 7,
	FaceTattoo                     = 8,
	BodyTattoo                     = 9,
	Makeup                         = 10,
	FaceComplexion                 = 11,
	BodyComplexion                 = 12,
	Glider                         = 13,
	Pet                            = 14,
	EVAL_MAX                       = 15,
};

enum class EVAL_CharacterCustomization_CosmeticTagType : uint8
{
	None                           = 0,
	Set                            = 1,
	Brand                          = 2,
	Style                          = 3,
	PerformanceComplexity          = 4,
	EVAL_CharacterCustomization_MAX = 5,
};

enum class EVAL_CharacterCustomization_MeshType : uint8
{
	None                           = 0,
	Hair                           = 1,
	Head                           = 2,
	Torso                          = 3,
	Legs                           = 4,
	Hat                            = 5,
	FaceMask                       = 6,
	FacialHair                     = 7,
	EVAL_CharacterCustomization_MAX = 8,
};

enum class EVAL_CharacterCustomizationItemType : uint8
{
	Normal                         = 0,
	Premium                        = 1,
	EVAL_MAX                       = 2,
};

enum class EVAL_VariantOption_UIDisplayType : uint8
{
	Icon                           = 0,
	Color                          = 1,
	ManualColor                    = 2,
	EVAL_VariantOption_MAX         = 3,
};

enum class EVAL_DirectMessageResult : uint8
{
	Sent                           = 0,
	MiscFail                       = 1,
	SendMessageToYourself          = 2,
	CouldNotFindCharacterWithName  = 3,
	CharacterOffline               = 4,
	NotFriends                     = 5,
	EVAL_MAX                       = 6,
};

enum class EVAL_DirectMessageState : uint8
{
	SearchCharacterByName          = 0,
	SearchPresence                 = 1,
	EVAL_MAX                       = 2,
};

enum class EVAL_CollectionsTabState : uint8
{
	Emotes                         = 0,
	Pets                           = 1,
	EVAL_MAX                       = 2,
};

enum class EDialogueTypeCategory : uint8
{
	Generic                        = 0,
	NonChat                        = 1,
	EDialogueTypeCategory_MAX      = 2,
};

enum class EVAL_EntitlementStatus : uint8
{
	Success                        = 0,
	Failure                        = 1,
	EVAL_MAX                       = 2,
};

enum class EVAL_CharacterCustomizationMode : uint8
{
	CharacterCreation              = 0,
	Wardrobe                       = 1,
	EVAL_MAX                       = 2,
};

enum class EVAL_OpenStoreContext : uint8
{
	Wardrobe                       = 0,
	Menu                           = 1,
	InteractableComponent          = 2,
	EVAL_MAX                       = 3,
};

enum class EVAL_GameplayMenuMode : uint8
{
	NotSpecified                   = 0,
	Cheats                         = 1,
	Currencies                     = 2,
	Map                            = 3,
	Quests                         = 4,
	Recipes                        = 5,
	Relationships                  = 6,
	Skills                         = 7,
	Guidebook                      = 8,
	Inventory                      = 9,
	Guild                          = 10,
	Store                          = 11,
	PlayerGuild                    = 12,
	Accomplishments                = 13,
	Emotes                         = 14,
	Events                         = 15,
	NewsInbox                      = 16,
	EVAL_MAX                       = 17,
};

enum class EVAL_DirectXVersion : uint8
{
	DirectXVersion12               = 0,
	DirectXVersion11               = 1,
	Unknown                        = 2,
	EVAL_MAX                       = 3,
};

enum class EVAL_TextComparisonLevel : uint8
{
	Default                        = 0,
	Primary                        = 1,
	Secondary                      = 2,
	Tertiary                       = 3,
	Quaternary                     = 4,
	Quinary                        = 5,
	EVAL_MAX                       = 6,
};

enum class EVALItemType : uint8
{
	Invalid                        = 0,
	CustomizationNormal            = 1,
	CustomizationPremium           = 2,
	CurrencyPremium                = 3,
	Inventory                      = 4,
	EVALItemType_MAX               = 5,
};

enum class EVAL_NewsInboxMessageType : uint8
{
	Invalid                        = 0,
	Generic                        = 1,
	Player_Support_Progression     = 2,
	Promotion_Referral_Referrer    = 3,
	Promotion_Referral_Referred    = 4,
	Promotion_EarlyBird            = 5,
	Apology_Downtime               = 6,
	Feature_Pets                   = 7,
	EVAL_MAX                       = 8,
};

enum class EVAL_PlayerGuildQuestAction : uint8
{
	Collect                        = 0,
	EVAL_MAX                       = 1,
};

enum class EVAL_PlayerGuildQuest_SortType : uint8
{
	DateTime                       = 0,
	EVAL_PlayerGuildQuest_MAX      = 1,
};

enum class EVAL_PremiumPaymentStatus : uint8
{
	Created                        = 0,
	Failed                         = 1,
	Paid                           = 2,
	Fulfilled                      = 3,
	EVAL_MAX                       = 4,
};

enum class EVAL_ShrineReadiness : uint8
{
	CannotCommune                  = 0,
	FirstCommunionReady            = 1,
	RepeatCommunionReady           = 2,
	RepeatCommunionInsufficient    = 3,
	RepeatCommunionMaxed           = 4,
	EVAL_MAX                       = 5,
};

enum class ETimerDirection : uint8
{
	CountDown                      = 0,
	CountUp                        = 1,
	ETimerDirection_MAX            = 2,
};

enum class ETimerEventType : uint8
{
	Start                          = 0,
	Stop                           = 1,
	Pause                          = 2,
	Unpause                        = 3,
	TimeElapsed                    = 4,
	TimeRemaining                  = 5,
	TimeElapsedInterval            = 6,
	TimeRemainingInterval          = 7,
	ETimerEventType_MAX            = 8,
};

enum class ETransitiveDecorStimulusType : uint8
{
	TimeSeconds                    = 0,
	Water                          = 1,
	Fertilizer                     = 2,
	MAX                            = 3,
};

enum class EVAL_TravelLoadingScreenStateRequesterState : uint8
{
	Idle                           = 0,
	AwaitingPreloadMapStart        = 1,
	LoadingMap                     = 2,
	WaitingForPawn                 = 3,
	WaitingForCharacterTeleport    = 4,
	WaitingForAsyncLoading         = 5,
	EVAL_MAX                       = 6,
};

enum class EVillagerDialogueIcon : uint8
{
	None                           = 0,
	Chat                           = 1,
	QuestBegin                     = 2,
	QuestHint                      = 3,
	QuestTurnIn                    = 4,
	GiftHint                       = 5,
	Flirt                          = 6,
	FirePersonalityIcon            = 7,
	WaterPersonalityIcon           = 8,
	EarthPersonalityIcon           = 9,
	AirPersonalityIcon             = 10,
	BasicResponse                  = 11,
	QuestComplete                  = 12,
	ImportantDialogue              = 13,
	EVillagerDialogueIcon_MAX      = 14,
};

enum class EGiftPredictedResponse : uint8
{
	Unknown                        = 0,
	CantGift                       = 1,
	Love                           = 2,
	Like                           = 3,
	NoItem                         = 4,
	EGiftPredictedResponse_MAX     = 5,
};

enum class EVillagerQuestCompleteResult : uint8
{
	Failure                        = 0,
	MovedToNextStep                = 1,
	Success                        = 2,
	EVillagerQuestCompleteResult_MAX = 3,
};

enum class EStoreTab : uint8
{
	Undefined                      = 0,
	Recipes                        = 1,
	Items                          = 2,
	EStoreTab_MAX                  = 3,
};

enum class EVitalRelevance : uint8
{
	All                            = 0,
	PlayerOnly                     = 1,
	SpecifiedOnly                  = 2,
	EVitalRelevance_MAX            = 3,
};

enum class EVAL_WaterFillType : uint8
{
	Empty                          = 0,
	Partial                        = 1,
	Full                           = 2,
	EVAL_MAX                       = 3,
};


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xD8 (0xD8 - 0x0)
// ScriptStruct Palia.VAL_RenderStudioLevelData
struct FVAL_RenderStudioLevelData
{
public:
	TSoftObjectPtr<class UWorld>                 MainLevel;                                         // 0x0(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelStreamingDynamic*                StreamingMainLevel;                                // 0x30(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UWorld>> SubLevels;                                         // 0x38(0x50)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, class ULevelStreamingDynamic*> StreamingSubLevels;                                // 0x88(0x50)(Transient, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Palia.Notification
struct FNotification
{
public:
	class UTexture2D*                            Icon;                                              // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Text;                                              // 0x8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                         SoundToPlay;                                       // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENotificationSpecialType          NotificationSpecialType;                           // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldNotificationPersist;                        // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3EF4[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.VAL_AsyncMessageKickPlayer
struct FVAL_AsyncMessageKickPlayer
{
public:
	uint8                                        Pad_3EF5[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.PersistActorsToDestroyQueue_List
struct FPersistActorsToDestroyQueue_List
{
public:
	TArray<class UPersistComponent*>             Pending;                                           // 0x0(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Palia.PersistActorsToDestroyQueue
struct FPersistActorsToDestroyQueue
{
public:
	TMap<class FString, struct FPersistActorsToDestroyQueue_List> Queues;                                            // 0x0(0x50)(ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.TravelDestination
struct FTravelDestination
{
public:
	enum class ETravelDestinationType            Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3EF6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ID;                                                // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.VitalPersist
struct FVitalPersist
{
public:
	enum class EVitalPersistType                 Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3EF7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        StartAmount;                                       // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxAmount;                                         // 0x8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Partial;                                           // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AdditionalMaxAmount;                               // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.VitalsPersistBlock
struct FVitalsPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVitalPersist>                 Vitals;                                            // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        Health;                                            // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxHealth;                                         // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.VAL_GameplayConditionContextPersistEntry
struct FVAL_GameplayConditionContextPersistEntry
{
public:
	bool                                         bConditionMet;                                     // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3EF8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ConditionValue;                                    // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConditionGoal;                                     // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3EF9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                ChildIndexStack;                                   // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VAL_GameplayConditionContextPersist
struct FVAL_GameplayConditionContextPersist
{
public:
	TArray<struct FVAL_GameplayConditionContextPersistEntry> PersistEntries;                                    // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Palia.VAL_QuestGoalState
struct FVAL_QuestGoalState
{
public:
	int32                                        CurrentProgress;                                   // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        GoalAmount;                                        // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGoalMet;                                          // 0x8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsQuantityCondition;                              // 0x9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bActive;                                           // 0xA(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3EFA[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_QuestDef>          ParentQuestDef;                                    // 0x10(0x30)(Transient, RepSkip, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ParentStepIndex;                                   // 0x40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ParentGoalIndex;                                   // 0x44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               Owner;                                             // 0x48(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVAL_GameplayConditionContext*         Context;                                           // 0x50(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVAL_GameplayConditionContextPersist  PersistedConditionContext;                         // 0x58(0x10)(RepSkip, Protected, NativeAccessSpecifierProtected)
	bool                                         bIsBranchingGoal;                                  // 0x68(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3EFB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x78 (0x78 - 0x0)
// ScriptStruct Palia.VAL_QuestBranchingGoalState
struct FVAL_QuestBranchingGoalState
{
public:
	struct FVAL_QuestGoalState                   GoalState;                                         // 0x0(0x70)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	enum class EVAL_QuestBranchingGoalChoiceStatus ChoiceStatus;                                      // 0x70(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3EFC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x78 (0x78 - 0x0)
// ScriptStruct Palia.VAL_QuestStepState
struct FVAL_QuestStepState
{
public:
	int64                                        StartedAtMs;                                       // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        CompletedAtMs;                                     // 0x8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestGoalState>           GoalStates;                                        // 0x10(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestBranchingGoalState>  BranchingGoalStates;                               // 0x20(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bCanBeCompleted;                                   // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3EFD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_QuestDef>          ParentQuestDef;                                    // 0x38(0x30)(Transient, RepSkip, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                               Owner;                                             // 0x68(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        ParentStepIndex;                                   // 0x70(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3EFE[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.PersistentTagFilter
struct FPersistentTagFilter
{
public:
	struct FGameplayTag                          TagToCheck;                                        // 0x0(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinimumAcceptedValue;                              // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaximumAcceptedValue;                              // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          TagPrereq;                                         // 0x10(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TagPrereq_MinimumAcceptedValue;                    // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TagPrereq_MaximumAcceptedValue;                    // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.ItemMetaData
struct FItemMetaData
{
public:
	uint8                                        Level;                                             // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        QualityStars;                                      // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3EFF[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        WaterAmount;                                       // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SellValueOfInputs;                                 // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        TintPersistID;                                     // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F00[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Palia.ItemMetaData_UseLimit
struct FItemMetaData_UseLimit
{
public:
	int32                                        UseAmountLeft;                                     // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Palia.ValeriaItemPersist
struct FValeriaItemPersist
{
public:
	int32                                        Amount;                                            // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemPersistId;                                     // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemMetaData                         MetaData;                                          // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FItemMetaData_UseLimit                MetaDataUse;                                       // 0x18(0x4)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.ValeriaVital
struct FValeriaVital
{
public:
	enum class EVitalType                        VitalType;                                         // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F01[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        VitalAmount;                                       // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.HousingSlotGrant
struct FHousingSlotGrant
{
public:
	enum class EHousingSlotType                  Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F02[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.QuestCurrencyRewardPersist
struct FQuestCurrencyRewardPersist
{
public:
	struct FGuid                                 ConfigId;                                          // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.ItemUseChangeConfig
struct FItemUseChangeConfig
{
public:
	int32                                        UseChange;                                         // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CurrentlyEquipped;                                 // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F03[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.VillagerGiftPreferenceInfo
struct FVillagerGiftPreferenceInfo
{
public:
	struct FDataTableRowHandle                   Villager;                                          // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   GiftPreference;                                    // 0x10(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.PersistentTagWriteback
struct FPersistentTagWriteback
{
public:
	struct FGameplayTag                          TagToModify;                                       // 0x0(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmountToApply;                                     // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENumericalOperation               OperationToApply;                                  // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F04[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x110 (0x110 - 0x0)
// ScriptStruct Palia.QuestReward
struct FQuestReward
{
public:
	TArray<struct FPersistentTagFilter>          PlayerTagRequirements;                             // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FValeriaItemPersist>           Items;                                             // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         DisallowItemsGrantingAccomplishmentProgress;       // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F05[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FValeriaVital>                 Vitals;                                            // 0x28(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FQuestCurrencyRewardPersist>   Currencies;                                        // 0x38(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        RelationshipVillagerId;                            // 0x48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RelationshipVillagerCoreId;                        // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FriendshipChange;                                  // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RomanceChange;                                     // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERomanceStateChange               RomanceStateChange;                                // 0x58(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AwardRecipesAsInspiration;                         // 0x59(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F06[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                RecipeConfigIds;                                   // 0x60(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        BuffConfigId;                                      // 0x70(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESkillType                        SkillType;                                         // 0x74(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F07[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SkillAmount;                                       // 0x78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemUseChangeConfig                  ItemUseChange;                                     // 0x7C(0x8)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                        MailMessageId;                                     // 0x84(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MailMessageToDeleteIfUnreadId;                     // 0x88(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F08[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVillagerGiftPreferenceInfo           GiftPreferenceRevealed;                            // 0x90(0x20)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FPersistentTagWriteback>       PlayerTagWriteback;                                // 0xB0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         GrantBagUpgrade;                                   // 0xC0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RecalcVitals;                                      // 0xC1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F09[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   QuestToTrigger_Deprecated;                         // 0xC8(0x10)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   QuestToDelete_Deprecated;                          // 0xD8(0x10)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	float                                        LanternFuelTime;                                   // 0xE8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F0A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FHousingSlotGrant>             GrantedHousingSlots;                               // 0xF0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        QuestIdToStart;                                    // 0x100(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVAL_BoolOverride                 OverrideIsCriticalReward;                          // 0x104(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVAL_BoolOverride                 OverrideIsPermanentUnlock;                         // 0x105(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F0B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        GeneratedTimestamp;                                // 0x108(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x24 (0x24 - 0x0)
// ScriptStruct Palia.VAL_ConditionDeductionRecord
struct FVAL_ConditionDeductionRecord
{
public:
	struct FValeriaItemPersist                   ItemsDeducted;                                     // 0x0(0x1C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FValeriaVital                         VitalsDeducted;                                    // 0x1C(0x8)(NoDestructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.VAL_QuestReset_SavedVisit
struct FVAL_QuestReset_SavedVisit
{
public:
	struct FGuid                                 VisitId;                                           // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 PrivateSpaceId;                                    // 0x10(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// ScriptStruct Palia.VAL_QuestPlayerStateChangeRecord
struct FVAL_QuestPlayerStateChangeRecord
{
public:
	enum class EVAL_QuestPlayerStateChangeType   StateChangeType;                                   // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F0C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        TimestampMs;                                       // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StepIdx;                                           // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FQuestReward>                  RewardsGranted;                                    // 0x18(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVAL_ConditionDeductionRecord> Deductions;                                        // 0x28(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        PreResetVersion;                                   // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PreResetStepIdx;                                   // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVAL_QuestNeedsResetReason        ResetReason;                                       // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F0D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FQuestReward>                  DeductionsRefunded;                                // 0x48(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FQuestReward>                  RewardsReturned;                                   // 0x58(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                DialoguesReset;                                    // 0x68(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestReset_SavedVisit>    SavedVisitsReset;                                  // 0x78(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                         CompletedVisitsReset;                              // 0x88(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        DialogueViewed;                                    // 0x98(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 VisitGuid;                                         // 0x9C(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 VisitPrivateSpaceGuid;                             // 0xAC(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F0E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA0 (0xA0 - 0x0)
// ScriptStruct Palia.VAL_QuestState
struct FVAL_QuestState
{
public:
	int32                                        PersistId;                                         // 0x0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_QuestDef>          QuestDef;                                          // 0x8(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, RepSkip, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        StartedAtMs;                                       // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        CompletedAtMs;                                     // 0x40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        ExpiredAtMs;                                       // 0x48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentStepIdx;                                    // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Pinned;                                            // 0x54(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F0F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AValeriaCharacter*                     VC;                                                // 0x58(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestStepState>           StepStates;                                        // 0x60(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestPlayerStateChangeRecord> PlayerStateChanges;                                // 0x70(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	class UVAL_QuestDef*                         CachedQuestDef;                                    // 0x80(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVAL_GameplayConditionContext*         ExpirationConditionContext;                        // 0x88(0x8)(ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVAL_GameplayConditionContextPersist  PersistedExpirationConditionContext;               // 0x90(0x10)(RepSkip, NativeAccessSpecifierPrivate)
};

// 0x60 (0xA0 - 0x40)
// ScriptStruct Palia.VAL_QuestProgressPersistBlock
struct FVAL_QuestProgressPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVAL_QuestState>               ActiveQuests;                                      // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                PendingStartQuestIds;                              // 0x50(0x10)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestState>               InactiveQuests;                                    // 0x60(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestState>               QuarantinedQuests;                                 // 0x70(0x10)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	TArray<struct FVAL_QuestState>               DeletedQuests;                                     // 0x80(0x10)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	TArray<int32>                                PendingDeleteQuestIds;                             // 0x90(0x10)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.HouseOwnershipTitlePersist
struct FHouseOwnershipTitlePersist
{
public:
	struct FGuid                                 HouseId;                                           // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 OwnerId;                                           // 0x10(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHousingPermissionLevel           OwnershipLevel;                                    // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F10[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Slot;                                              // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x120 (0x160 - 0x40)
// ScriptStruct Palia.ValeriaCharacterBasePersistBlock
struct FValeriaCharacterBasePersistBlock : public FS6PersistBlock
{
public:
	class FString                                ContainerHash;                                     // 0x40(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemType;                                          // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F11[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint64                                       LastSavedAtMs;                                     // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CharacterName;                                     // 0x60(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        TimeLastLoggedOffMs;                               // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        UnstuckLastUsageTime;                              // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UnstuckCooldownSeconds;                            // 0x80(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHouseOwnershipTitlePersist           PrimaryHome;                                       // 0x84(0x28)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                        LastKnownPrimaryHousingPlotValue;                  // 0xAC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MapName;                                           // 0xB0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LastValidLocation;                                 // 0xC0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              LastValidRotation;                                 // 0xD8(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int64                                        ReturnHomeLastUsageTime;                           // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnHomeCooldownSeconds;                         // 0xF8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowEatingWhenFull;                              // 0xFC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F12[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, int32>                           CorrectionsApplied;                                // 0x100(0x50)(NativeAccessSpecifierPublic)
	int32                                        AccumulatedHarvestDaysAwayFromHousingPlot;         // 0x150(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F13[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        LastPermanentUnlockVerificationTime;               // 0x158(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.VALDATA_PremiumStoreEntitlements
struct FVALDATA_PremiumStoreEntitlements : public FS6PersistBlock
{
public:
	TArray<struct FGuid>                         EntitlementsNotSeen;                               // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.DebugInfoPersistBlock
struct FDebugInfoPersistBlock : public FS6PersistBlock
{
public:
	bool                                         bCheatsEnabled;                                    // 0x40(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreGiftTimeRestriction;                        // 0x41(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreFriendLvlReqsForDynamicGiftPrefs;           // 0x42(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreDailyDialogueLimit;                         // 0x43(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowHiddenGearTypes;                              // 0x44(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowVillagerDebugInfo;                            // 0x45(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F14[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGuid>                         GivenCheatSets;                                    // 0x48(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.VALDATA_EmotePersistBlock
struct FVALDATA_EmotePersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FGuid>                         EmoteWheelAssignments;                             // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct Palia.SkillPersist
struct FSkillPersist
{
public:
	enum class ESkillType                        SkillType;                                         // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F15[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Level;                                             // 0x4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        XpGainedThisLevel;                                 // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.SkillsPersistBlock
struct FSkillsPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FSkillPersist>                 Skills;                                            // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	enum class ESkillType                        MostRecentlyProgressedSkill;                       // 0x50(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F16[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x48 (0x48 - 0x0)
// ScriptStruct Palia.VillagerQuestPersist
struct FVillagerQuestPersist
{
public:
	int32                                        VillagerQuestConfigId;                             // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F17[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        StartedAtMs;                                       // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        CompletedAtMs;                                     // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                ActionsCompleted;                                  // 0x18(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        CurrentStep;                                       // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsCompleteable;                                    // 0x2C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F18[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                GoalProgress;                                      // 0x30(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bHasPartiallyCompleted;                            // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F19[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x60 - 0x40)
// ScriptStruct Palia.QuestProgressPersistBlock
struct FQuestProgressPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVillagerQuestPersist>         CurrentQuests;                                     // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                CompletedQuestIds;                                 // 0x50(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.ChallengeStatePersist
struct FChallengeStatePersist
{
public:
	struct FGuid                                 Guid;                                              // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                GoalsProgress;                                     // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bCompleted;                                        // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F1A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.ChallengeProgressPersistBlock
struct FChallengeProgressPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FChallengeStatePersist>        Entries;                                           // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int64                                        ExpirationTimestamp;                               // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.VillagerRelationship
struct FVillagerRelationship
{
public:
	int32                                        VillagerCoreId;                                    // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FriendshipValue;                                   // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RomanceValue;                                      // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERomanceState                     RomanceState;                                      // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         HasMetBefore;                                      // 0xD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F1B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        HighestFriendshipLevelReached;                     // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HighestRomanceLevelReached;                        // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.VillagerRelationshipsPersistBlock
struct FVillagerRelationshipsPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVillagerRelationship>         Entries;                                           // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct Palia.TagEntry
struct FTagEntry
{
public:
	struct FGameplayTag                          Tag;                                               // 0x0(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x60 - 0x40)
// ScriptStruct Palia.TagMapPersistBlock
struct FTagMapPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FTagEntry>                     Entries;                                           // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTagEntry>                     CachedPlaceableEntries;                            // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.VillagerMailMessage
struct FVillagerMailMessage
{
public:
	int32                                        PersistId;                                         // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F1C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        TimestampSentAt;                                   // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                RewardIndicesCollected;                            // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VillagerMailInbox
struct FVillagerMailInbox
{
public:
	TArray<struct FVillagerMailMessage>          Messages;                                          // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x60 - 0x40)
// ScriptStruct Palia.MailInboxPersistBlock
struct FMailInboxPersistBlock : public FS6PersistBlock
{
public:
	struct FVillagerMailInbox                    CurrentInbox;                                      // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVillagerMailInbox                    ArchivedInbox;                                     // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.CraftingHistoryEntry
struct FCraftingHistoryEntry
{
public:
	int32                                        RecipeConfigId;                                    // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumberOfTimesCrafted;                              // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.CraftingHistoryPersistBlock
struct FCraftingHistoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FCraftingHistoryEntry>         RecipesCrafted;                                    // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        MostRecentlyCraftedRecipeId;                       // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F1D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x60 - 0x40)
// ScriptStruct Palia.RecipeInventoryPersistBlock
struct FRecipeInventoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<int32>                                RecipesAvailable;                                  // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                UnusedInspirationRecipeIDs;                        // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.VillagerGiftHistoryPersist
struct FVillagerGiftHistoryPersist
{
public:
	int32                                        VillagerCoreId;                                    // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemPersistId;                                     // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        LastGiftedMs;                                      // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AssociatedPreferenceVersion;                       // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F1E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.GiftHistoryPersistBlock
struct FGiftHistoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVillagerGiftHistoryPersist>   History;                                           // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.DialogueHistoryEntry
struct FDialogueHistoryEntry
{
public:
	int64                                        TimestampMs;                                       // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DialogueConfigId;                                  // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DialogueRepetitionNumber;                          // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.DialogueHistoryPersistBlock
struct FDialogueHistoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FDialogueHistoryEntry>         Entries;                                           // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.VillagerGiftPreferences
struct FVillagerGiftPreferences
{
public:
	enum class EVillagerGiftRewardLevel          RewardLevel;                                       // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F1F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                KnownGiftPreferences;                              // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.TrackedGiftPreferences
struct FTrackedGiftPreferences
{
public:
	int32                                        VillagerCoreId;                                    // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F20[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVillagerGiftPreferences>      PreferencesForLevel;                               // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.GiftPreferencesPersistBlock
struct FGiftPreferencesPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FTrackedGiftPreferences>       Preferences;                                       // 0x40(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        Version;                                           // 0x50(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F21[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x60 - 0x40)
// ScriptStruct Palia.StoragePersistBlock
struct FStoragePersistBlock : public FS6PersistBlock
{
public:
	enum class EStoragePoolType                  StoragePoolType;                                   // 0x40(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F22[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FValeriaItemPersist>           Items;                                             // 0x48(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ItemCapacity;                                      // 0x58(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemMax;                                           // 0x5C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.GearSlotMetadata
struct FGearSlotMetadata
{
public:
	int32                                        SlotTypePersistId;                                 // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SlotIndex;                                         // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        UnequipExpirationTimestamp;                        // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x70 - 0x40)
// ScriptStruct Palia.GearPersistBlock
struct FGearPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FValeriaItemPersist>           Items;                                             // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGearSlotMetadata>             EquippedGearSlots;                                 // 0x50(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGearSlotMetadata>             UnequippedGearSlots;                               // 0x60(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.ReadBookData
struct FReadBookData
{
public:
	int32                                        bookConfigId;                                      // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HighestPageRead;                                   // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.BookReadingPersistBlock
struct FBookReadingPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FReadBookData>                 ReadBooks;                                         // 0x40(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Palia.BuffPersist
struct FBuffPersist
{
public:
	struct FGuid                                 AppliedByPlayer;                                   // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BuffConfigId;                                      // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F23[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        TimeStart;                                         // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        TimeEnd;                                           // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Instance;                                          // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Stacks;                                            // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.BuffPersistBlock
struct FBuffPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FBuffPersist>                  Buffs;                                             // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        NextInstanceId;                                    // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F24[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.SavedVillagerVisit
struct FSavedVillagerVisit
{
public:
	struct FGuid                                 Guid;                                              // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VisitStartRequirementsCompletedTimeSeconds;        // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Priority;                                          // 0x14(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDelayedVisit;                                     // 0x18(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F25[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DelayedVisitGameHours;                             // 0x1C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.SavedVillagerVisitArray
struct FSavedVillagerVisitArray
{
public:
	TArray<struct FSavedVillagerVisit>           Visits;                                            // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x70 (0xB0 - 0x40)
// ScriptStruct Palia.VillagerVisitsPersistBlock
struct FVillagerVisitsPersistBlock : public FS6PersistBlock
{
public:
	struct FSavedVillagerVisitArray              SavedHousingVillagerVisits;                        // 0x40(0x10)(NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FSavedVillagerVisitArray> SavedPrivateSpaceVillagerVisits;                   // 0x50(0x50)(NativeAccessSpecifierPublic)
	TArray<struct FGuid>                         CompletedVisits;                                   // 0xA0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.BagSlotLocation
struct FBagSlotLocation
{
public:
	int32                                        BagIndex;                                          // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SlotIndex;                                         // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.ProjectileFiringPersistBlock
struct FProjectileFiringPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FBagSlotLocation>              EquippedAmmoSlots;                                 // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.FishingPersistBlock
struct FFishingPersistBlock : public FS6PersistBlock
{
public:
	TArray<int32>                                CaughtFishesIds;                                   // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        EquippedBaitId;                                    // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F26[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.ItemTrackingEntryPersist
struct FItemTrackingEntryPersist
{
public:
	int32                                        ItemPersistId;                                     // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumberOfTimesPurchased;                            // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.ItemTrackingPersistBlock
struct FItemTrackingPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FItemTrackingEntryPersist>     Entries;                                           // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.HouseInventoryItemPersist
struct FHouseInventoryItemPersist
{
public:
	int32                                        ItemPersistId;                                     // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Level;                                             // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.HouseInventoryPersistBlock
struct FHouseInventoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FHouseInventoryItemPersist>    Houses;                                            // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.WarpStonePersist
struct FWarpStonePersist
{
public:
	struct FGuid                                 WarpStoneId;                                       // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                FlowSpriteIds;                                     // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.WarpStonePersistBlock
struct FWarpStonePersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FWarpStonePersist>             WarpStones;                                        // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        NextUseTime;                                       // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F27[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.WorldPersistGatherableData
struct FWorldPersistGatherableData
{
public:
	int32                                        NumTimesGathered;                                  // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F28[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        GatheredTime;                                      // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.TimedLootPileData
struct FTimedLootPileData
{
public:
	int32                                        NumTimesGathered;                                  // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F29[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        GatheredTime;                                      // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                          GatheredObjectsThisCycle;                          // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xA0 (0xE0 - 0x40)
// ScriptStruct Palia.PlayerWorldStatePersistBlock
struct FPlayerWorldStatePersistBlock : public FS6PersistBlock
{
public:
	TMap<struct FGameplayTag, struct FWorldPersistGatherableData> WorldPersistGatherableDatas;                       // 0x40(0x50)(NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FTimedLootPileData> TimedLootPileDatas;                                // 0x90(0x50)(NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.InventoryBagPersist
struct FInventoryBagPersist
{
public:
	int32                                        ItemPersistId;                                     // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F2A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FValeriaItemPersist>           Slots;                                             // 0x8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x58 - 0x40)
// ScriptStruct Palia.InventoryPersistBlock
struct FInventoryPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FInventoryBagPersist>          Bags;                                              // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ItemsCollected;                                    // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F2B[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.CurrencyBagPersist
struct FCurrencyBagPersist
{
public:
	int32                                        Amount;                                            // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 PersistGuid;                                       // 0x4(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x68 - 0x58)
// ScriptStruct Palia.PlayerInventoryPersistBlock
struct FPlayerInventoryPersistBlock : public FInventoryPersistBlock
{
public:
	TArray<struct FCurrencyBagPersist>           Currencies;                                        // 0x58(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct Palia.SubBundleReqsData
struct FSubBundleReqsData
{
public:
	int32                                        RequirementConfigId;                               // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentValue;                                      // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCompleted;                                        // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F2C[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.SubBundleData
struct FSubBundleData
{
public:
	int32                                        SubBundleConfigId;                                 // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F2D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSubBundleReqsData>            SubBundleReqs;                                     // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bMiniRewardsGranted;                               // 0x18(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F2E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.BundleData
struct FBundleData
{
public:
	int32                                        BundleConfigId;                                    // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F2F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSubBundleData>                SubBundles;                                        // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bBundleRewardsGranted;                             // 0x18(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F30[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.BundlePersistBlock
struct FBundlePersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FBundleData>                   Bundles;                                           // 0x40(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.VALDATA_PlayerGuildQuestPersist
struct FVALDATA_PlayerGuildQuestPersist
{
public:
	bool                                         bIsPinned;                                         // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F31[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 PersistGuid;                                       // 0x4(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x50 - 0x40)
// ScriptStruct Palia.VALDATA_PlayerGuildQuestPersistBlock
struct FVALDATA_PlayerGuildQuestPersistBlock : public FS6PersistBlock
{
public:
	TArray<struct FVALDATA_PlayerGuildQuestPersist> GuildQuests;                                       // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x90 - 0x40)
// ScriptStruct Palia.ScorePersistBlock
struct FScorePersistBlock : public FS6PersistBlock
{
public:
	TMap<int32, int32>                           BestScores;                                        // 0x40(0x50)(NativeAccessSpecifierPublic)
};

// 0x0 (0x40 - 0x40)
// ScriptStruct Palia.GardeningWeedingPersistBlock
struct FGardeningWeedingPersistBlock : public FS6PersistBlock
{
public:
};

// 0x0 (0x40 - 0x40)
// ScriptStruct Palia.SleepingPersistBlock
struct FSleepingPersistBlock : public FS6PersistBlock
{
public:
};

// 0xD90 (0xDA8 - 0x18)
// ScriptStruct Palia.CharacterPersistContainer
struct FCharacterPersistContainer : public FS6PersistContainer
{
public:
	struct FValeriaCharacterBasePersistBlock     BaseCharacter;                                     // 0x18(0x160)(NativeAccessSpecifierPublic)
	struct FVitalsPersistBlock                   Vitals;                                            // 0x178(0x58)(NativeAccessSpecifierPublic)
	struct FVALDATA_PremiumStoreEntitlements     PremiumStoreEntitlements;                          // 0x1D0(0x50)(NativeAccessSpecifierPublic)
	struct FVALDATA_EmotePersistBlock            EmoteWheelAssignments;                             // 0x220(0x50)(NativeAccessSpecifierPublic)
	struct FSkillsPersistBlock                   Skills;                                            // 0x270(0x58)(NativeAccessSpecifierPublic)
	struct FQuestProgressPersistBlock            QuestProgress;                                     // 0x2C8(0x60)(NativeAccessSpecifierPublic)
	struct FVAL_QuestProgressPersistBlock        Quests;                                            // 0x328(0xA0)(NativeAccessSpecifierPublic)
	struct FChallengeProgressPersistBlock        ChallengeProgress;                                 // 0x3C8(0x58)(NativeAccessSpecifierPublic)
	struct FVillagerRelationshipsPersistBlock    VillagerRelationships;                             // 0x420(0x50)(NativeAccessSpecifierPublic)
	struct FTagMapPersistBlock                   TagMap;                                            // 0x470(0x60)(NativeAccessSpecifierPublic)
	struct FMailInboxPersistBlock                MailInbox;                                         // 0x4D0(0x60)(NativeAccessSpecifierPublic)
	struct FCraftingHistoryPersistBlock          CraftingHistory;                                   // 0x530(0x58)(NativeAccessSpecifierPublic)
	struct FRecipeInventoryPersistBlock          RecipeInventory;                                   // 0x588(0x60)(NativeAccessSpecifierPublic)
	struct FGiftHistoryPersistBlock              GiftHistory;                                       // 0x5E8(0x50)(NativeAccessSpecifierPublic)
	struct FDialogueHistoryPersistBlock          DialogueHistory;                                   // 0x638(0x50)(NativeAccessSpecifierPublic)
	struct FGiftPreferencesPersistBlock          GiftPreferences;                                   // 0x688(0x58)(NativeAccessSpecifierPublic)
	TArray<struct FStoragePersistBlock>          Storage;                                           // 0x6E0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGearPersistBlock                     Gear;                                              // 0x6F0(0x70)(NativeAccessSpecifierPublic)
	struct FDebugInfoPersistBlock                DebugInfo;                                         // 0x760(0x58)(NativeAccessSpecifierPublic)
	struct FBookReadingPersistBlock              BookReading;                                       // 0x7B8(0x50)(NativeAccessSpecifierPublic)
	struct FBuffPersistBlock                     Buffs;                                             // 0x808(0x58)(NativeAccessSpecifierPublic)
	struct FVillagerVisitsPersistBlock           VillagerVisits;                                    // 0x860(0xB0)(NativeAccessSpecifierPublic)
	struct FProjectileFiringPersistBlock         ProjectileFiring;                                  // 0x910(0x50)(NativeAccessSpecifierPublic)
	struct FFishingPersistBlock                  Fishing;                                           // 0x960(0x58)(NativeAccessSpecifierPublic)
	struct FItemTrackingPersistBlock             ItemTracking;                                      // 0x9B8(0x50)(NativeAccessSpecifierPublic)
	struct FHouseInventoryPersistBlock           HouseInventory;                                    // 0xA08(0x50)(NativeAccessSpecifierPublic)
	struct FWarpStonePersistBlock                WarpStone;                                         // 0xA58(0x58)(NativeAccessSpecifierPublic)
	struct FPlayerWorldStatePersistBlock         PlayerWorldState;                                  // 0xAB0(0xE0)(NativeAccessSpecifierPublic)
	struct FPlayerInventoryPersistBlock          PlayerInventory;                                   // 0xB90(0x68)(NativeAccessSpecifierPublic)
	struct FBundlePersistBlock                   Bundles;                                           // 0xBF8(0x50)(NativeAccessSpecifierPublic)
	struct FVALDATA_PlayerGuildQuestPersistBlock PlayerGuildQuests;                                 // 0xC48(0x50)(NativeAccessSpecifierPublic)
	struct FScorePersistBlock                    PlayerScores;                                      // 0xC98(0x90)(NativeAccessSpecifierPublic)
	struct FGardeningWeedingPersistBlock         DELETED_GardeningWeeding;                          // 0xD28(0x40)(NativeAccessSpecifierPublic)
	struct FSleepingPersistBlock                 DELETED_SleepBlock;                                // 0xD68(0x40)(NativeAccessSpecifierPublic)
};

// 0x14F8 (0x14F8 - 0x0)
// ScriptStruct Palia.CharacterLoadingData
struct FCharacterLoadingData
{
public:
	struct FCharacterPersistContainer            CharacterContainer;                                // 0x0(0xDA8)(NativeAccessSpecifierPublic)
	struct FVALDTOS_MetaCharacterFormat          MetaCharacterData;                                 // 0xDA8(0x718)(NativeAccessSpecifierPublic)
	struct FGuid                                 CharacterId;                                       // 0x14C0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 LoadoutId;                                         // 0x14D0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMetaDataLoaded;                                   // 0x14E0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bContainerDataLoaded;                              // 0x14E1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCharacterContainerDataExists;                     // 0x14E2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasPendingHouseLoad;                              // 0x14E3(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 HouseGuid;                                         // 0x14E4(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F32[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1510 (0x1510 - 0x0)
// ScriptStruct Palia.PlayerLoadingData
struct FPlayerLoadingData
{
public:
	bool                                         IsLoaded;                                          // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F33[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APlayerController*                     PlayerController;                                  // 0x8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterLoadingData                 CharacterData;                                     // 0x10(0x14F8)(NativeAccessSpecifierPublic)
	bool                                         ReadyForInitialTeleport;                           // 0x1508(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F34[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.PersistBlobId
struct FPersistBlobId
{
public:
	struct FGuid                                 BlobGuid;                                          // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BlobType;                                          // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F35[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x24 (0x24 - 0x0)
// ScriptStruct Palia.PersistActorId
struct FPersistActorId
{
public:
	struct FGuid                                 HashId;                                            // 0x0(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPersistBlobId                        BlobId;                                            // 0x10(0x14)(NoDestructor, NativeAccessSpecifierPrivate)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Palia.PendingHousingPersistActorsQueue
struct FPendingHousingPersistActorsQueue
{
public:
	class AHousingOwnershipActor*                House;                                             // 0x0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPersistActorId>               LoadQueue;                                         // 0x8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F36[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AValeriaCharacter*                     LoadInstigator;                                    // 0x28(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Palia.ValeriaItem
struct FValeriaItem
{
public:
	int32                                        Amount;                                            // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F37[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x8(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemMetaData                         MetaData;                                          // 0x38(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FItemMetaData_UseLimit                MetaDataUse;                                       // 0x48(0x4)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F38[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Palia.DebugCheatPlaceItems
struct FDebugCheatPlaceItems
{
public:
	struct FValeriaItem                          ItemToPlace;                                       // 0x0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UPlacementRegionComponent*             Region;                                            // 0x50(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               SpawnLocationInRegion;                             // 0x58(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Palia.DebugCheatActorSpawn
struct FDebugCheatActorSpawn
{
public:
	TSubclassOf<class AActor>                    SpawnActorClass;                                   // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F39[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            SpawnActorTransform;                               // 0x10(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x908 (0x908 - 0x0)
// ScriptStruct Palia.DebugCheat
struct FDebugCheat
{
public:
	int32                                        TimeWarpMinutes;                                   // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TimeWarpToDayZero;                                 // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bModifyVillagerSpeedScalar;                        // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F3A[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VillagerSpeedScalarModifier;                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F3B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurrencyConfig*                       CurrencyToAdd;                                     // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrencyAmountToAdd;                               // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVitalType                        VitalTypeToAdd;                                    // 0x1C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F3C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        VitalAmountToAdd;                                  // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F3D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FValeriaItem                          ItemToAdd;                                         // 0x28(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bOverflowToStorage;                                // 0x78(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRemoveItemToAddInstead;                           // 0x79(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTryToUpdateRelevantStats;                         // 0x7A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowPickupRewards;                               // 0x7B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESkillType                        SkillTypeToAdd;                                    // 0x7C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F3E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SkillAmountToAdd;                                  // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerId;                                        // 0x84(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerCoreId;                                    // 0x88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FriendshipAmount;                                  // 0x8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RomanceAmount;                                     // 0x90(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERomanceStateChange               RomanceStateChange;                                // 0x94(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F3F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RecipeId;                                          // 0x98(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TeleportCharacter;                                 // 0x9C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F40[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               TeleportCharacterTo;                               // 0xA0(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TeleportVisitPlot;                                 // 0xB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F41[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                TeleportCharacterToPlotId;                         // 0xC0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BuffId;                                            // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UpdateMetaData;                                    // 0xD4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F42[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVALDTOS_MetaCharacterFormat          MetaData;                                          // 0xD8(0x718)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        VillagerQuestConfigIdToComplete;                   // 0x7F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerQuestConfigIdToGrant;                      // 0x7F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerMailMessageConfigId;                       // 0x7F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerQuestConfigIdToFulfill;                    // 0x7FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerQuestRequirementIndexToFulfill;            // 0x800(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F43[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                ActorToUpgrade;                                    // 0x808(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ConsoleCommand;                                    // 0x810(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ResetAllSeenDialogue;                              // 0x820(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F44[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          TagToSet;                                          // 0x824(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TagValueToSet;                                     // 0x82C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RandomizeGiftPreferences;                          // 0x830(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F45[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        EnableExplicitGiftPreference;                      // 0x834(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RevealGiftPreferences;                             // 0x838(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForgetGiftPreferences;                             // 0x839(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ClearAllGiftPreferences;                           // 0x83A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ClearAllGiftHistory;                               // 0x83B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AcquireStorageBag;                                 // 0x83C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F46[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDebugCheatPlaceItems                 PlaceItems;                                        // 0x840(0x70)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         bMaxOutPlayer;                                     // 0x8B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bKickMeOff;                                        // 0x8B1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F47[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDebugCheatActorSpawn>         ActorsToSpawn;                                     // 0x8B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bResetChallengeProgress;                           // 0x8C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bChallengeWeeklyReset;                             // 0x8C9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F48[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                StatToSetName;                                     // 0x8D0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDebugCheatStatType               StatToSetType;                                     // 0x8E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F49[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                StatToSetValue;                                    // 0x8E8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUnlockAllGearTypes;                               // 0x8F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDowngradeItem;                                    // 0x8F9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F4A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCheatSetConfig*                       CheatSetConfig;                                    // 0x900(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct Palia.ErrorMessage
struct FErrorMessage
{
public:
	class FName                                  ErrorId;                                           // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VillagerQuestConfigId;                             // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F4D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AValeriaCharacter*                     Character;                                         // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x18(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.ValeriaInputSettings
struct FValeriaInputSettings
{
public:
	bool                                         bInvertMouseXAxis;                                 // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInvertMouseYAxis;                                 // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F4E[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MouseSensitivity;                                  // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.PlotPresence
struct FPlotPresence
{
public:
	bool                                         bAtHome;                                           // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnPlot;                                           // 0x1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F4F[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AHousingPlotActor*                     CurrentHousingPlot;                                // 0x8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.GardenActionParams
struct FGardenActionParams
{
public:
	enum class EGardenActionType                 ActionType;                                        // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F50[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBagSlotLocation                      ItemLocation;                                      // 0x4(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        PlotIndex;                                         // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.HousingSlotActionParams
struct FHousingSlotActionParams
{
public:
	enum class EHousingSlotAction                Action;                                            // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHousingSlotType                  SlotType;                                          // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F51[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SlotId;                                            // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Name;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CostChoice;                                        // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHousingVisitationState           Visitation;                                        // 0x1C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F52[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Palia.SessionActorId
struct FSessionActorId
{
public:
	int32                                        ID;                                                // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.PlacementRegionId
struct FPlacementRegionId
{
public:
	class FString                                AnchorId;                                          // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSessionActorId                       ParentSessionId;                                   // 0x10(0x4)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPersistActorId                       ParentPersistId;                                   // 0x14(0x24)(RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0xC (0xC - 0x0)
// ScriptStruct Palia.SimpleDecorExtraField
struct FSimpleDecorExtraField
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        IntValue;                                          // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xAC (0xB8 - 0xC)
// ScriptStruct Palia.SimpleDecorPlaceable
struct FSimpleDecorPlaceable : public FFastArraySerializerItem
{
public:
	int32                                        ItemPersistId;                                     // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        TintPersistID;                                     // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F53[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSessionActorId                       SessionId;                                         // 0x14(0x4)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlacementRegionId                    Anchor;                                            // 0x18(0x38)(NativeAccessSpecifierPublic)
	struct FVector                               Position;                                          // 0x50(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              Rotation;                                          // 0x68(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FSimpleDecorExtraField>        ExtraFields;                                       // 0x80(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        SlotId;                                            // 0x90(0x4)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPersistActorId                       PersistId;                                         // 0x94(0x24)(RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct Palia.DialogueToShow
struct FDialogueToShow
{
public:
	int32                                        ConfigId;                                          // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AlternativeScriptId;                               // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_QuestDef>          QuestDef;                                          // 0x8(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsQuestPinned;                                    // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F54[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UActorTagComponent*                    VillagerTagComponent;                              // 0x40(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPersistentTagMapComponent*            PlayerTagComponent;                                // 0x48(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F55[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x198 (0x198 - 0x0)
// ScriptStruct Palia.DialogueListToShow
struct FDialogueListToShow
{
public:
	TArray<struct FDialogueToShow>               Dialogues;                                         // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FDialogueToShow                       StartupDialogue;                                   // 0x10(0x80)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FDialogueToShow                       GreetingDialogue;                                  // 0x90(0x80)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FDialogueToShow                       GiftHintDialogue;                                  // 0x110(0x80)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         IsBranchingDialogueChoice;                         // 0x190(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsDialogueRefresh;                                 // 0x191(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F56[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.TelemetryClientDataForMapTravelLoadTime
struct FTelemetryClientDataForMapTravelLoadTime
{
public:
	int64                                        StartTime;                                         // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                        EndTime;                                           // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StartMap;                                          // 0x10(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                EndMap;                                            // 0x20(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MapTravelReason;                                   // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F57[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Palia.WallpaperItem
struct FWallpaperItem
{
public:
	class FName                                  WallTagName;                                       // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SurfaceId;                                         // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F58[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> WallpaperItemType;                                 // 0x10(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.HouseOwnershipTitle
struct FHouseOwnershipTitle
{
public:
	struct FGuid                                 UserGuid;                                          // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 HousingGuid;                                       // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHousingPermissionLevel           PermissionLevel;                                   // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F59[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        HousingSlot;                                       // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.RecipePlayerOptionMapping
struct FRecipePlayerOptionMapping
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SimpleIngredientIndex;                             // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F5A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.RecipePlayerOptions
struct FRecipePlayerOptions
{
public:
	TArray<struct FRecipePlayerOptionMapping>    IngredientsToUse;                                  // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         UseStarQualityItems;                               // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F5B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CraftMultiplier;                                   // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.MusicState
struct FMusicState
{
public:
	TArray<int32>                                PlayedNotes;                                       // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UInstrumentSongConfig*                 MatchedSong;                                       // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.VAL_PostDialogueChainGiftInfo
struct FVAL_PostDialogueChainGiftInfo
{
public:
	class AValeriaCharacter*                     PlayerCharacter;                                   // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVillagerGiftReceiverComponent*        GiftReceiver;                                      // 0x8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBagSlotLocation                      BagSlotLocation;                                   // 0x10(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VAL_PostDialogueChainSupplementaryInfo
struct FVAL_PostDialogueChainSupplementaryInfo
{
public:
	TArray<struct FVAL_PostDialogueChainGiftInfo> PostDialogueChainGiftInfos;                        // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.AnimState
struct FAnimState
{
public:
	struct FGameplayTag                          State;                                             // 0x0(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          SubState;                                          // 0x8(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Transition;                                        // 0x10(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.ArcadeLeaderboardEntry
struct FArcadeLeaderboardEntry
{
public:
	int32                                        Score;                                             // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F5C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// ScriptStruct Palia.SingleQuestReward
struct FSingleQuestReward
{
public:
	int32                                        Amount;                                            // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F5D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x8(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        QualityStars;                                      // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVitalType                        VitalType;                                         // 0x3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bVitalChangeMax;                                   // 0x3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F5E[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurrencyConfig*                       Currency;                                          // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RelationshipVillagerId;                            // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RelationshipVillagerCoreId;                        // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FriendshipChange;                                  // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RomanceChange;                                     // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERomanceStateChange               RomanceStateChange;                                // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F5F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RecipeConfigId;                                    // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.TimeOfDayHourMinute
struct FTimeOfDayHourMinute
{
public:
	int32                                        Hour;                                              // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Minute;                                            // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.TimeOfDayFilter
struct FTimeOfDayFilter
{
public:
	int32                                        Periods;                                           // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimeOfDayHourMinute                  MinTime;                                           // 0x4(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FTimeOfDayHourMinute                  MaxTime;                                           // 0xC(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bAllowEditMaxTime;                                 // 0x14(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F60[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.VillagerRelationshipFilter
struct FVillagerRelationshipFilter
{
public:
	float                                        MinLevel;                                          // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxLevel;                                          // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.SpecificVillagerRelationshipFilter
struct FSpecificVillagerRelationshipFilter
{
public:
	struct FDataTableRowHandle                   Villager;                                          // 0x0(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVillagerRelationshipFilter           Filter;                                            // 0x10(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct Palia.QuestActivityPrereq
struct FQuestActivityPrereq
{
public:
	int32                                        QuestConfigId;                                     // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVillagerQuestStatus              Status;                                            // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F61[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Step;                                              // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VillagerQuestItemReqSubConfig
struct FVillagerQuestItemReqSubConfig
{
public:
	class UVAL_ItemTypeDefinitionAsset*          RequiredItemType;                                  // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmountRequired;                                    // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StarQualityRequired;                               // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.VillagerVitalReqSubConfig
struct FVillagerVitalReqSubConfig
{
public:
	enum class EVitalType                        VitalType;                                         // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F62[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MinimumAmount;                                     // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xB0 (0xB0 - 0x0)
// ScriptStruct Palia.LootRequirements
struct FLootRequirements
{
public:
	struct FTimeOfDayFilter                      TimeOfDay;                                         // 0x0(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FSpecificVillagerRelationshipFilter> FriendshipRequirements;                            // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSpecificVillagerRelationshipFilter> RomanceRequirements;                               // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPersistentTagFilter>          PlayerTagRequirements;                             // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FQuestActivityPrereq>          QuestPrereqs;                                      // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVillagerQuestItemReqSubConfig> RequiredItems;                                     // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVillagerVitalReqSubConfig            VitalRequirement;                                  // 0x68(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FString>                        RequiredAccomplishments;                           // 0x70(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataTableRowHandle>           RequiredRecipes;                                   // 0x80(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 WeatherGameStates;                                 // 0x90(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x110 (0x110 - 0x0)
// ScriptStruct Palia.ChallengeClientInfo
struct FChallengeClientInfo
{
public:
	class FText                                  DisplayName;                                       // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  DisplayText;                                       // 0x18(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FLootRequirements                     Requirements;                                      // 0x30(0xB0)(NativeAccessSpecifierPublic)
	TArray<int32>                                GoalAmounts;                                       // 0xE0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSingleQuestReward>            Rewards;                                           // 0xF0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGuid                                 Guid;                                              // 0x100(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1E0 (0x1E0 - 0x0)
// ScriptStruct Palia.CharacterStateChangeParams
struct FCharacterStateChangeParams
{
public:
	struct FAnimState                            AnimState;                                         // 0x0(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FDialogueListToShow                   DialoguesToShow;                                   // 0x18(0x198)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UDialogueComponent*                    Dialogue;                                          // 0x1B0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPlayerInfoState                  PlayerInfoState;                                   // 0x1B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F63[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGardenActionParams                   GardenParams;                                      // 0x1BC(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        BookToReadId;                                      // 0x1CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVillagerGiftReceiverComponent*        GiftReceiver;                                      // 0x1D0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         LeaveDialogueUnchanged;                            // 0x1D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F64[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// ScriptStruct Palia.CrafterComponent_ChangeContext_OldValues
struct FCrafterComponent_ChangeContext_OldValues
{
public:
	enum class ECrafterState                     OldState;                                          // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// ScriptStruct Palia.CrafterComponent_ChangeContext
struct FCrafterComponent_ChangeContext
{
public:
	bool                                         StateChanged;                                      // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RecipeChanged;                                     // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RecipeInstanceChanged;                             // 0x2(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.CompleRecipeCrafterProductState
struct FCompleRecipeCrafterProductState
{
public:
	class UCrafterComponent*                     CrafterComponent;                                  // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EComplexRecipeCrafterCurrentProductState OneProductState;                                   // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F65[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.Recipe_RequireItem
struct FRecipe_RequireItem
{
public:
	class UVAL_ItemTypeDefinitionAsset*          ItemType;                                          // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          GameplayTag;                                       // 0x8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemAmount;                                        // 0x10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F66[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.ComplexRecipeProduct
struct FComplexRecipeProduct
{
public:
	TArray<struct FCompleRecipeCrafterProductState> CrafterProductStates;                              // 0x0(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRecipe_RequireItem                   Item;                                              // 0x10(0x18)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	enum class EComplexRecipeCrafterCurrentProductState ConsolidatedOneProductState;                       // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EComplexRecipeProducerAllProductState AllProductState;                                   // 0x29(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F67[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RemainingToMake;                                   // 0x2C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        RemainingToUse;                                    // 0x30(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3F68[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.ComplexRecipeCrafter
struct FComplexRecipeCrafter
{
public:
	TArray<struct FComplexRecipeProduct>         Products;                                          // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                        CrafterPersistId;                                  // 0x10(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RemainingRecipes;                                  // 0x14(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.Recipe_RequireInteraction
struct FRecipe_RequireInteraction
{
public:
	class URecipeInteractionConfig*              Config;                                            // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InteractionTimeSecs;                               // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RequiredSuccessCount;                              // 0xC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PlayerMarkerMovementEasingFuncBlendExp;            // 0x10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F69[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// ScriptStruct Palia.RecipeStepConfig
struct FRecipeStepConfig
{
public:
	enum class ERecipeStepType                   Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F6A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRecipe_RequireItem                   Type_Item;                                         // 0x8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FRecipe_RequireInteraction            Type_Interaction;                                  // 0x20(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	enum class ERecipeStepStartType              StartType;                                         // 0x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F6B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ParentStep;                                        // 0x3C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                StepIndices;                                       // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                        RevealTime;                                        // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RequestExpirationTime;                             // 0x54(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.EquipmentMetaData
struct FEquipmentMetaData
{
public:
	struct FBagSlotLocation                      InventoryLocation;                                 // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	enum class EEquipmentType                    EquipmentType;                                     // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F6C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        WaterAmount;                                       // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHidden;                                           // 0x10(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F6D[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// ScriptStruct Palia.EquipmentItem
struct FEquipmentItem
{
public:
	struct FEquipmentMetaData                    ItemMetaData;                                      // 0x0(0x14)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F6E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x18(0x30)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AEquipViewActor*>               SpawnedActors;                                     // 0x48(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Palia.FishNibbles
struct FFishNibbles
{
public:
	TArray<float>                                Nibbles;                                           // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<enum class EFishingNibbleLevel>       NibbleLevels;                                      // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x130 (0x130 - 0x0)
// ScriptStruct Palia.FishingMiniGameViewState
struct FFishingMiniGameViewState
{
public:
	enum class EFishingMiniGameState             State;                                             // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFishingMiniGameResult            EndState;                                          // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F6F[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimState                            AnimState;                                         // 0x4(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F70[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            World;                                             // 0x20(0x60)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StateLerp;                                         // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SafeZoneOffset;                                    // 0x84(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SafeZoneLength;                                    // 0x88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDamage;                                         // 0x8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxHp;                                             // 0x90(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F71[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class AActor>                  FishBlueprint;                                     // 0x98(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsNibblingPhase;                                   // 0xC8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F72[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NibbleTime;                                        // 0xCC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFishNibbles>                  Nibbles;                                           // 0xD0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         IsBiting;                                          // 0xE0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReelButtonHeld;                                    // 0xE1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F73[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BobberPosition;                                    // 0xE4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RodPosition;                                       // 0xE8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        JumpEndTimeMs;                                     // 0xEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsJumping;                                         // 0xF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F74[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Damage;                                            // 0xF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Hp;                                                // 0xF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceToShore;                                   // 0xFC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FishSpeed;                                         // 0x100(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TimeMs;                                            // 0x104(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               CastPosition;                                      // 0x108(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeEncouraged;                                  // 0x120(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldStruggle;                                   // 0x121(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F75[0xE];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Palia.VAL_ClientInteractableProp
struct FVAL_ClientInteractableProp
{
public:
	class AActor*                                PropActor;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECharacterAttachPoint             AttachPoint;                                       // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F76[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AValeriaCharacter*                     InteractingPlayer;                                 // 0x10(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                       AttachParent;                                      // 0x18(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3F77[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x154 (0x160 - 0xC)
// ScriptStruct Palia.TrackedItemInfo
struct FTrackedItemInfo : public FFastArraySerializerItem
{
public:
	uint8                                        Pad_3F78[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                Actor;                                             // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      OwnerNetworkId;                                    // 0x18(0x30)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InstanceId;                                        // 0x48(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F79[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             Alignment;                                         // 0x50(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             MainIcon;                                          // 0x60(0x30)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             ActivityIcon;                                      // 0x90(0x30)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             QuestIcon;                                         // 0xC0(0x30)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseQuestIconOnCompass;                            // 0xF0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanAppearAsInWorldMarker;                         // 0xF1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnCompass;                                        // 0xF2(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSmallOnMap;                                       // 0xF3(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F7A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  DisplayText;                                       // 0xF8(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bIsTextOnly;                                       // 0x110(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanUserTrack;                                     // 0x111(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETrackedItemType                  Type;                                              // 0x112(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F7B[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Tooltip;                                           // 0x118(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector                               Location;                                          // 0x130(0x18)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Yaw;                                               // 0x148(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsTrackedByResourceTrackerBuff;                   // 0x14C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F7C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxVisibleDistance;                                // 0x150(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AreaRadius;                                        // 0x154(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWorldLocationContext             WorldLocationContext;                              // 0x158(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bQuestTrackingAttached;                            // 0x159(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasPinned;                                        // 0x15A(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F7D[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.LootEvent
struct FLootEvent
{
public:
	TArray<struct FQuestReward>                  Rewards;                                           // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class AValeriaCharacter*                     Character;                                         // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                LootInstigatorName;                                // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.VitalsChangeContext
struct FVitalsChangeContext
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x8(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct Palia.VitalsChange
struct FVitalsChange
{
public:
	enum class EVitalType                        VitalType;                                         // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F7E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AmountChanged;                                     // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVitalChangeFlags                 Flags;                                             // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F7F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVitalsChangeContext                  Context;                                           // 0x10(0x38)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Palia.FishCaughtResult
struct FFishCaughtResult
{
public:
	bool                                         bWasPerfectCatch;                                  // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasFirstTimeCatch;                                // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EItemCategory                     FishCategory;                                      // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F80[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UVAL_ItemTypeDefinitionAsset*          FishType;                                          // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FishQuality;                                       // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F81[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.InventoryChange
struct FInventoryChange
{
public:
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x0(0x30)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Amount;                                            // 0x30(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F82[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x78 (0x78 - 0x0)
// ScriptStruct Palia.Mail
struct FMail
{
public:
	enum class EMailType                         MailType;                                          // 0x0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F83[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                MailId;                                            // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EReadStatus                       ReadStatus;                                        // 0x18(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EActionableState                  ActionableState;                                   // 0x19(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMailSenderType                   MailSenderType;                                    // 0x1A(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F84[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                SenderId;                                          // 0x20(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                RecipientUserId;                                   // 0x30(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MessageContent;                                    // 0x40(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInventoryChange>              ExchangeItems;                                     // 0x50(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDateTime                             SentDateTime;                                      // 0x60(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             ExpireDateTime;                                    // 0x68(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             LastUpdatedDateTime;                               // 0x70(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.Mailbox
struct FMailbox
{
public:
	TArray<struct FMail>                         Items;                                             // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.MessageTarget
struct FMessageTarget
{
public:
	enum class EMessageTargetType                Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F85[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                RecipientId;                                       // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                RecipientCharacterName;                            // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct Palia.Message
struct FMessage
{
public:
	struct FMessageTarget                        Target;                                            // 0x0(0x28)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FromID;                                            // 0x28(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FromCharacterName;                                 // 0x38(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x68 - 0x48)
// ScriptStruct Palia.ValeriaChatMessage
struct FValeriaChatMessage : public FMessage
{
public:
	enum class EChatMessageType                  ChatMessageType;                                   // 0x48(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F86[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Content;                                           // 0x50(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             Timestamp;                                         // 0x60(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x70 - 0x48)
// ScriptStruct Palia.ControlMessage
struct FControlMessage : public FMessage
{
public:
	enum class EControlMessageType               ControlMessageType;                                // 0x48(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F87[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Content;                                           // 0x50(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FromWorldName;                                     // 0x60(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// ScriptStruct Palia.Presence
struct FPresence
{
public:
	struct FUniqueNetIdRepl                      ID;                                                // 0x0(0x30)(Edit, BlueprintVisible, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVAL_PresenceStatus               Status;                                            // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F88[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                FromServerName;                                    // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MapName;                                           // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                StatusString;                                      // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 CharacterId;                                       // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CharacterName;                                     // 0x78(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Palia.VAL_ValidateLoadoutError_ErrorItems
struct FVAL_ValidateLoadoutError_ErrorItems
{
public:
	TSet<class UVAL_CharacterCustomizationItemBase*> ErroredItems;                                      // 0x0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Palia.VAL_ValidateLoadoutErrorPayload
struct FVAL_ValidateLoadoutErrorPayload
{
public:
	TMap<enum class EVAL_LoadoutErrorType, struct FVAL_ValidateLoadoutError_ErrorItems> ErrorToItemMap;                                    // 0x0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct Palia.VillagerActionInfo
struct FVillagerActionInfo
{
public:
	class FText                                  UiText;                                            // 0x0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>             AnimationMappingConfigDataTable;                   // 0x18(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AnimationMappingConfigRowName;                     // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             ActionIcon;                                        // 0x50(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Palia.VAL_InteractorLockParams
struct FVAL_InteractorLockParams
{
public:
	class UInteractableComponent*                Interactable;                                      // 0x0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USphereComponent*                      InteractableLocation;                              // 0x8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UObject>                SourceContext;                                     // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UObject>                TargetEngaged;                                     // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECharacterState                   CharacterState;                                    // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnforceFacing;                                    // 0x21(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnforcePosition;                                  // 0x22(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F89[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.ValeriaAudioSettings
struct FValeriaAudioSettings
{
public:
	float                                        OverallVolume;                                     // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SoundVolume;                                       // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MusicVolume;                                       // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DialogueVolume;                                    // 0xC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPanningRule                      AudioPanningRule;                                  // 0x10(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAudioMixProfiles                 AudioMixProfile;                                   // 0x11(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         MuteWhenNotInFocus;                                // 0x12(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F8A[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.ValeriaGameplaySettings
struct FValeriaGameplaySettings
{
public:
	bool                                         bAllowCameraShake;                                 // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableReticle;                                    // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideChatTimestamp;                                // 0x2(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F8B[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumStorageBagsInActionBar;                         // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESprintType                       SprintType;                                        // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowEatingWhenFull;                              // 0x9(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowCookingCamera;                                // 0xA(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowServerPing;                                   // 0xB(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableActionBarWrapping;                          // 0xC(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMaxGoldRepairSlider;                              // 0xD(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMaxToolkitRepairSlider;                           // 0xE(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRepairAll;                                        // 0xF(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Palia.ValeriaGraphicSettings
struct FValeriaGraphicSettings
{
public:
	float                                        FOV;                                               // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct Palia.ValeriaMenuSettings
struct FValeriaMenuSettings
{
public:
	TMap<enum class EVAL_QuestCategory, bool>    QuestCategoriesExpanded;                           // 0x0(0x50)(BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	bool                                         CompletedQuestCategoryExpanded;                    // 0x50(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F8C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        LastSelectedQuestId;                               // 0x54(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VillagerRelationshipChange
struct FVillagerRelationshipChange
{
public:
	int32                                        VillagerCoreId;                                    // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmountChanged;                                     // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERelationshipType                 Type;                                              // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bNewLevelReached;                                  // 0x9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F8D[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NewLevel;                                          // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Palia.ComplexRecipeIngredient
struct FComplexRecipeIngredient
{
public:
	int32                                        UniqueId;                                          // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 OwningPlayerId;                                    // 0x4(0x10)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 CarryingPlayerId;                                  // 0x14(0x10)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        QualityStars;                                      // 0x24(0x4)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SellValueOfInputs;                                 // 0x28(0x4)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsCarried;                                        // 0x2C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F8E[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.ComplexRecipeIngredientSet
struct FComplexRecipeIngredientSet
{
public:
	int32                                        ItemPersistId;                                     // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CrafterPersistId;                                  // 0x4(0x4)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            ItemIcon;                                          // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FComplexRecipeIngredient>      Shelved;                                           // 0x10(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FComplexRecipeIngredient>      InPlay;                                            // 0x20(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bShelvedHasStarQuality;                            // 0x30(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIntermediate;                                     // 0x31(0x1)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F8F[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Palia.ComplexRecipeMinigame
struct FComplexRecipeMinigame
{
public:
	float                                        SuccessPercent;                                    // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct Palia.AddedIngredient
struct FAddedIngredient
{
public:
	struct FValeriaItem                          Item;                                              // 0x0(0x50)(NativeAccessSpecifierPublic)
	struct FGuid                                 PlayerId;                                          // 0x50(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIntermediate;                                     // 0x60(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F90[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Palia.ComplexRecipeRecord
struct FComplexRecipeRecord
{
public:
	int32                                        RecipeId;                                          // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESkillType                        SkillType;                                         // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F91[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCrafterComponent*                     OwningCrafter;                                     // 0x8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CrafterConfigId;                                   // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F92[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FComplexRecipeCrafter>         Crafters;                                          // 0x18(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FComplexRecipeIngredientSet>   Ingredients;                                       // 0x28(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FComplexRecipeMinigame>        Minigames;                                         // 0x38(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAddedIngredient>              UsedItems;                                         // 0x48(0x10)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	class FString                                SessionId;                                         // 0x58(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EComplexRecipeState               State;                                             // 0x68(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bConsumeStarQualityIngredients;                    // 0x69(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F93[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.EquipItemConfig
struct FEquipItemConfig
{
public:
	class UVAL_ItemTypeDefinitionAsset*          ItemType;                                          // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.AbilityToolConfig
struct FAbilityToolConfig
{
public:
	struct FEquipItemConfig                      ToolEquippedConfig;                                // 0x0(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UValeriaGASGameplayAbility> PlayerAbility;                                     // 0x8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE8 - 0x8)
// ScriptStruct Palia.CrafterConfig
struct FCrafterConfig : public FTableRowBase
{
public:
	int32                                        PersistId;                                         // 0x8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F96[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CrafterName;                                       // 0x10(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  CrafterPromptOverride;                             // 0x28(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  CurrentJobTextOverride;                            // 0x40(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             HudIcon;                                           // 0x58(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  CrafterFToInteractText;                            // 0x88(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	enum class ESkillType                        SkillType;                                         // 0xA0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStarQuality;                                      // 0xA1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMultiCraftCapable;                                // 0xA2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowIntermixingRegularAndStarQualityIngredients; // 0xA3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RequiredLevel;                                     // 0xA4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CraftTimeMultiplier;                               // 0xA8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CraftTimeOverride;                                 // 0xAC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECrafterMode                      Mode;                                              // 0xB0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBurnsStuff;                                       // 0xB1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideInWorldUIWhileCrafting;                       // 0xB2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutoPickupOnCraftingEnd;                          // 0xB3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideRecipesUIPane;                                // 0xB4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F97[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAbilityToolConfig                    AbilityActivate;                                   // 0xB8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAbilityToolConfig                    AbilityAddIngredient;                              // 0xC8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAbilityToolConfig                    AbilityCollect;                                    // 0xD8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Palia.StarQualityConstraint
struct FStarQualityConstraint
{
public:
	int32                                        MinQualityStars;                                   // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxQualityStars;                                   // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// ScriptStruct Palia.InventoryRequest
struct FInventoryRequest
{
public:
	struct FGuid                                 RequestId;                                         // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      RequesterId;                                       // 0x10(0x30)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInventoryRequestStatus           Status;                                            // 0x40(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F99[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemId;                                            // 0x44(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemType;                                          // 0x48(0x30)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemCount;                                         // 0x78(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemCountPartial;                                  // 0x7C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             CreatedAt;                                         // 0x80(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             ExpiresAt;                                         // 0x88(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      FillerId;                                          // 0x90(0x30)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             FilledTime;                                        // 0xC0(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FilledStarQuality;                                 // 0xC8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStarQualityConstraint                StarQualityConstraint;                             // 0xCC(0x8)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F9A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Palia.VAL_ServerSpace
struct FVAL_ServerSpace
{
public:
	struct FGuid                                 ID;                                                // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EVAL_ServerSpaceType              Type;                                              // 0x10(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F9B[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Palia.SessionActorRecord
struct FSessionActorRecord
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F9C[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.PrivateSpaceDestination
struct FPrivateSpaceDestination
{
public:
	class UPrivateSpaceLevelHandle*              PSHandle;                                          // 0x0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTeleportDestinationComponent*         TeleportDestination;                               // 0x8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.TargetPointArray
struct FTargetPointArray
{
public:
	TArray<class AValeriaTargetPoint*>           Entries;                                           // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Palia.VAL_ServerSpaceContainer
struct FVAL_ServerSpaceContainer
{
public:
	TMap<struct FGuid, struct FVAL_ServerSpace>  Table;                                             // 0x0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Palia.VAL_CharacterCustomization_BodyData
struct FVAL_CharacterCustomization_BodyData
{
public:
	float                                        HeightScalar;                                      // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThicknessScalar;                                   // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GenderExpressionScalar;                            // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MuscularExpressionScalar;                          // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x918 (0x918 - 0x0)
// ScriptStruct Palia.VAL_CharacterCustomizationLoadout
struct FVAL_CharacterCustomizationLoadout
{
public:
	enum class EVAL_CharacterBodyType            BodyType;                                          // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F9D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVAL_CharacterCustomization_BodyData  BodyData;                                          // 0x4(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F9E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_AnimSet> AnimSetItem;                                       // 0x18(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              AnimSet_VariantSelections;                         // 0x48(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_SkinTone> SkinToneItem;                                      // 0x98(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              SkinTone_VariantSelections;                        // 0xC8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Eyes> EyesItem;                                          // 0x118(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Eyes_VariantSelections;                            // 0x148(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_HairStyle> HairStyleItem;                                     // 0x198(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              HairStyle_VariantSelections;                       // 0x1C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Head> HeadItem;                                          // 0x218(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Head_VariantSelections;                            // 0x248(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Torso> TorsoItem;                                         // 0x298(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Torso_VariantSelections;                           // 0x2C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Legs> LegsItem;                                          // 0x318(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Legs_VariantSelections;                            // 0x348(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Hat> HatItem;                                           // 0x398(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Hat_VariantSelections;                             // 0x3C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_FaceMask> FaceMaskItem;                                      // 0x418(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              FaceMask_VariantSelections;                        // 0x448(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_FacialHairStyle> FacialHairStyleItem;                               // 0x498(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              FacialHairStyle_VariantSelections;                 // 0x4C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_FaceTattoo> FaceTattooItem;                                    // 0x518(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              FaceTattoo_VariantSelections;                      // 0x548(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_BodyTattoo> BodyTattooItem;                                    // 0x598(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              BodyTattoo_VariantSelections;                      // 0x5C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Makeup> MakeupItem;                                        // 0x618(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Makeup_VariantSelections;                          // 0x648(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_FaceComplexion> FaceComplexionItem;                                // 0x698(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              FaceComplexion_VariantSelections;                  // 0x6C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_BodyComplexion> BodyComplexionItem;                                // 0x718(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              BodyComplexion_VariantSelections;                  // 0x748(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Glider> GliderItem;                                        // 0x798(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Glider_VariantSelections;                          // 0x7C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Voice> VoiceItem;                                         // 0x818(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Voice_VariantSelections;                           // 0x848(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_CharacterCustomizationItem_Pet> PetItem;                                           // 0x898(0x30)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGuid>              Pet_VariantSelections;                             // 0x8C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Palia.BingoBoardgameState
struct FBingoBoardgameState
{
public:
	int32                                        BingoGridCellProgressArray[0x19];                  // 0x0(0x64)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F9F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             ExpirationTime;                                    // 0x68(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct Palia.BingoBoardGridCellTemplate
struct FBingoBoardGridCellTemplate
{
public:
	struct FDataTableRowHandle                   ItemReference;                                     // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ItemTypeReference;                                 // 0x10(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        QualityStars;                                      // 0x40(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemGoalAmount;                                    // 0x44(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x728 (0x728 - 0x0)
// ScriptStruct Palia.BingoBoardTemplateData
struct FBingoBoardTemplateData
{
public:
