#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x0 - 0x0)
// Function Seq_CharSelect_010.Seq_CharSelect_010 (Director BP)_C.SequenceEvent__ENTRYPOINTSeq_CharSelect_010 (Director BP)_3
struct USeq_CharSelect_010__Director_BP__C_SequenceEvent__ENTRYPOINTSeq_CharSelect_010__Director_BP__3_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Seq_CharSelect_010.Seq_CharSelect_010 (Director BP)_C.SequenceEvent__ENTRYPOINTSeq_CharSelect_010 (Director BP)_2
struct USeq_CharSelect_010__Director_BP__C_SequenceEvent__ENTRYPOINTSeq_CharSelect_010__Director_BP__2_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function Seq_CharSelect_010.Seq_CharSelect_010 (Director BP)_C.SequenceEvent__ENTRYPOINTSeq_CharSelect_010 (Director BP)_1
struct USeq_CharSelect_010__Director_BP__C_SequenceEvent__ENTRYPOINTSeq_CharSelect_010__Director_BP__1_Params
{
public:
	class ABP_vfx_charCreate_EssenceA_C*         BP_vfx_charCreate_EssenceA;                        // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Seq_CharSelect_010.Seq_CharSelect_010 (Director BP)_C.SequenceEvent__ENTRYPOINTSeq_CharSelect_010 (Director BP)_0
struct USeq_CharSelect_010__Director_BP__C_SequenceEvent__ENTRYPOINTSeq_CharSelect_010__Director_BP__0_Params
{
public:
	class ABP_vfx_charCreate_EssenceA_C*         BP_vfx_charCreate_EssenceA;                        // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Seq_CharSelect_010.Seq_CharSelect_010 (Director BP)_C.SequenceEvent__ENTRYPOINTSeq_CharSelect_010 (Director BP)
struct USeq_CharSelect_010__Director_BP__C_SequenceEvent__ENTRYPOINTSeq_CharSelect_010__Director_BP__Params
{
public:
	class ABP_vfx_charCreate_EssenceA_C*         BP_vfx_charCreate_EssenceA;                        // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Seq_CharSelect_010.Seq_CharSelect_010 (Director BP)_C.BP_vfx_charCreate_EssenceA_Event_0
struct USeq_CharSelect_010__Director_BP__C_BP_vfx_charCreate_EssenceA_Event_0_Params
{
public:
	class ABP_vfx_charCreate_EssenceA_C*         BP_vfx_charCreate_EssenceA;                        // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Seq_CharSelect_010.Seq_CharSelect_010 (Director BP)_C.BP_vfx_charCreate_EssenceA_Event_1
struct USeq_CharSelect_010__Director_BP__C_BP_vfx_charCreate_EssenceA_Event_1_Params
{
public:
	class ABP_vfx_charCreate_EssenceA_C*         BP_vfx_charCreate_EssenceA;                        // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Seq_CharSelect_010.Seq_CharSelect_010 (Director BP)_C.BP_vfx_charCreate_EssenceA_Event_2
struct USeq_CharSelect_010__Director_BP__C_BP_vfx_charCreate_EssenceA_Event_2_Params
{
public:
	class ABP_vfx_charCreate_EssenceA_C*         BP_vfx_charCreate_EssenceA;                        // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function Seq_CharSelect_010.Seq_CharSelect_010 (Director BP)_C.StartAudio
struct USeq_CharSelect_010__Director_BP__C_StartAudio_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Seq_CharSelect_010.Seq_CharSelect_010 (Director BP)_C.StartMagicSFX
struct USeq_CharSelect_010__Director_BP__C_StartMagicSFX_Params
{
public:
};

// 0x2C (0x2C - 0x0)
// Function Seq_CharSelect_010.Seq_CharSelect_010 (Director BP)_C.ExecuteUbergraph_Seq_CharSelect_010 (Director BP)
struct USeq_CharSelect_010__Director_BP__C_ExecuteUbergraph_Seq_CharSelect_010__Director_BP__Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_458C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_vfx_charCreate_EssenceA_C*         K2Node_CustomEvent_BP_vfx_charCreate_EssenceA_2;   // 0x8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_vfx_charCreate_EssenceA_C*         K2Node_CustomEvent_BP_vfx_charCreate_EssenceA_1;   // 0x10(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_vfx_charCreate_EssenceA_C*         K2Node_CustomEvent_BP_vfx_charCreate_EssenceA;     // 0x18(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_AkEventGlobal_ReturnValue;                // 0x20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_AkEventGlobal_ReturnValue_1;              // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_AkEventGlobal_ReturnValue_2;              // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


