#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0xE38 (0xE38 - 0x0)
// Function ValeriaDTOs.VALDTOS_MetaCharacterCustomizationFuncLib.MetaCharacterFormat_EqualEqual
struct UVALDTOS_MetaCharacterCustomizationFuncLib_MetaCharacterFormat_EqualEqual_Params
{
public:
	struct FVALDTOS_MetaCharacterFormat          A;                                                 // 0x0(0x718)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVALDTOS_MetaCharacterFormat          B;                                                 // 0x718(0x718)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xE30(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1AD7[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x848 (0x848 - 0x0)
// Function ValeriaDTOs.VALDTOS_MetaCharacterCustomizationFuncLib.CharacterCustomizationOptions_EqualEqual
struct UVALDTOS_MetaCharacterCustomizationFuncLib_CharacterCustomizationOptions_EqualEqual_Params
{
public:
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Volatile A;                                                 // 0x0(0x420)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Volatile B;                                                 // 0x420(0x420)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x840(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1ADC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x578 (0x578 - 0x0)
// Function ValeriaDTOs.VALDTOS_MetaCharacterCustomizationFuncLib.CharacterCreationOptions_EqualEqual
struct UVALDTOS_MetaCharacterCustomizationFuncLib_CharacterCreationOptions_EqualEqual_Params
{
public:
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Stable A;                                                 // 0x0(0x2B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Stable B;                                                 // 0x2B8(0x2B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x570(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1AE3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

}
}


